[
    {
        "body": "Robert Edward Kennan killed himself in the Fall of 1999. I wasn’t there but it’s where my story begins. It begins with Rob, 17 years old, sitting in a burning car in the middle of a crowded parking lot one Monday night in October. He burned for nearly four hours before the police let the firemen near enough to put out the flames and pull out his body.\nI didn’t know him. Not really. We lived in a small town. I knew him by sight, knew his name, but I doubt we’d ever exchanged more than a few perfunctory words. It makes me feel funny talking about him, like I’m not justified doing it, but if I’m going to tell you about the Spire, it’s unavoidable. I have to tell you about Robert Edward Kennan and how the suicide notes he left behind tangled my life up with his.\n\nBack then, we both lived in a sleepy town in New England, a little over an hour northwest of Boston, just across the New Hampshire border. It’s the sort of place that’s nice to live, if you’re the sort of person that doesn’t like doing very much. There’s really only three reasons anyone ever steps foot in my hometown. The first is that they’re on their way to Nashua, the shopping Mecca of the northeast. The second would be the ice cream. We have a dairy farm where they sell the world’s best ice cream. All of it made right there on the premises. And the third is because they bought one of those “Haunted New England” books.\n\nUsually, you can find our town listed in those books twice. The first entry will likely be the story of how our high school, which is one of the ten oldest in the country, came to have the Silver Specter as its mascot. I always loved the Spector. It reflected how steeped in folklore rural New England once was, and, as mascots go, it’s much more interesting than the “Fighting (fill in the cat species here)” everyone else seems saddled with.\n\nWay back in the 1890s there was a terrible blizzard. A proper nor’easter. It dumped several feet of snow across the whole region. There were many, many casualties, mostly the very young and very old stuck in their homes without heat. One of the exceptions, who was neither very young nor very old, was Jennifer Wilkins. She was a teacher, trapped in the school when the blizzard hit.\n\nWhat little food there was in the school house couldn’t have lasted more than two days, and folks say by the fifth, she had resorted to boiling her boots, to soften up the leather for eating. It was two weeks before anyone was able to reach her. They found her, body thin as a matchstick, wrapped up in a gray wool blanket. If only they’d had paste in those days, she might have made it.\n\nThat old school house is now our town rec center. Supposedly, old Jenny still haunts its halls, wrapped in that gray wool blanket, her hollow, emaciated visage searching in vain for something to eat.\n\nOnce, when I was eight or nine years old, long before I knew the origins of the Silver Specter, I went up into the rec center’s attic alone. It was August, and I had snuck away from the rest of the summer reading program and my own interminable boredom. The dusty attic was filled with broken furniture and plastic bins containing the crafting supplies for all of the daycare programs. It would have been entirely forgettable if not for the drafts.\n\nThe summer had been hot and humid, but in the rec center’s attic, if you stepped in the wrong spot it’d get so cold that you could practically see your breath. I told my mom about it, and she was the one who told me about Jenny. I never went back up there alone.\n\nThe second story you typically find in those books is about the Blood cemetery. It’s real name is the Pine Hill Cemetery, but nobody calls it that. They call it the Blood Cemetery because it’s supposedly haunted by Abel Blood and his family.\n\nAccording to legend, Abel Blood lived in the center of what is now the cemetery back when it was farmland. He returned from the fields early one day to find his wife in bed with another man— a tall, dark-haired stranger. Abel was stunned. How could Mrs. Blood, a good Christian woman, do such a thing? Obviously this scoundrel was forcing himself on his wife!\n\nAbel retrieved his pitchfork and charged back into the house, his mind full of vengeance. But as he drew near, he heard his wife— mid-coitus— proclaim her love for the black-haired stranger, and with a note of satisfaction to her call that Abel had never heard before. Mr. Blood saw red.\n\nHe burst into the room, pitchfork held aloft, and ran them through. Over and over, he plunged the fork into their tangled bodies, before finally leaving them pinned, one on top of the other, to the bed beneath them.\n\nLooking at the bloody mess he’d made, Abel found his rage had not diminished. This seemed curious to Abel but it dawned on him why when he spied a picture of his family on the mantel. His children didn’t look anything like him, nor like their mother. They were all exceptionally tall, with full heads of somewhat greasy black hair.\n\nAbel waited, standing in the puddle of blood that had only moments ago been coursing through Mrs. Blood and her lover, and stewed in his ever deepening anger. He was a cuckold. He had no heir. He’d been raising another man’s children. A man who had been bedding Abel’s wife. For years.  Abel waited and stewed for several hours until his four children arrived home from school.\n\nThey say his sons and eldest daughter put up a noble fight, but they were children fighting a grown man whose muscles had been hardened by a lifetime of farm labor. Only Abel’s youngest daughter, barely 5 years old, made it out of the house alive. She sprinted as fast as her little legs could carry her in a desperate attempt to reach her neighbors. But even with her head start her little legs were no match for her father’s powerful strides. Just as she scrambled up over the stone wall separating their farm from the Hollises’, Abel picked up one of the stones and smashed it down on her head.\n\nThese days, if you go there, on the road that borders the cemetery you’ll see this curve full of skid marks. People say that they’re caused by cars swerving to avoid an oddly dressed little girl who runs out into the street each night.\n\nBack home, we had a rite of passage. As soon as you or one of your friends were old enough to drive, you had to trespass into the Blood Cemetery at night and make a rubbing of the Blood Family’s gravestones. I did it. And you should feel free to, but be prepared to be disappointed because none of the Bloods died on the same date.\n\nA lot of ghost stories are like that. Doesn’t mean they’re not fun, but what you come to realize as you get older is that they’re mostly a form of social control. Jennifer Wilkins really did die a horrible death, but the story of Abel Blood is nothing but a fantasy story with a rather dark, misogynistic message: cheat on your husband and he’ll kill you.\nI loved ghost stories growing up. Loved them. That’s what gave me my not-entirely-unearned reputation as “the spooky kid.” It was the reason that about a month after he died, Rob Kennan’s suicide note wound up in my lap. There, buried in the middle of apologies to his family and clear evidence of severe depression, was my first push towards the Spire in the Woods, the only ghost story I truly believe.\n\nIn 1999, I was a sophomore in high school.  Rob was a senior. He wasn’t what you’d call real popular. Part of it was that he wasn’t born in my hometown, but moved there in the seventh grade, right when kids are at their cruelest. The first I ever heard of him was a year later. There was a rumor floating around that he and a mentally handicapped girl were found naked in the woods together. The implication being that he’d tricked her into having sex with him. A couple of years later, I heard another, that his parents were forced to move because Rob had been molested by their old priest down in Amherst.\n\nTo the best of my knowledge these stories are entirely untrue, and I’m deeply ashamed to admit that when I was in the sixth grade, I did gleefully repeat that first one. I found it funny at the time. The second I also repeated. Just not as glibly. I whispered it to my friends, adopting a sage tone and offering it as an explanation for why the first rumor was probably true.\n\nI felt so goddamn smart. I had the inside scoop, something interesting to say, and everyone wanted to listen to me. I wish I’d kept my mouth shut. I wasn’t smart. I was just kicking a kid while he was down, spreading the lies that may have contributed to him killing himself.\n\nThe rumors followed Rob everywhere. He was a quiet kid. By all accounts very bright and kind. And I want to be clear here, he did have people who cared about him. Friends. Not many, and maybe they weren’t too popular either, but they were there and they were nice guys. One of them was my ride to school, Nathan ‘Fletch’ Fletcher.\n\nFletch and I lived in the same neighborhood. We were never all that close, but we got along well enough. He was a lovable goofball, always saying the wrong thing at the wrong time, but it never got him down. He had this grin that stretched from ear to ear, and he always managed to get me excited about his latest musical discovery or restoration project.\n\nFletch used to buy old cars, fix them up, and resell them. While it helped pad his savings for college, it also meant he was stuck driving whatever hunk of junk he hadn’t managed to fix up enough to sell yet. That year, Fletch was driving a 1984 Honda Civic.\n\nI still hate that car.\n\nI found out something was wrong on Tuesday morning when Fletch’s rust-bucket didn’t show up in my driveway like it usually did. Instead his dad, an air force officer nowhere near as affable as his son, was waiting for me. I liked Mr. Fletcher fine; he was a good— if not particularly affectionate— father to his boys and a respectful neighbor, but his presence in my driveway was odd, especially since I could see that Fletch wasn’t in the car.\n\n“Sir, is everything OK with Nate?”\n\n“Yeah, he’s fine. We’re just giving him the day off from school. C’mon, grab your bag. I’ll explain on the way.”\n\nMr. Fletcher had turned around and started back towards his car before he’d even finished speaking. I grabbed my back pack and hustled after him.\n\n“Did you know the Kennan boy?” He asked as we pulled out of my driveway.\n\n“Not really. I mean, I know who he is. One of Nate’s friends.”\n\nMr. Fletcher nodded, never taking his eyes off the road.\n\n“He killed himself last night.” He said it as evenly as if had been announcing we needed to stop for gas.\n\n“He—what?” My brain couldn’t even process what I was hearing. I’d seen Rob Kennan in the hallway yesterday. How could he be dead?\nMr. Fletcher proceeded to lay out the cold, dry facts. Rob had hand-delivered a letter to the house around 7 pm. Fletch wasn’t home when Rob dropped it off, so he didn’t open it until later that night, at 9:45 or so. Upon reading the letter, Fletch went white as a ghost and tore out of the house without permission. He raced to (I’m going to omit this detail— just know it’s the location that Rob killed himself), but when he arrived, the car was already burning. Apparently, the letter was a suicide note.\n\n“Nathan’s too upset for school.”\n\nSomething in how he said it, made it seem like Mr. Fletcher was implying there was something unmanly about his 17 year-old son being too upset to sit through pre-calculus after one of his best friends had killed himself.\n\n “He should have called you,” Mr. Fletcher continued, “but he didn’t think to and it didn’t occur to me until it was too late for you to catch the bus. Sorry about that.”\n\nMy initial shock gave way to resentment. No one could have made Rob Kennan’s suicide pleasant news, but it was difficult to imagine anyone being more callous than Mr. Fletcher. No wonder Fletch complained about his father so much.\n\n“Don’t worry about it.” I mumbled.\n\nWe rode the rest of the way in silence.\n\n\nI got to school and found it changed. Compared to the day before, it was an alien landscape. It reminded me of Tartaros in Greek mythology: a bunch of people, milling about, a vacant and lost look in their eyes, unsure of what to do, what to say to one another. Friends clustered, silently, in small groups. It was like Rob’s funeral was being held in the hallways.\n\nClasses weren’t cancelled but nothing was done. Mainly the teachers made us aware of special counseling being offered for anyone closely affected and told us that we could come to them if we ever needed to. Their nerves were also frayed. I recall specifically my study hall teacher, normally a very soft-spoken man, banging his hand on his desk and swearing that it was “completely fucking unnecessary!” Adding a moment later that “no one needs to do that. No one.”\n\nWe, all of us, drifted through the day in a haze. You’d hug your friends and ask them how they were holding up, or how well they knew Rob. You’d hear about who was there that night at (the omitted location was a popular teen hangout). And you heard about the cops that could have saved him but didn’t.\n\nI mentioned earlier that Rob Kennan was left in his burning car for four hours. This is not an exaggeration. It was four hours. Later reports said less time had passed, but Fletch was there, screaming himself hoarse. Screaming at cops and firemen and anyone who would listen that that was his friend in there and he was dying. It was four hours.\nBeing teenagers, we were quick to question the actions of the police, but I now believe that, while their delay proved to be without merit, they made the best decision they could have with the information available to them. Rob hadn’t lit himself on fire to be dramatic. He didn’t intend for there to be a fire at all. Rob had wanted to shoot himself but couldn’t acquire a gun, so he built one.\n\nBack then, in the ‘90s, in a pre 9-11 world, terrorism wasn’t part of the zeitgeist. It was bad, absolutely terrible, and we knew it. We’d had Timothy McVeigh and the failed bombing of the Twin Towers, but we hadn’t entered into the Neo-McCarthyism that marked much of the early 2000s, where the mere whisper of the word could get you thrown off an airline or placed on an FBI watchlist. And there was a certain caché, a mystique that some of the equipment and ideas surrounding terrorism carried in the imaginations of adolescent boys, which is probably why Rob Kennan, like virtually every other guy I knew growing up, had copies of the Anarchist Cookbook and the Terrorist’s Handbook*  saved to a 3.5 floppy disk that he had stashed in his room.\n\nWhen he failed to get a gun, he built one. I’m a little wary to Google it, but if my memory serves me, the instructions for it were listed in one of those text files as the home-brew blast cannon.**  Rob’s blast cannon consisted of little more than a lead pipe capped on one end and filled with gunpowder and bits of metal. It did the trick, but it also launched burning gunpowder all over the interior of his car.\n\nSome of the people at the scene thought they had seen someone else in the car with Rob, a girl, and relayed this information to officer McCullough who was the first emergency responder to arrive. Officer McCullough hadn’t seen anyone else in the car. All he saw was a burning car, a crowd of teenagers who all reported having heard an explosion, and the lead pipe that had rolled out of Rob’s unconscious hand and onto the passenger’s side of the floor.\n\nTerrorism may not have been a big part of the zeitgeist at the time, but school shootings were. The Columbine massacre had happened only 6 months prior, and Officer McCullough was looking at a fairly typical teen loner, reports of an explosion, and what very well could have been an undetonated pipe bomb still in the burning car. He made a tough call. It may have cost Rob Kennan his life, but, then again, he might already have been dead. You have to ask yourself, about what that officer did: was it worth risking more lives to find out?\n\nI remember thinking that Officer McCullough, at that point only known to me as the cop who always gave kids a hard time for riding their bikes without a helmet, was a bastard. And maybe he was a bastard, but if he was, it wasn’t because of this. He couldn’t risk more lives. Besides, whether or not it was a suicide, if there had been a second person in the car, where the hell was she?\n\nNobody who knew Robert Edward Kennan at all—even people like me who barely knew him—believed for a second that he was out to kill a whole bunch of people. But there was something else that could have been going on…Rob had a crush on a girl that bordered on obsession. It had lasted years and only seemed to be getting worse.\n\nThe girl in question, Alina, worked at (omitted location), and Rob would go out of his way to stand in her line or linger in the parking lot after-hours hoping to speak with her as she was heading home. Everyone immediately wondered if the mystery girl in the fire had been Alina. Did he pull her into his car to once more profess his love for her, and, unable to handle another rejection, take his own life before her eyes? Or, God forbid, try to take Alina with him?\n\nAlina’s friends and coworkers shouted her name. “Alina! Alina! Where are you?”\n\nWhen she didn’t respond they fanned out to look for her. It was the manager, Mrs. Jaffrey who found her. Completely overwhelmed by Rob’s suicide, Alina had retreated into one of the walk-in freezers. She was bawling her eyes out as Mrs. Jaffrey threw her coat over Alina’s shoulders and led her to the manager’s office.\n\n“It’s not your fault,” the older woman whispered into Alina’s ear, but it didn’t do any good.\n\nNo one else was unaccounted for, and no mystery woman was ever found. No second “bomb” ever exploded and no accomplices ever turned up. I guess we all assumed that those eyewitnesses were mistaken. That the smoke and the flames had played a trick on their eyes. We were wrong.\n\n\nFletch wasn’t in school for the rest of that week and I didn’t see him around the neighborhood either. I hate to admit it, but it was sort of a relief. I had no idea what I was going to say to him. What do you really say to someone whose friend has just killed himself?\n\nIn the weeks that followed, a new form of gossip slowly crept into the hallways of the school. The special counseling held in the cafeteria every morning before homeroom was supposed to be a safe space, where anyone could share their feelings without fear of judgment and be secure in the knowledge that it would go no further. So naturally, it was all anyone wanted to talk about.\n\nThere was a strong backlash against the kids that the other students didn’t feel deserved to be there. People who presented themselves as having been very close with Rob, but who in truth rarely spoke with him. Several of my close friends had been at (omitted) that night, they had watched Rob burn, seen him die and, although they were deeply affected, they weren’t even entirely comfortable being there amongst his handful of close friends and, of course, Alina.\nI felt terrible for Alina Aminev. Sitting there in the cafeteria, surrounded by Rob’s grieving friends, listening to everyone tiptoe around blaming her...they never came out and said it, but they’d talk about how “girls” wouldn’t give him the time of day. How “someone” had recently ripped out his heart. And when the counselor spoke about how challenging it can be to cope with the insensitivity of other teens, many in the room cast sidelong glances in her direction, waiting for her reaction before adding in their own two cents.\n\nThe year before Rob’s death, Alina had suddenly found herself with a kind of unexpected popularity. She was born in Russia, but her parents had managed to emigrate to the United States when Alina was still an infant (which was, during the tail end of the Cold War, no easy feat). Kids used to tease her about her family being Soviet spies, but when she started to come into her own, the teasing turned to flirting. She never quite reached the ranks of our school’s alpha females, but her je ne sais quoi was undeniable.\nAlina was pretty, sure, but not unattainably so. She was smart but not so much so that it was intimidating. She had fair skin and wild hair. Her eyes would sparkle whenever she said something clever, and she had this smirk that’d spread like a wave from left to right across her lips. But most alluring of all, Alina had this attitude, this way of carrying herself. It was like she was sure wherever she was, was the place to be. It was infectious.\n\nIn short, Alina Aminev was exactly the kind of girl that an unpopular guy could fool himself into thinking he had a chance with. God knows I did when I found myself suddenly talking to her in late November of 1999.\n\nAlina had grown quieter in the weeks that followed Rob’s death. Even as the rest of the school began to show signs of moving on, she continued to retreat. She quit her job, and, though I don’t quite remember when the season started and stopped, either quit or never signed up for cross country that year. She just sort of shut herself off from the world and everyone in it, which was why I was so surprised to see her at Drew DeLuca’s birthday party.\n\nShe looked nervous. This used to be her element, and no one at Drew’s that night was inclined to blame her for Rob’s death. This was not his circle of friends, this was hers. But whenever she approached someone, or tried to join in a conversation, she looked like a gazelle approaching a watering hole it wasn’t sure was safe. And once she was in the conversation, she mainly shifted her weight from foot to foot, or fidgeted with some part of her outfit, never really engaging anyone unless they addressed her directly.\nI was telling a friend of mine about a recent trip I had taken to Greenfield with Scary Kerry, the only one I could ever drag along on my ghost-hunting trips, when I felt a gentle tug on the back of my shirt. I turned around half expecting to see DeLuca’s kid sister, but it was Alina.\n\n“Can we talk?”\n\n“Oh, yeah, sure.”\n\n“Outside?” She looked over my shoulder at my friend before adding, “Alone?”\n\nIf it had been spring, I would have been thrilled by the prospect of Alina Aminev pulling me out of a party to “talk” alone. But it wasn’t spring; it was New Hampshire in late November. We stood on the back deck, our jackets pulled tightly around us, our breath hanging in the air plain to see.\n\nShe said she heard from Kristy McDowell that I knew a lot about ghost stories. Kristy was quite possibly my oldest friend in the world, and yes, it was true. I knew a lot about ghost stories. I was raised Catholic and blessed with kind, warm-hearted parents whom I was always eager to please. This meant that I took my Catholicism and my school work very seriously, which eventually led to a struggle between my rational and spiritual beliefs that was only exacerbated by my growing awareness of the sexual abuse scandal and the Church’s subsequent cover-up. I’d hated losing my faith. I wanted desperately to believe as I had as a child. So when most teenagers had shut the book on ghost stories, relegating them to little more than childhood memories or an excuse to scare a girl you wanted to put your arm around, I doubled down. I thought if I could find something, some shred of evidence in support of the supernatural, that would keep the door to the spiritual world open for me, even if only for a time.\n\nOf course, I didn’t share all of that with Alina. Instead, I tried to act casual. Casual bordering on slightly disinterested.\n\n“Yeah. Well, kinda.” I think she could see through me. “Why?”\n\nAlina began fishing around inside her jacket. “You have to swear to me that you’ll never tell anyone I showed you this.”\n\nI swore. Alina pulled her hand out from her coat. Her dainty fingers clutched an envelope like it was a particularly delicate piece of glass. She handed me Rob’s suicide note.\nOpening the envelope and unfolding the pages felt like a profound invasion of privacy. But who could resist reading it when it was handed to you? What were Rob Kennan’s last words to the girl he’d been obsessed with for years? The girl many of his peers believed was the reason he killed himself?\n\nThirteen years have passed, leaving me with little more than an impression of what the note said, but even if I remembered it exactly, I think this would still be where I’d draw the line. What I will say is that it was very earnest. Rob had been depressed for a long time. He felt horrible about leaving his family and friends to deal with the aftermath of his suicide, but he also felt isolated in a very profound way and, more than anything, just wanted it to stop.\n\nI also don’t mind sharing that he was very effusive in his praises for Alina, but I got the distinct impression he didn’t know her as well as he thought. He wrote about her in these florid terms full of superlatives— twice he said he didn’t think he could live without her— but ultimately, nothing he said was very specific. Everyone thinks the first love of their life is the most special, most attractive person in the world and that no one could ever appreciate them as deeply as they do.  \n\nI felt for him. I really did. But reading it, I didn’t feel as though I’d gotten to know him any better. Not really.\n\nAs I finished reading, I looked up and met Alina’s gaze. She was looking at me expectantly but I wasn’t making the connection.\n“What does this have to do with ghost stories?” I asked.\n\nAlina pointed to the bottom of one of the paragraphs expounding on why Rob wanted to take his own life. It read, “And every hour, I see her face, as she runs the endless race.”\nHer face. I had assumed he was talking about Alina and her years of running track and cross country, but if that was the case, why would he write “her” and not “your” in a letter that was to Alina?\n\nA shiver ran up my spine. It wasn’t the cold. It was more like someone had walked over my grave. “The endless race,” I said.\n\n“Yes!” For a split second, Alina was her former self again. “God, I was starting to think I’d imagined it. Tell me you remember where it’s from.”\n\nI mumbled the line, “And every hour, I see her face, as she runs the endless race,” a couple of times under my breath. I knew that I had heard it before, but where? I was positive it was a ghost story, but I’d read literally hundreds, if not thousands, of them, and they had a tendency to bleed together.\n\n“No.”\n\n“Shit!” Alina banged her fist hard against the railing of the deck. “But it’s a ghost story, right?”\n\n“Yeah. I know I know it, I just can’t...” I trailed off, racking my brain.\n\nAlina started drifting back towards Drew’s house. “If you think of it—”\n\nI cut her off, “Absolutely.” So much for slightly disinterested.\n\nAs she reached the door, she turned and looked at me. She stared at me for a long time. Longer than any pause in a conversation should be. “I think he mentioned it in the one he wrote to Nate Fletcher, too.”\n\nI stared back at Alina. “Fletch’s letter?”\n\n“Yeah. Could you find out?”\n\nThat was a line I didn’t think I could cross. “Yeah.”",
        "url": "https://www.reddit.com/r/nosleep/comments/1nyt4a/the_spire_in_the_woods/",
        "title": "The Spire in the Woods"
    },
    {
        "body": "A few days after Rob’s suicide, a handful of young reporters showed up at school trawling for quotes. Before the faculty could chase them out, they pushed hard for someone, anyone, to give support to the lone-wolf-school-shooter angle. Rob’s real friends flatly refused to speak to the reporters, but there’s a certain element among young people who only want attention, and the same kids who showed up for the grief counseling, despite never having been particularly close to Rob, were the first in line to provide quotes.\n\nThe next day, the local paper was filled with statements like, “‘No one really knew him,’ says student Melissa Bennett.” For Fletch it was a slap in the face.\n\n“What? ‘Cause she didn’t know him, nobody could?” About a week or so after Rob died, Fletch resumed picking me up in the morning. “I don’t count? Murph doesn’t count? Fucking bullshit!”\n\nListening to him rant about the story in the paper made me think that maybe I should have spoken to the reporters. I wouldn’t have pretended to have had any special insight into Rob’s mental state, but it might have been nice for his friends and family to have seen something simple and honest, something that didn’t fit into the lone-wolf narrative. Even if it was nothing more than saying, “He had friends. They’re just not talking to you because they’re grieving, you heartless parasite.”\n\nI wish I had done that, but I didn’t. I also wish I could tell you that I was the one who wrote an Op Ed the following week roasting the reporters for coming into a school and pushing students still reeling from the shock of losing a classmate into spouting a whole bunch of pop-psych, pseudo-scientific nonsense, but that wasn’t me either. That was some senior I didn’t know very well.\n\nI had made a few tenuous attempts at getting Fletch to open up about Rob. The best I had managed was to get him ranting about the kids in the grief counseling sessions that didn’t belong. Talking about them got the normally placid Fletch so angry I thought he might have an aneurysm. After that, I quickly gave up.\n\nOnce I resolved not to pry into Fletch’s life, our morning rides settled into something almost comfortable. Our casual friendship was like a knee recovering from an injury: fine so long as we didn’t put any weight on it. And that was still the state of things the day we returned to school after Drew DeLuca’s birthday.\n\nToday, tracking down the story that lead me to the Spire would have been a piece of cake (for me, anyways. For you, I’ve changed too many details). I could have typed that little rhyming snippet of Rob’s suicide note into Google and had my answer in seconds. But the Internet wasn’t as robust back then. Hell, I’m pretty sure in 1999 I was still using Hotbot.\n\nNonetheless, from the second I returned from Drew’s until school started on Monday, I spent every waking minute scouring every Haunted Places book and paranormal website I could find, looking for the phrase, “And every hour, I see her face, as she runs the endless race,” or some variation. By the end of the weekend, half the contents of my bookshelf had been redistributed throughout the house, and I had skimmed countless Geocities pages, scrolling past dancing ghost GIF after dancing ghost GIF until my eyes bled, but still had nothing to show for it.\n\nI knew I couldn’t bring it up with Fletch. Not directly, at any rate. Rob’s death was still a raw nerve. So I went to the only person who knew even more about ghost stories than I did: Scary Kerry.\n\nGrowing up in the woods of New Hampshire at the foot of the White Mountains wasn’t all bad. My school had a hiking club that also taught us elementary wilderness survival skills. It was immensely popular, mainly because it culminated in a week-long hike, which meant you got to miss a week of school. As freshmen, my friends and I all signed up to go together that fall, but two weeks before the big event, I came down with a case of antibiotic-resistant strep throat and had to have my tonsils removed. Fun.\n\nSince the program was extremely popular, each student could only partake once. Even though I was allowed to make up my hike the following winter, it was still a bit of a letdown, since none of my friends could come with me. I was intensely jealous when my friends returned from the hike closer than ever with a slew of in-jokes and stories from their week in the woods, but by the time I left for my hike a few months later, things in my circle of friends had already returned to normal, and I was mainly just concerned about being stuck in the woods with random classmates I had little in common with.\n\nIf you’ve never spent all day hiking with a large-frame pack, you may not appreciate how grueling it can be. There’s a high washout rate of kids who get sick or throw in the towel and have to be picked up and taken home. There’s an even higher rate of kids who never shut up about how much their feet hurt, and by the time we stopped for lunch on the first day, any concerns I had of loneliness were replaced by my seething hatred for that group of kids.  \n\nThose of us capable of keeping our mouths shut (at least about our feet) quickly bonded. That’s how I became friends with Scary Kerry Peterson, the last person on Earth I ever imagined I’d become close to. Kerry was one of those unlucky people that seems scientifically designed to be picked on. She was nearly six feet tall, quite overweight, crap at school, poor (by the standards of my admittedly affluent town), and cursed with a head the size of a large pumpkin. I’d had classes with Kerry on and off for the last 9 years, and before the hike, I doubt I’d spoken more than two words to her. Although, in fairness to me, in middle school she had deepened her own isolation from most of the class by becoming intensely goth in the Baby Bat way of late ‘90s teens.\n\nThere was a blond girl on the hike, I think her name was Stephanie Foster, that two hours earlier I had found very cute, and, despite her whining, I was still thinking I might like to get to know her better before she let this gem slip: “God, I just wanted to miss school. Why do we have to walk soooo much?”\n\nI rolled my eyes but didn’t say anything. Kerry, however, could not let it slide. “What the hell did you think a hike was?”\n\nStephanie looked at her like Kerry was something she’d scraped off the bottom of her boots. “Nobody’s talking to you.”\n\n“And nobody wants to fucking listen to you!”\n\nI couldn’t help it, I laughed. I still didn’t think of Scary Kerry as a friend yet, but it was suddenly a lot harder not to like her.\n\nAfter lunch, our line of hikers silently, and seemingly unconsciously, rearranged our marching order with the whiners taking up the rear and those of us who could keep our aches and pains to ourselves leading the pack. By dinner time, Stephanie and three other kids from her clique, perhaps unimpressed by the franks and beans we’d be having, decided to throw in the towel.\n\nIt gets dark early in winter. Dark and cold. On the fall hike, after dinner, my friends were able to wander around the campsite quite a bit, but for us there was only one thing to do: stick close to the fire. And that’s where Kerry and I really bonded. Someone half-jokingly asked if anyone knew any good ghost stories. There was the usual student reluctance to step up and put yourself out there to be judged, and our chaperones weren’t terribly interested in anything but double-checking our work setting up the tents, but after a few false starts from the other kids, I decided to tell an old standby, the story of an old woman that lived in Maine who had been caught abducting pets and small children. It was said that she was a witch who ate the flesh of her victims and turned their bones into china.\n\nThe second I finished, Kerry started telling one of hers. We took turns telling stories the rest of the night and continued telling stories every night after dinner for the rest of the week. Between campsites, we walked next to each other, chatting about the kind of crap that seems important to teenagers and quizzing each other on local paranormal hot spots.\n\nBack at school, after the hike, maintaining my friendship with Kerry proved to be tricky. My friends never really understood the bond. They weren’t mean to her, not exactly, but despite my efforts to bring her into the fold, they never embraced her. As for the few friends Kerry had, some couldn’t mask their disdain for my taste in music and clothing, while others were the sort of kids that were desperate and clingy— two things I always found it hard to stomach. But Kerry was one of the only people I could talk to about losing my faith, and she was always game to get together and go on one of my very fruitless ghost hunts, so we stayed in regular contact.\n\nThe Monday after my conversation with Alina, I tracked down Scary Kerry in the cafeteria sitting with a few other goth kids. We had talked a lot after Rob killed himself, in part because I knew that Kerry, from time to time, had suicidal thoughts of her own. It may have been the height of stupidity, but until Rob Kennan actually did it, actually ended his own life, I never thought that it could happen in my town. At least, not to anyone I knew. After Rob had done it, though, I knew I couldn’t let Kerry slip down that same path, and for a while, I doubled my efforts to spend time with her; but after one particularly awkward night ghost hunting in Greenfield, well, we had fallen back to the status quo.\n\n“Kerry, you mind if I steal you for a second?” I asked, pointing back out into the hallway behind me.\n\nAs Kerry rose to leave, Kim Murray leaned over to one of their other friends and said, “Aww,” like she’d just seen something cute. Kerry’s face splotches of scarlet and shot Kim a look of pure hatred.\n\n“Forget it, c’mon.” I said. I didn’t know what Kerry had told Kim about Greenfield, but sure didn’t want to deal with it.\n\nOnce we were in the hallway and out of anyone’s earshot, I recounted the events of Drew DeLuca’s party.\n\n“She let you read the note he left her?” Even though, just a month ago, we’d spent several hours being lectured by our guidance counselors about the differences between depression—the true depression that was a psychological illness—and being sad, I think Kerry still had trouble believing anyone was more miserable than she was.\n\nKerry stepped closer to me and dropped her voice to a whisper, “Why’d he do it? Was it…was it her fault?”\n\nI trusted Kerry, but I was reluctant to share too much with her. I hate to admit it, but in spite of having counted Kerry amongst my friends for the past year, Alina’s pretty face had flipped my loyalties completely to her in one conversation. I cut to the chase.\n\n“Rob wrote something, in Alina’s note. I swear it’s from a ghost story, but I can’t remember which one.”\n\n“What’d it say?”\n\n“And every hour, I see her face, as she runs the endless race.”\n\nScary Kerry shivered. “The Widower’s Clock. I hate that one.”\n\n\n\nWhile my story begins with Rob Kennan killing himself, the story of the Spire in the Woods begins almost a century earlier in the former town of Enfield, Massachusetts, a few years before it was destroyed.\n\nIn the late 1920s, an elderly clockmaker from Boston married a beautiful young woman and the two of them settled in Enfield. He was a master craftsman, the finest in the world, able to create machines of such complexity and precision that he was often called the Da Vinci of clockworks (no small feat, considering Da Vinci himself had designed clockwork automatons). She was a great beauty. Refined and cultivated, before meeting the clockmaker she had been celebrated by the Boston Brahmin for her wit and for throwing the very best dinner parties.\n\nThe clockmaker had amassed a great fortune, but he, like all great artists, was unsatisfied by all of the products of his lifetime of labor. He wanted to build one more clock, a clock that would surpass even Munich’s Rathaus-Glockenspiel in its artistry and complexity. He completed his plans in the spring of 1931 and they were beautiful. His designs were classic, yet modern. Complex, yet clean. Each hour, when the bells called out the time, the automatons would dance forth from their hidden chambers and symbolically reenact different battles of the Civil War, each day telling the story of how the North came to vanquish the South.\n\nLowell and Boston both desperately wanted the clock tower, as did a few of the larger manufacturing and shipping companies, but before construction could begin on any town hall, court house or corporate headquarters, the Depression hit. All the suitors disappeared in short order, one after the other, leaving the clockmaker alone with his plans.\n\nMiserable and depressed, the clockmaker feared he would die before he’d ever have the chance to see his vision complete. He resolved that he wouldn’t let that happen, and began spending his considerable fortune building the tower on his own, as an addition to his own house in Enfield.\n\nOne day, the clock tower nearly complete, the clockmaker returned home from picking up a custom-made part. He arrived much earlier than anticipated, to discover his wife in bed with another man, one of his laborers. The clockmaker burst into the room and screamed at his wife and her lover. He had never been so angry or humiliated in all his life, but he didn’t yet know what humiliation was.\n\nRather than beg his forgiveness, or cower before him, or even flee the room in shame, the clockmaker’s wife and her lover laughed at him. They told the clockmaker that he was an impotent old man and they were unafraid of him.\n\n“Run along back to your little gears and springs,” his wife said. “Maybe if you’re nice and quiet I’ll still fix you your dinner tonight.”\n\nThe clockmaker, in a state of shock, slunk back to his gears and springs, but rather than going to work on the clock, he went to work on a plan. He removed the automatons from their posts and set all of his meager strength to coiling the huge spring that ran beneath their tracks. He laid out his tools, so they would be near at hand, and then he waited, listening to the rhythms of his marriage bed slamming again and again against the wall.\n\nEventually, the rhythmic thuds reached their crescendo and then fell quiet. Soon after he heard his wife call out to him, but he said nothing. Her calls grew in urgency and repentance crept into her voice— could she really be concerned for him? After what she did, after what she said? Still, the clockmaker stayed silent.\n\nWhen the laborer entered the room, which was little more than a giant gearbox, the clockmaker stared at him but did not move.\n\nThe laborer leaned back out of the room and called to his lover, “He’s in here!”\n\n“He hasn’t done anything stupid, has he?”\n\n“No. He’s fine.” The clockmaker was not fine.\n\nThe laborer approached the clockmaker as cautiously as a man approaches an unfamiliar dog. “ ’S your fault, you know?” The clockmaker, his watery eyes unblinking, only responded by staring as the younger man approached him. “Fine lady like that, fancy, you can’t keep her in a cage, ‘specially round here in this dreadful place, and expect she won’t get bored.”\n\nIt was at that exact moment that the laborer stepped across the path of the automatons’ track and the clockmaker yanked out the pin holding the spring coiled. The post, unburdened of a man-sized figure brimming with heavy metal gears, raced along the track and collided with the soft flesh of the laborer’s leg. The crack of the bone splintering was even louder than the man’s screams.\n\nThe clockmaker’s wife called out at the sound of her lover’s cries. “I’m coming! I’m coming!”\n\nThe clockmaker picked up a large wrench and moved beside the door. As his wife rushed in, her eyes searching for her lover, the clockmaker crept up behind her and brought the wrench down on her skull.\n\nShe awoke, hours later, with shooting pains running through her legs. She tried to look down, but her head was agony to move. The clockmaker stood over her, his mallet hammering the metal support rods into her thighs. Her lover was already mounted to the post, ready to fill in for the automaton and dance when the hour struck.\n\nJust as with the Rathaus-Glockenspiel in Munich, the clockmaker’s creation was hailed as a great artistic achievement. Crowds gathered on the formerly quiet street to watch the myriad Union and Rebel automatons zip along their tracks, round and round, in an endless race.\n\nIt was weeks before anyone noticed something wrong with two of the automatons. Their lacquered veneer bulged in weird places and looked slick, as if it were wet. Then, one day, the finish gave way, and the crowd, which was mostly children at this point, watched in horror as two corpses zipped about the track, chasing and stabbing each other with bayonets.\n\nThey say even after the clock was stopped and the lovers were laid to rest, all those who saw the wife’s face were haunted by visions of her endlessly running along her track.\n\n\n\nI didn’t have to ask why Scary Kerry hated the story of the Widower’s Clock. She was the one who pointed out to me how ghost stories were frequently used as a form of social control. Here was another story where an unfaithful woman was put to death by an angry husband and, crueler still, children were also punished. Children whose only crime was having seen the corpse of the unfaithful woman, a corpse that the enraged husband put on display.  \n\nI couldn’t wait to tell Alina. I didn’t have any classes with her, but we had lunch the same period. Alina was sitting at a table with her friends. Ordinarily, it would have been intimidating to walk up to a table of girls, most of whom were pretty and toned from years of soccer, field hockey, and track, but I could tell by the way Alina was sitting with her tray in her lap, her chair pushed back from the table, that she would like nothing more than an excuse to leave.\n\nWe were allowed to eat our lunches outside, but no one ever did during the winter. We got some funny looks pushing open the doors and slipping out onto the yellowing grass.\n\nI’d been looking forward to telling Alina the story of the Widower’s Clock for hours, but now that I was alone with her, I hesitated to jump straight into it. “Are you OK?”\n\nAlina shifted uncomfortably. “Yeah. But I…well, I haven’t done so great with crowds lately. Especially when I’m eating.”\n\nWe were huddled in the corner of the doorway, trying to use the building to block the wind. I was nervous as I reached out to rub her arm in what I hoped was an understanding and reassuring gesture. She didn’t flinch or pull away, she just stared at my hand for a long second before she whispered, “Thanks.”\n\nI started telling her the story exactly as Kerry told it to me, but had barely begun when the switch flipped in Alina’s head and she remembered where she’d heard it before.\n\nEast Boston Camps. Pretty much everyone in our town went to summer camp there when we were kids, because it was only 15 minutes outside of Nashua. One of the counselors there had been like Kerry and me, and he used to delight in telling ghost stories to the younger campers. He loved it when the kids were too scared to sleep and kept their cabin chaperones up all night.\n\nFor a second I forgot why we were trying to track down this story and got lost in old memories of camp. But Alina didn’t.\n\n“Do you think it has anything to do with why he killed himself?” Her voice was steady, but she fixed me with her eyes and I could see how desperate she was for me to say yes. Desperate to believe that it wasn’t her fault.\n\n“I think he suffered from depression.”\n\nAlina’s lip quivered, and her eyes filled with tears.\n\nI hugged her. “Hey. Listen to me. You didn’t kill him.”\n\nAlina gripped the collar of my flannel shirt and buried her head against my chest. I stood there, holding her, as she cried. The two of us were late to fifth period.\n\n\n\nAt the end of the day, Fletch was waiting for me in the parking lot. He’d already turned his car on and cranked the heater up to full blast. Even still, we were halfway home before it was warm enough for me to open up my jacket.\n\nHe stared out the window. “Dude, what’s going on with you and Alina?”\n\nI turned to look at him. His jaw was set and for the first time in our lives Fletch reminded me of his hardass father. I really didn’t want to answer him.\n\n“She asked me about a ghost story.”\n\nFletch’s only answer was to let his eyes drift from the road. He studied my face for a long moment before he finally said, “Which one?”\n\n“The Widower’s Clock. It’s the one where—”\n\n“I know the one.” It was barely a whisper. “Are you in a hurry to get home?”\n\n“No.”\n\n“Good.”\n\nFletch pulled over to the side of the road, took a shuddering breath, punched the steering wheel twice and started bawling. He let it out. Everything that he’d been holding in at school, everything that he’d been holding in around his dad. Everything. Alina had been sad; Fletch was purging.\n\nDuring the days following Rob’s suicide, seeing people break down like this was common, and it continued on longer in the morning counselling sessions, but at some point, people put their guard back up. What had been appropriate emotions one day was suddenly back to being taboo the next, and for people like Fletch, they weren’t ready to be in that emotional space again.\n\nOnce he’d gotten most of it out, we started talking. Really talking. “I know it’s unfair,” he said, “I know it’s not...I mean,  she always tried to be nice, but I’m sorry, I just fucking hate her.”\n\nI didn’t exactly blame Fletch for how he felt. Nate was a good guy. He knew that Alina wasn’t obligated to reciprocate Rob’s feelings simply because he was nice to her. But he had watched his friend, dead or alive, burn for four hours and a part of him wondered if it would still have happened if only Alina had given Rob a chance.\n\n“That’s too much pressure to put on somebody,” I said.\n\n“I know.”\n\nI reminded Fletch of everything that the counsellors had told us, that feeling sad when you’ve been rejected is natural, normal behavior. Healthy behavior. You should feel sad whenever someone doesn’t reciprocate your feelings. It is sad. But while there’s always something that makes a person decide they want to kill themselves now and not tomorrow or last week, it’s not the final straw that breaks their back, it’s all the weight that came before it. The underlying mental illness.\n\nFletch looked down at his hands. “Yeah.” There was no conviction in his voice.\n\nFletch pulled his t-shirt up to his face and wiped the last of his tears away. He then started the car and we were moving, riding in silence. After a few minutes, Fletch spoke again,\n\n“He thinks...he thought he found it.”\n\n“What?”\n\n“The Widower’s Clock.”\n\nIt was my turn to stare at Nate. “That’s impossible.”\n\n“Do you want to read it, the note he left me?”\n\n\n\nIn the period of time between the end of the Civil War and the start of the 1920s, the population of Boston, Massachusetts more than tripled. In fact, there were more people living in Boston in the 1920s than there are today. This put an amazing strain on the city’s resources, particularly on their drinking water.\n\nTo solve their water problem, the Commonwealth of Massachusetts undertook a number of public works projects redirecting rivers and creating reservoirs, the largest of which is the Quabbin Reservoir in the Swift River Valley of Western Massachusetts. The Quabbin covers nearly 40 square miles and sports an impressive 180 miles of shoreline.\n\nCreating the Quabbin meant flooding much of the Swift River Valley, and the Swift River Valley was home to four towns; Dana in the northeast and Prescott in the northwest, with Greenwich wedged between them, and Enfield in the southwest. Enfield, where the Widower’s Clock was supposedly built, now sits mostly submerged by 412 billion gallons of water.\n\nHow in the hell would Robert Kennan have found anything there at all? What would there even be to find, 60-some-odd-years and a flood after the fact? And it’s not as though the Swift River Valley was flooded overnight. The people had had years to move their homes and relocate out of the flood zone. Why would they leave behind a whole building? And if it was there, wouldn’t a clock tower peeking up from the water tend to draw the eye?\n\n\n\nI never felt comfortable in Fletch’s house. The first floor felt like a museum. Mr. Fletcher was strict, but it was Mrs. Fletcher who wanted her house to always resemble the cover of an interior decorating magazine. Call me crazy, but what’s the point of having a house you’re afraid to live in?\n\nFletch’s room, on the other hand, had the opposite problem. The first time I came over, at Mrs. Fletcher’s insistence, I had to take my shoes off to go upstairs and then put them back on in Nate’s room because while he was sure there was broken glass somewhere, Fletch wasn’t quite sure where. As you can imagine, Nathan Fletcher and his mother fought quite a bit.\n\nFletch gestured to his bed and I parked myself on the corner of it with the fewest dirty clothes. What few prized possessions he owned, Fletch kept in the bottom right-hand drawer of his desk, but that’s not where he pulled Rob’s letter out from. No, the letter he kept tucked in a book on top of his nightstand. It occurred to me that he must have been reading it often.\n\nThe invasion of privacy I felt when I read Alina’s letter was nothing compared to reading Fletch’s as he sat next to me. The letter was exponentially more personal. Rob was exposed on the page. Reading it made me feel like I had walked in on him naked. Whereas the letter Rob gave to Alina revealed a little about himself and next to nothing about her, this letter revealed a great deal about Rob as well as Fletch.\n\nFletch and Rob had bonded when Rob was new and Fletch was going through his awkward phase. Apparently, I had been wrong about Fletch not getting down whenever he said the wrong thing. Warm and funny and confident around his friends, Fletch had spent most of his early teens afraid to speak in public. Maybe I hadn’t noticed because he was older and I sort of looked up to him. Or maybe I was just too absorbed in my own insecurities to see that anyone else had their own. Either way, it was news to me.\n\nRob’s note to Alina had expressed a measure of guilt for leaving everyone behind to deal with the aftermath of his death, but in the letter he gave to Fletch, the guilt he articulated feeling was for having lived. He apologized profusely for having been a burden. He described himself alternatively as a baby and a leech, a drain on anyone foolish enough to move too close to him. And though he knew no one would see it like he did, Rob viewed his suicide as a charitable act. He was ridding his friends and family of himself.\n\nDespite my discomfort reading such a personal letter, I devoured every word. I consumed the letter, hoping after each line that the next would finally illuminate for me what Robert Kennan had to do with the Widower’s Clock. And finally, tucked amidst a list of his reasons why he was going to go through with it, was what I’d been looking for.\n\n“I will soon join them. Staring at her face as she runs the endless race.”\n\nI looked up, disappointed and annoyed with how little Rob had written about the Widower’s Clock, to find Fletch rocking back and forth in his chair. It made me feel like a piece of shit.   \n\n“You said he thought he’d found it?”\n\n“Yeah.”\n\n“How?”\n\nNathan Fletcher looked up at me with watery eyes and told me everything.\n\n\n\nRob’s medication had his depression mostly under control for the last three years. He still had bouts, but they were less frequent and less severe than they had been before. Along with his much improved disposition, Rob had also been sleeping better, eating more and his energy was way up.  But he was never exactly happy.\n\nSee, that’s something most people don’t understand about depression: it’s not a mood. It’s a disorder. Having the symptoms of his disorder in check didn’t make Rob happy, it made him not depressed. Rob still struggled to fit in and enjoy life. He was still unpopular. He was still misunderstood.\n\nOne of the few things that Robert Kennan really enjoyed was running. He especially enjoyed cross-country. If I had to guess what appeal long-distance running held for Rob, I’d say that for someone who always felt their loneliest in a crowd, it must have been a relief to actually be alone. Just him, the woods, and the next mile.\n\nAnd the Quabbin Reservoir offered a lot of ‘next’ miles. Rob had been exploring its trails since he was a child. When they lived in Amherst, his family used to visit the Quabbin on the weekends. They’d hike or picnic. Occasionally Mr. Kennan would take his two sons fishing. As a teenager Rob looked for any excuse he could find to get down there and just go, one foot in front of the other, until sundown when visitors had to leave.\n\nThat summer, the summer of 1999, Rob made a lot of excuses to visit the Quabbin. He had, for the third time, mustered up the courage to tell Alina Aminev how he felt about her. And, for the third time, he had been rebuked, this time a little less gently than before. It left Rob with a growing impression that the love of his life found him creepy. Running was the only thing that got his mind off it.\n\nThe Fletchers had three boys. The oldest, Samuel, had gone to UMass and, after graduation, found work in the university’s IT department. Fletch visited his brother often, and, whenever he did, Rob would hitch a ride down to the Quabbin. Usually, Fletch would drop him off in the morning, and Rob would either get picked up by family he still had in Amherst, or he’d call Fletch’s brother from the visitor’s center at the south end of the Winsor Dam and Fletch would come get him.\n\nOnce, Rob had lost track of time and found himself, after sundown, miles from the visitor’s center. That’s when he heard them for the first time. Bells tolling the hour. They were scarcely detectable, as if they’d traveled a great distance, and they had an odd, muffled quality that made them sound soft and deep.\n\nRob stopped running and listened. He forgot all about Alina. Forgot about contacting Fletch. Forgot that he was an hour’s drive away from the nearest person he knew. He stood in the woods and turned into the wind to listen to this beautiful sound. If he was anything like me when I first heard them, he was overcome by a physical sensation, a feeling like slipping under a warm blanket on a cold night.\n\nAnd then they were gone. Rob found himself once more in the dark woods with no idea how he’d get home.\n\nThere’s a trailer park, somewhat unusual in Massachusetts, a couple of miles southeast of the visitor’s center. Rob was lucky enough to get picked up on the road by one of its residents. She was probably barely forty but looked like she was pushing sixty, smoked continuously, and was the one who told Rob about, what she called, the Spire in the Woods.\n\nTo her, the Spire in the Woods wasn’t a ghost story. It was simply a fact of life, and like blind curves and sinkholes, one that was best to be avoided. She didn’t have a first-hand account of her own, but she’d heard plenty of stories. She knew that some of the boys from her trailer park enjoyed getting drunk, getting stoned, and pissing in the reservoir late at night. They got a little thrill out of the idea that somewhere in Boston, some Harvard grad was drinking their urine. Occasionally, one of these boys would come back to his trailer unsettled at having heard the eerie beauty of the bells.\n\nThe Quabbin Reservoir is peppered with islands. The woman said that the source of the bells was on one of them, an island just to the north of where the Old Ware Enfield Road turns into Quabbin Hill. Somewhere, hidden in the island’s wild-grown trees, the peak of an old spire, the sort you might see on top of a church, juts up out of the ground.\n\nNow and again someone went looking for it and never came back. Rumor around the trailer park was that, back in 1996, John Wilkins and his cousin Anna found it, but only John came back. He killed himself about a month later. Since then, the park mothers have kept an extra close watch on their boys.\n\nRob didn’t really believe in any of it. He wasn’t like me. The Spire in the Woods wasn’t a spiritual quest. He wasn’t trying to cling to the last lingering shreds of his faith. He just wanted to hear that sound again. Hear the bells as they chimed the hour. Have that feeling of warmth and security wash over him.\n\nIn the weeks that followed, Rob thought of nothing except the sound of the bells. Fletch thought that Rob was embellishing the incident, letting his memory get the best of him, but Rob was adamant that they were the most beautiful sound he’d ever heard. He insisted that something in the aging bells, or the wind as it carried the tolling through the woods, or the acoustics of the rock and dirt surrounding the Spire, lent to them an ethereal quality.\n\nHe was determined to find the Spire. Rob began researching the Quabbin and it wasn’t long before he realized the connection between the Spire and the Widower’s Clock. He dismissed the ghost story, but he was thrilled that a master artisan had lived in Enfield and sunk his fortune into constructing a clock tower complete with bells and chimes.\n\nFletch was skeptical. If Rob had heard anything at all, it must have come from somewhere else. A neighboring town, a proper church. Tower bells weigh hundreds, if not thousands of pounds. What’d be ringing them? The wind? It’d take a hurricane.\n\nBut Rob was unfazed. He was going to find the Spire in the Woods. He was going to hear the bells again. And Fletch didn’t see the harm in letting him try.\n\nA week before school started, Fletch set off for Amherst with Rob in tow. The pair of them spent the evening with Sam and his friends before cutting out around a quarter to ten and heading down Route 9 until they reached Old Ware Enfield Road. They parked the car near the trailer park and hoofed it the two miles or so up Old Ware to the shore of the reservoir nearest the islands, one of which, Rob was positive, housed the Spire in the Woods.\n\nEach having worn swimsuits under their clothes, they simply stripped down, stashed their things and slipped into the water. The nearest island lay about 200 yards from the shore and Fletch, never a strong swimmer, quickly realized he didn’t have it in him to make it there. After a brief argument while treading water, Fletch turned back and Rob went on alone.\n\nThey’d agreed Fletch would meet Rob back by Route 9 at 4am. Fletch sat on the trunk of his car for hours, swatting mosquitoes and listening to the frogs and crickets. At first he was worried about Rob, then he was pissed that Rob had gone on by himself, then he was worried again. Fletch set the alarm on his watch around 1:30 or so, laid out on his back seat, and drifted off to sleep, wishing he was drinking at his brother’s.\n\nFletch awoke to the passenger-side door being thrown open. Rob jumped in and slammed the door closed. “Drive! Drive!”\n\nFletch scrambled into the front seat, assuming park officials or the police were in hot pursuit. He gunned the engine, and pulled out of the trailer park.\n\nFletch was already back on Route 9 before he hazarded a glance at his friend. Rob was panicked.\n\n“What happened?”\n\nRob said nothing. He just labored to catch his breath as he looked back towards the reservoir.  Rob’s adrenaline slipped away as Fletch drove. By the time they reached Sam’s apartment, Rob was practically catatonic.\n\n“It took me weeks to pry it out of him,” Fletch said. “But he saw something down there.”\n\n“He found the Spire?” I asked.\n\nFletch nodded.   \n\n“Did he go in?”",
        "url": "http://www.reddit.com/r/nosleep/comments/1o1v9b/the_spire_in_the_woods_part_2/",
        "title": "The Spire in the Woods part 2"
    },
    {
        "body": "Rob had reached the first island. He’d been searching fruitlessly for nearly 40 minutes when he heard them. The bells. Being so much closer now, they were even clearer. He fell to his knees, letting their sensation, their warmth, wash over him. For a moment, he knew bliss.\n\nThe bells rolled back, like the ocean at low tide. Rob found himself shivering on the ground. He could hear nothing but frogs and crickets.\n\nHe rose on unsteady legs, sure of only one thing. In an hour he’d be there, he’d be standing before the Spire. He’d hear the bells, feel them, up close. He ran to the shore and dove into the waters.\n\nRob emerged from the reservoir onto the rocky bank of the second, and far larger, island. He stumbled barefoot through the woods, increasingly aware of how dark it was beneath the trees. As the bells’ siren call faded in his mind, he began to doubt himself. The Island was nearly two miles long and a half mile across, he could search it all night and never find a damn thing.\n\nThe bells chimed once more. He turned to face them. There it was. In the center of a grove of dead trees, the Spire jutted out from the ground like a pike set to receive a charge. Its white paint was oddly untouched by age. Small windows adorned each of its sides. Framed by the dead trees and bathed in moonlight, it called.\n\nUnable to resist their song, yet too overwhelmed by their warmth to walk, Rob crawled to the Spire like an infant to its mother. He pushed against the slats of the window. They gave way and he squirmed his way inside.\n\nRob landed on the top of a staircase. As the bells continued to chime, he pulled his shuddering body down the stairs, deeper and deeper into the enveloping darkness within, until he lost himself once more in the ethereal sounds and their radiating warmth.\n\nOnce the silence returned, Rob strained in vain to see. The air was humid, and black as ink. He could feel wood, dank and rotting, pressed against his bare calves. It gave him the impression he was sitting Indian-style inside of a living thing, like Jonah in the whale.\n\nSlowly, Rob rose to his feet. He held his hands out in front of him and groped blindly. He hoped he’d find a wall or a banister to the stairs, anything that would give him a clue about his surroundings. Instead he found nothing, forcing him to shuffle deeper into the impermeable darkness.\n\nHis outstretched fingers recoiled from the soft surface they encountered. What was it? He shook as he reached out, letting his hands land once more on the chest-high object in front of him.\n\nIt was wrapped in cloth. It only extended out to about the width of his shoulders. The cloth hung loose over something hard that his hands couldn’t identify. Rods? Dowels? His probing fingers traced up the object’s outer edge until he felt something he could identify. He froze. His fingers were in the eye socket of a skull. His thumb rested on its teeth.\n\nThe bells rang again, if only inside Rob, as his mind’s eye showed him the endless dance. He’d sat there in the dark, his unseeing eyes transfixed by the clockmaker’s wife as she was dragged on her post through the twirling gauntlet of Union automatons. He saw her, alive and dead, the blush of youth, the maggots of decay, twitch and scream and moan as her body was pierced by countless bayonets. He saw her face as she ran the endless race.\n\nRob shrank and shriveled, collapsing to the floor. Like a wounded animal, he crawled and clawed his way back. Back, back, back. Until he hit the wall, and even then he didn’t stop but pushed against it with all his strength, hoping to retreat further.\n\nHis flailing limbs struck a step, the first of many. With what little control he had over his frenzied mind, bolted for the surface, and an escape from the moist pit. And the clockmaker’s wife.\n\nRob scrambled up the twisting stairs on all fours like a dog. He tore his way through the window and collapsed on the ground. The fresh air felt alien in his lungs, as if it were his first breath. He took two more as he lay there on the ground, before realizing that although he hadn’t a clue what time it was, he couldn’t be there when the bells chimed.\n\n“He ran and swam and ran and swam and didn’t look back again until he was in the car.” Fletch put his face in his hands. “I shouldn’t have let him go alone.”\n\n“So you believe him?” I tried to say it in as comforting a tone as I could, but I think it came out a little accusatory.  \n\nFletch hesitated. “Yeah. Yeah, I do.”\n\nI had so many more questions I wanted to ask, but I didn’t think Fletch could take it. He’d choked up several times while relaying Rob’s story, and the way his shoulders were slumped reminded me of the way Rob’s parents had looked at their son’s funeral.\n\n“I should have gone with him,” he said, without looking up at me.\n\nI let it lie.\n\n\n\nAs I left Fletch’s house, every hair on my body was standing on end, but at that point, as much as I wanted to, I still wasn’t ready to accept the story of the Spire in the Woods. Not at face value. When we’d studied The Fall of the House of Usher in English earlier that year, Mrs. Thorn had made it a point to draw our attention to two of Poe’s opium references and to how Roderick Usher displayed symptoms of withdrawal. She explained that Poe’s stories frequently incorporated both blatant and subtle references to intoxicants and hallucinogens, in order to enhance the sense of phantasmagoria and help more skeptical readers suspend their disbelief.\n\nI knew very little about depression and even less about antidepressants, but at the time, I didn’t think it was beyond the realm of possibility that Robert Kennan’s encounter with the clockmaker’s wife had more to do with the sudden onset of a major depressive episode than with a dead woman. I spent the night reading about depression, tricyclics, MAO inhibitors, and SSRIs.\n\nThere were no answers, just endless possibilities. It wasn’t unheard of for major depressive episodes to be accompanied by delusions or even outright hallucinations. Psychotic disorders were sometimes less obvious in patients whose presenting problem was depression. Hallucinations were rare side effects of SSRIs. MAO inhibitors could cause Serotonin Syndrome, which could cause hallucinations. And that was before getting into the countless drug interactions, which, without knowing exactly what Rob had been taking, I couldn’t even begin to map out.\n\n\n\nI knew Scary Kerry would love to hear every last detail Fletch had told me about the Spire in the Woods, but on Tuesday morning I just didn’t feel like tracking her down. I wanted to talk to Alina.\n\nThe ride into school hadn’t been as awkward as I had anticipated. Fletch was quieter than usual, and I was content to stare out my window and daydream about what I was going to tell Alina. I wondered what she’d think about Fletch’s story and whether or not I should gloss over my own doubts.\n\nI also wondered if she’d cry. I feel embarrassed, even all these years later, admitting it, but a part of me was hoping she would. Then I’d have an excuse to hug her again. I could be dependable. Comforting. Boyfriend material. It was the kind of fantasy that marked me as a beta-male. The sort of guy who, even in his own daydreams, couldn’t think of a single reason he deserved the girl.\n\nI roved the juniors’ hallway and the cafeteria but couldn’t find Alina anywhere. I heard from DeLuca that she’d called out sick. I spent the rest of the day in a funk.\n\n\n\nKerry and I had gym 7th period, the last class of the day. It was too cold to go out to the fields, so we had to choose between three or four indoor activities. Ordinarily I’d have opted for floor hockey, the only gym class activity I have ever enjoyed, but I felt obligated to update Kerry on what I’d learned about Rob and the Spire, so I joined her in the auxiliary gym for a little ping-pong, a game I had no idea she was so good at.\n\n“Or it could have happened exactly like that,” Kerry said, acing me for the third straight time.\n\nI was surprised that Scary Kerry wasn’t as skeptical as I was. I mean, sure, Kerry absolutely believed in ghosts and, of course, I desperately wanted to; but we weren’t completely credulous about every story we heard. We didn’t relish wandering around graveyards and old buildings for no good reason. We weren’t looking to kill time. We did it because we wanted to find something. We wanted to pull back the curtain and glimpse the grandeur of creation. We wanted to feel small in the presence of the infinite and know, if only for a moment, there was more than food, sex, and the petty minutiae of social interaction.\n\nWhat it came down to was that while I believed Fletch, and I believed that Fletch believed Rob, it didn’t follow that I believed Rob. It was the difference between lying and just being wrong. Kerry and I had developed criteria for identifying the more promising leads, and the Spire in the Woods had a lot going against it. Secondhand accounts. Stories with an undercurrent of social control. Witnesses with a history of mental illness. These were red flags, and Rob’s story had all of them.\n\n“You wanna check it out?”\n\n“It’s kinda cold for a swim.”\n\n“I just wanna see if we can hear the bells.”\n\n“Yeah, maybe. I dunno. It’s kinda far.”\n\nOf course, there was another reason I was reluctant to head all the way out to the Quabbin Reservoir with Scary Kerry. She looked at me like I had just insulted her; she knew precisely what my other reason was. Our last ghost hunting expedition had been a disaster. A very personal disaster.\n\n\n\nKerry was old for our year. She turned 16 at the tail end of freshman year and had gotten her license the very first day of summer break. It was perfect, save for one thing: no car.\n\nKerry’s parents were divorced, and her dad had moved to New Jersey for a job. He paid his alimony and child support every month, but he just wasn’t a very wealthy man. Kerry’s mom had never gone to college. She had to work full-time at the deli counter at our local Market Basket just to make ends meet, which meant, most days, she had the car.\n\nBut at night, when the store was closed, Kerry had access to the world’s oldest, crappiest station wagon. For the most part, Kerry’s newfound freedom changed her life very little. Mainly, her trips involved picking up the members of her small group of friends and delivering them to Dan Burgen’s to watch anime and old horror movies in his basement. We only hung out twice that summer; both times Scary Kerry picked me up in what I called ‘Ecto-1,’ and we went ghost hunting.\n\nOur first trip was to the Blood Cemetery. That’s how we discovered the story of Abel Blood was a steaming load. We dressed in all black (par for the course in Kerry’s case) and brought flashlights, wax paper, and crayons. I also took the silver crucifix my parents had given me as a first communion present and my mother’s Bible, just in case we saw something. It was fun scrambling over the old stone wall, sneaking through the cemetery with our flashlights held low, trying not to step on anybody’s grave.\n\nEven after seeing that the years of death didn’t line up, we still checked out the curve where the ghost of the little girl supposedly ran out in front of passing cars. The blind curve was indeed full of skid marks. It also had, about twenty feet in front of it, a “Deer Crossing” sign.\n\nTwo or three weeks later, we went to a charity auction at the rec center and slipped up the stairs to the attic. The stairs squeaked beneath our feet and even though, at worst, we’d just be thrown out of the rec center, we were terrified of getting caught.  \n\nThe attic hadn’t changed in the seven or so years since my last visit. A couple of card tables housed bins full of crafting materials, a pair of filing cabinets sat against the back wall gathering dust, and most importantly of all, despite it being June, there were still cold spots.\n\nWe’d stand just outside of one,  reach an arm in, and try to define the boundary of the warm and cold air. It was tricky. The shift in temperature wasn’t as great as I remembered from when I was a kid and there were no hard, fine edges between the hot and the cold air. The temperature just seemed to bleed from one area into another, like brine in an estuary.\n\nI experimented sticking my crucifix into the heart of the cold spot, and felt nothing. If anything, it felt like the cold spots were fading away. Kerry suggested we tried talking to the ‘spirit’ of Jennifer Wilkins while we still could.\n\nI shrugged. “After you.”\n\nWe’d forsaken most of our ghost hunting kit as it would have been awfully conspicuous carrying around a Bible and a couple of flashlights. I still had my crucifix, but I doubted it’d be necessary. The stories of the Silver Specter were all quite tame. We had, however, brought a couple of sticks of incense, which we lit with a very old Zippo that had once belonged to my grandfather. Kerry had bought the incense from a new-age store, the sort of place you’d shop at if you were inclined to believe in Neo-Paganism or healing crystals. The saleswoman told her it was supposed to make it easier for spirits to pass into our realm, but to me, it just smelled like sandalwood.\n\nKerry spoke in a lilting tone, “Jennifer, are you here with us?”  \n\nI burst out laughing and Kerry went beet red. She punched me in the arm and whispered for me to be quiet, pointing to the floor where beneath our feet the auction was taking place.\n\nKerry tried again, “Jennifer, if you can hear me, give us a sign!”\n\nWe stood still in absolute silence, waiting for an answer. It came in the form of the industrial air conditioner, mounted to the ceiling of the floor below us, cycling on. A few gaps in the floor boards lined up perfectly with one of the AC’s large vents. We couldn’t stop laughing as ‘the spirit of Jennifer Wilkins’ returned the cold spots to full force.\n\nOnce we’d regained our composure, Kerry and I decided to head over to Bickford’s for a bite to eat while we conducted the post-mortem on our latest failure. Now, a deer crossing sign and an air conditioner don’t necessarily disprove that the Blood Cemetery and our town rec center are haunted, but they certainly had made us feel rather foolish, so while I gorged myself on eggs Benedict (which I had only recently discovered) and Kerry nursed a cup of coffee, we started tossing around ideas for other expeditions.\n\n“No place local.” She said. “Gotta stay objective. It can’t be some place we’ve grown up thinking’s haunted.”\n\n“You just don’t want anyone we know hearing your little sing-talking-to-the-spirit-world voice.”\n\nKerry, in mock anger, reached over, grabbed a home fry off of my plate, and threw it at me. It had taken her a long time to get comfortable with me teasing her. I guess after a lifetime of being mocked about her weight and appearance, the idea that it was the only way I expressed affection took some getting used to.\n\nThere were a few places in and around Boston we wanted to check out, but most of them were landmarks or buildings that were still in use. Neither of us was eager to get arrested, particularly not Kerry who was going to have a hard enough time getting into college; so Boston was out, and most of Lowell too. We dismissed a couple of nearby leads: the Gilson Road Cemetery, which had no actual history surrounding it, just a hodgepodge of random urban legends, and the Blue Lady out in Wilton, NH, who sounded somewhat promising but was most frequently sighted during harvest moons, which we wouldn’t get until late September.\n\nEventually we settled on the Eunice Williams Covered Bridge in Greenfield, Massachusetts. It had everything going for it: a traumatic death, consistent sightings, and no air conditioning. The only downside was that, for us, Greenfield was a solid two-hour drive each way, and that was if the MapQuest directions were up to date (a mighty big “if”).\n\nI didn’t see Kerry again that summer. Life just got in the way. For Kerry, it was difficult to work around her mom’s schedule, especially after a tiny little accident she had backing out of a space at the mall resulted in her losing her driving privileges for a month. While for me, it was the pool Kristy McDowell’s parents had put in that June. While my feelings for Kristy and our other mutual female friends were mostly platonic, I was fifteen, and they were in bikinis. By comparison, ghost hunting just didn’t seem quite as exciting. Knowing how my friends felt about her, I never invited Kerry to tag along. Of course, in fairness to me, pool parties weren’t exactly her cup of tea.\n\nWhen school started up again in the fall, Kerry and I resumed talking about our trip to Greenfield, but it wasn’t until Rob Kennan killed himself and I made an effort to spend more time with her that we got around to actually going. Kerry picked me up early one Friday evening in mid-November. Mrs. Peterson had opened the store that morning and would be closing the next day, meaning we had Ecto-1 all night. We just needed to get the car back before she woke up and she’d be none the wiser.\n\nDriving around with friends was still novel at that point in my life. The two hours passed by in a blur of jokes and gossip and screaming along to what little music Kerry and I could agree on. She used to have this mix tape dominated by Nine Inch Nails and Rage Against the Machine that was a staple of our time in Ecto-1. I think we listened to it straight through two and a half times that night.\n\nWe only got turned around once, and arrived at the Eunice Williams Covered Bridge absolutely pumped. We pulled into the bridge, cut the motor, honked once and waited for Eunice.\n\nEunice Williams was not a resident of Greenfield. She had actually lived in nearby Deerfield, back in the late 1600s. At the time, Deerfield was the northwesternmost outpost of New England, deep in the heart of the former Pocumtuck nation.\n\nBefore the settlers had arrived in Deerfield, the Pocumtuck had already been weakened by European diseases and war with the Mohawk People. When the settlers and Pocumtuck clashed over resources, the settlers easily drove the remaining Pocumtuck from their land.\n\nThe Pocumtuck, however, were not ready to admit defeat. They allied themselves with French settlers and other French-aligned First Peoples in Canada and, in 1704, led an offensive raid against Deerfield’s English settlers. The French and Native Americans killed 56 settlers and burned much of the town to the ground. They captured over a hundred survivors, and forced them to march through brutal winter conditions into Quebec. The march would take months.\n\nAmong the captured survivors was Eunice Mather Williams, her husband, Minister John Williams, and five of their seven children. Her infant daughter and six-and-a-half-year-old son were both killed during the raid, but John and Eunice were determined to be strong for their other children and fellow captives. The Williamses quoted scripture, led the group in prayer, and took turns carrying their younger children until they reached the Green River.\n\nEunice fell during the crossing.\n\nDespite having survived her plunge, a Pocumtuck warrior decided that Eunice’s exposure to the icy water had weakened her too much to continue the march, so he hacked her to pieces in front of her husband and their remaining children.\n\nLegend has it that Eunice appears on the bridge over the waters where she was killed, asking any mortals she finds there of news about her children and husband. Locals say she can be summoned simply by cutting your engine and honking your horn.\n\nWe’d been sitting there in Ecto-1 with the engine off and no heat, when a thought occurred to me: “Why would the ghost of a woman who died a couple of centuries before the invention of the automobile respond to a horn being honked?”\n\nI could see the gears turning in Scary Kerry’s head as she processed the anachronism. “Well...maybe she’s just...fuck!”\n\nI laughed as Kerry turned on the car to get the heat going again. “And you couldn’t’ve thought of this before we drove out here?” she asked.\n\n“Well, doesn’t mean the bridge isn’t haunted. Just that Eunice probably isn’t a car gal.”\n\nWe waited for a bit, then got out of the car and poked around the bridge on foot. I’ve always liked covered bridges, ever since seeing Disney’s the Legend of Sleepy Hollow cartoon as a kid, and there’s a nifty little plaque at this one that tells the whole story of Eunice Williams.\n\nWe scrambled down to the banks of the river. It’s not exactly the Mississippi, but it was easy to see how difficult it would have been to ford, especially under the strained circumstances Eunice was facing. I skipped a few pebbles, a difficult feat in fast-moving water, before we got cold and decided to return to the car.\n\nMaybe it was the increasingly likely prospect that another of our missions was going to prove to be a waste, or maybe it was just the hour and the warm air of the heater blasting in our faces and making us sleepy, but whatever the cause, our energy was fading fast and our conversation had turned serious. Well, serious by high school standards.\n\n“Do you think Kim Murray is pretty?”\n\nKim Murray. I did not think she was pretty, but that put me in a precarious position. Physically Kim had her faults, but, objectively speaking, she was significantly more attractive than Kerry, a girl Drew DeLuca once described, with what was for Drew a considerable amount of sympathy, as “unfortunate-looking.”\n\nKerry shifted in her seat to face me.\n\n“I dunno. Never gave it much thought, I guess. Why?”\n\n“We were at Dan’s the other night, and she was talking about how much she likes knowing that guys masturbate while thinking about her.”\n\n“Yeah, I don’t think this is a topic of conversation I want to pursue.”\n\nKerry grunted softly. “That’s what I said. It’s kinda gross.” There was a pause. When Kerry spoke again, her voice caught in her throat. “And then Kim said, ‘Well then, I guess you're lucky you don’t have to worry about anyone doing it over you.’”\n\nMy cheeks burned with embarrassment. I didn’t know what to say. I never imagined Kerry would share her sexual insecurities with me, in part because I never thought of her in sexual terms. On some level, I don’t think it ever fully processed for me that Kerry was a girl, like Alina or Kristy. That’s not to say I was confused about her gender identity, but that, because I found her unattractive, my mind had neutered her, had significantly reduced her as a human being.\n\nKerry started to cry and I leaned over to give her a hug. She let a few hushed sobs out into my shoulder as I patted her broad back. At some point she stopped crying. It took me a second to notice, but what I thought was her taking a shuddering breath, or maybe just a tear-covered cheek sliding over my skin, was actually Kerry kissing my neck.\n\nI wanted to leap into the backseat, to lurch away from Kerry and retreat into the furthest recess of Ecto-1. I wanted to throw open my door, sprint to the nearest house and demand that its occupants permit to shower. But I couldn’t do that. As revolted as I was that my actions and intentions had been so wildly misconstrued, Kerry was still my friend. And she was vulnerable, and she didn’t deserve that.\n\nI froze, hoping she’d realize I wasn’t reciprocating. The nuzzling and kissing continued. I guess she didn’t, or maybe she didn’t realize that this was a red flag— we never spoke about what happened in Greenfield— but either way, she needed a clearer stop sign. I put my hands on her shoulders and gently pushed myself away from her.\n\nShe got the message.\n\n“I just...I don’t...I don’t think of you like that...” I had trouble spitting it out.\n\nShe nodded.\n\n“We’re friends,” I said.\n\n“Uh-huh.”\n\nThe trip home was one of the longest car rides of my life. Kerry never turned on the radio. The only words out of my mouth were the turns I called out off of our Mapquest directions.\n\nI felt shallow. I think we both knew that I’d only said, “we’re friends” to soften the blow. I wouldn’t have dismissed the affections of any of my other female friends so readily. Even Kristy McDowell, whom I’d been friends with since the third grade, I would never have pushed away like that.\n\nThe following Monday, I made it a point to talk to Kerry in class like nothing had happened. She played along for a bit, but then asked me for a little space. Frankly, I was relieved to give it to her.\n\nI only told a couple of people about Scary Kerry kissing my neck. DeLuca thought it was hilarious. He wasn’t the most sensitive guy in the world. Kristy was a bit more sympathetic. She reminded me I was entitled to have my tastes. I appreciated hearing it, but I still felt like a shit. I had set out to make Kerry feel better about herself, and had done nothing of the kind. And I never thought of myself as the sort of guy who’d judge a girl based on her looks, but apparently I was.\n\n\n\nAlina didn’t return to school for a whole week after our last conversation. She told everyone who asked that she’d had the flu, but later confessed to me that she couldn’t take being surrounded by people. Too noisy. Too overwhelming. Too many eyes staring at her. She needed to be alone.\n\nI didn’t see her at lunch that day, or ever again. The anxiety she felt being surrounded by people was at its worst when she was trying to eat. So her parents arranged for her to eat in her guidance counselor’s office. When I found out, I knew it was good for Alina, but I couldn’t help but feel like my days would be a little drearier without being able to see her across the cafeteria. Her wild hair. That smirk (if it ever returned). And that was to say nothing of the wonder that years of track and cross country had done for her legs.\n\nI finally caught up with her on Friday morning. She was at her locker. To cut down on the amount of time she had to spend jammed between chatty classmates, Alina had taken to cramming every book and binder she’d need until lunch into her backpack. She looked like a freshman.\n\n“Hey, Alina.”\n\nShe didn’t look up. “Oh, hey,” she mumbled.\n\nI dropped down next to where she was crouching, and lowered my voice. “I spoke with Fletch.”\n\nAlina froze. I couldn’t tell if she was nervous or excited. She took a couple of deep breaths as she turned towards me. “Did you see it?”\n\n“Yeah. Basically said the same thing as yours.” She deflated, but I continued. “But then he told me what happened. You gonna be at lunch?”\n\nShe bit her lower lip as she considered for a second. “No.”\n\n“Oh. Well, we could—”\n\n“What do you have last period?”\n\n“Just gym.”\n\n“Can you skip it?”\n\nI’d never cut a class in my life. “Absolutely.”\n\n\n\n\nContinued in",
        "url": "http://www.reddit.com/r/nosleep/comments/1o5rdt/the_spire_in_the_woods_part_3_series/",
        "title": "The Spire in the Woods part 3 [series]"
    },
    {
        "body": "I didn’t have any classes with Fletch and rarely saw him in the halls, but I had two classes with Drew DeLuca and he had lunch the same period as Fletch, so I had him pass along that I wouldn’t need a ride. When 6th period let out, I made my way over to the parking lot where Alina was waiting for me next to her blue ‘98 Beetle.\n\nWe got in and blasted the heat. Unlike Fletch’s ancient Civic, Alina’s Beetle actually warmed up pretty quick. Everything but the silence was comfortable.\n\n“Do you...do you wanna get right into it?”\n\nAlina looked at me out of the corner of her eyes. They were so blue. She shook her head. “Not while I’m driving.”\n\nWe rode in silence until we pulled up in front of a good-sized colonial house.\n\n“Is this ok?” she asked.\n\n“Oh yeah, yeah. Sure.”\n\n“I just...I don’t want to talk about it in public.”\n\n“It’s totally fine.”\n\nAlina looked relieved as she hit the garage door opener. It was like she thought bringing me over her house was really putting me out. Getting out of the car, I noticed the garage was otherwise empty. We were alone.\n\nAbbey, an aging golden retriever that the Aminevs apparently didn’t kennel, greeted us with her tail wagging and her leash in her mouth.\n\n“I have to take her out. Make yourself at home.”\n\nJust being inside Alina’s house felt so intimate. Identity is everything to a teenager, and to bring someone else into your home was to expose a part of you that was beyond your control. It was laying bare the environment that had produced you.\n\nWhen I had first entered Fletch’s house, his discomfort was evident. His house was just a place he passed through to get to his room. For Scary Kerry, her house was a source of shame. Mrs. Peterson’s small, ill-kept home was a constant reminder to Kerry, not just of her parents’ failed marriage, but of her mother’s lack of achievement. Lack of education. They were both stuck there, in a house that smelled of deli meats and the water that feta cheese is packed in. A smell that started in Mrs. Peterson’s work clothes but now infused everything they owned.\n\nI entered Alina’s house with the same reverence I would a church. It had a feeling to it that put you in the mood to sip hot chocolate and watch the snow fall. There were candles and tealights on the tables and holiday-themed knickknacks on the walls. The piney scent of a Christmas tree filled the air, and as I collapsed onto their overstuffed couch, it occurred to me that for the first time all day, I felt relaxed.\n\nAfter she returned, Alina lead me downstairs into the ‘game room,’ a finished basement dominated by a full-sized pool table. She offered me a soda from the mini fridge behind the wet bar and then we sat down on a loveseat in front of the big-screen TV.\n\nAlina stared at me while I spoke. I stared back. It was impossible to look anywhere else. I recounted the story Fletch had told me, as faithfully as I could. All the while I was very conscious of where her legs were in relation to mine. They tugged at me as if they had gravity.\n\nShe’d seemed fine the whole time I talked, but the moment I was done she began gasping for air, like she’d been holding her breath. Then the sobbing started. I was quick to close the gap between us. I held her for several minutes while her slender frame shook and quivered. When she regained her composure, she slowly withdrew to her end of the love seat.\n\n“Oh, God. I’m sorry,” she said, wiping her eyes with her sleeve.\n\n“Don’t be.”\n\n“I’m such a mess. I feel ashamed when I’m happy and like a victim when I’m ashamed. It takes everything I’ve got just to keep it together. It’s exhausting.”\n\n“Have you talked to anyone? Seen a...you know?”  \n\n“Yeah, but she won’t give me anything.”\n\n“That’s not a bad thing.”\n\n“So you don’t believe any of it?” Her right leg began bouncing up and down on the ball of her foot. “I thought you were Mr. Ghost Hunter.”\n\nI scoffed. The corner of her mouth twitched as if she were about to smile and for a fleeting second, I felt connected to her. To the old Alina.\n\nI didn’t run around telling everyone I met why I cared so much about ghost stories. I didn’t wear anything that personal on my sleeve, but I told Alina. She listened and nodded and understood me.\n\n“Can I ask you something?”\n\nShe nodded.\n\n“Why does it matter to you if the Widower’s Clock is real?”  \n\n“I need them to be wrong about me. The people who stare at me in the halls. Blame me. Like Fletch and John Murphy.”\n\n“Fletch’s just hurting. He doesn’t blame you. Not really.”\n\n“Yes he does. Everybody does. All they get are these little snippets about how much Rob loved me. I’ve heard them talk about it. They say I thought I was better than him because I live in a big house, or because he wasn’t a jock, or because he was nerdy. He loved me, and I was a bitch for rejecting him.”\n\nAlina pulled her legs up to chest and hugged her knees. I remember being struck by how much she looked like a little girl. It seemed strange at the time, but in hindsight, at scarcely seventeen Alina practically was a little girl. A kid realizing for the first time that her classmates felt entitled to opinions about what she did with her body and affections.\n\nI wanted to tell her that it wasn’t true. That no one really believed she was a snob about money or shallow or a bitch. I wanted to, but I’d also heard the whispers.\n\n“The truth is,” she said. “The only thing I really knew about him is that he made me uncomfortable.”\n\nI moved beside her and put my arm around her shoulder. I could feel how tense she was as she stared straight ahead.\n\n“It’s not your fault.” Her haired smelled like vanilla. “Alina, look at me.” She looked so full of uncertainty. Scared. I put my other hand on her wrist. “I’m gonna go down there, to the Quabbin...”\n\nShe grabbed me by the shoulder and held me like I might fall.\n\n“It’s OK.” I couldn’t help smiling at her concern. “I won’t go in. I’m just going to listen for the bells.”\n\nShe studied my face. We were only inches apart. My heart was racing. “Besides,” I said as I leaned in, “I want to.” And I kissed her.\n\nHer lips were slow to respond. Doubts raced through me. Was she surprised? Was this a rejection? Had I crossed a line? I felt like Scary Kerry must have back in Greenfield. But Alina didn’t withdraw.\n\nMaybe it had nothing to do with me. Maybe it was just survivor’s guilt.\n\nAfter a very long couple of seconds, Alina kissed me back. My brain went fuzzy. I almost had to stop. It’s tough to kiss with a grin. I was kissing Alina Aminev. I slipped my fingers through her wild hair. Alina who ran track. I could feel my leg pressed against hers. Alina who smelled like vanilla and smirked when she used to smile. I tried to press my leg between hers, but she kept her legs closed. And that I was fine, I was happy just to be kissing her.\n\nWe spent the next few minutes on that loveseat. It wasn’t the sort of first kiss you imagine, I was nervous, and she was still. At the time, I remember thinking it was more intimate than passionate, but that made sense to me. She wasn’t in a real good place. Being with her was going to be like building a house of cards. It’d take a slow hand and the slightest misstep could bring her crumbling down.\n\nShe wanted to drive me home before her parents returned from work. As we were getting our coats on, I said, “Let’s see a movie.”\n\nShe didn’t answer immediately. I thought for a second she hadn’t heard me. “I can’t. I can’t.”\n\nI kissed her and asked again, but it didn’t help.\n\n“What if someone sees us?”\n\nI wanted people to see us. I didn’t care what people thought about her. I didn’t even give a rat’s ass what Fletch thought about her.\n\n“Please don’t tell him. Don’t tell anybody. I can’t handle how they’d look at me.”\n\nShe broke down. I held her.\n\n\n\nAs I lay in bed that night I found myself fantasizing about Alina. It wasn’t sexual, hell, it wasn’t even about the kiss. It was about the most mundane things. Spooning her while we watched TV. Holding her hand while we walked down the hallways at school. Having little arguments over who’d sit at whose lunch table.\n\nThat’s when I resolved that I had to find the Spire in the Woods. Right in the middle of fantasy-Alina apologizing for not wanting to sit with my friends and telling fantasy-me that I was the most important thing in the world to her. I had to find it for Alina. To get her out from under some of the guilt she held on her shoulders.\n\nAnd was it really so crazy to think there might be some truth to it? Even if I was skeptical of the connection to the Widower’s Clock, couldn’t Robert Edward Kennan have followed the sound of bells? Couldn’t he have discovered a spire sticking out of the ground?\n\nMaybe he even found a body. Hadn’t Fletch mentioned someone had gone missing from that trailer park? If he had found her corpse, that could have certainly pushed him over the edge.   \n\nThe thought sent a shiver up my spine.  \n\n\n\nThe last couple of weeks before Christmas vacation were always filled with midterms and projects, and that year was no exception. It was the last thing in the world either of us wanted to do, but with a group project due Monday, I had to meet Scary Kerry at the library.\n\nWe were bullshitting while I busted my rear end looking for sources for our presentation on Robespierre (I had practically carried Kerry through the first half of European History), when I told her that I had changed my mind. I wanted to visit the Quabbin.\n\nKerry was thrilled. “When do you wanna go?”\n\n“I dunno. Sometime over break, I guess.”\n\n“We should try to figure out everything about them.”\n\n“Who?”\n\n“The clockmaker and his wife.”\n\nOnly one of my haunted New England books told the story of the Widower’s Clock, and maybe it was because I’d initially been skeptical that the story was grounded in any sort of reality, but it honestly never occurred to me that there was anything more to know. But if there was a clockmaker, he had to have made clocks, and if there’d been a murder, there must be an obituary.\n\nKerry disappeared into the basement where the library kept their microfiche. With her gone, I was able to finish researching our paper in short order and by the time I wandered downstairs, she’d found out quite a bit.\n\n\n\nThe clockmaker was a German immigrant named Adolf Riefler, born in 1857. He was hired sometime between 1905 and 1907 to construct the clock for the Custom House Tower in Boston by an architect named Robert Swain Peabody. The clock was a failure. In an effort to show up his two brothers, who were also master clockmakers, Riefler attempted to miniaturize several of the motor’s components. While the clock ran, it failed to keep accurate time. The clock was referred to by some as Adolf’s Folly until the mid-1930s, when Hitler’s infamy outstripped Riefler’s.\n\nThe bride was Robert Swain Peabody’s niece, Amy Lowell Putnam, born 1892. She was just 16 when she married Riefler, who was, by that time, 51 years old. I suppose the age difference wasn’t that unusual in those times, but back in 1999, when Alina was 17, the idea of her with a man in his 50s made my skin crawl.\n\nIt also made me regard Amy Lowell Putnam with more sympathy. Imagine being married off at 16 to a man more than three times your age. Imagine twenty years of marriage to that man, waking up to find yourself in your mid-thirties, still in the heart of your sexual prime, with a husband in his seventies. Of course she was attracted to other men.\n\nWe couldn’t find an obituary for Amy Lowell Putnam, nor for Amy Lowell Riefler, nor for Amy Putnam Riefler. Scary Kerry took it as a sign that the Putnams, Lowells or Peabodys, all powerful families, had covered up the scandalous manner in which Amy Lowell had died. I, on the other hand, chalked it up to the microfiche being a bitch to work with.\n\nWhat we did find of interest, though, was a picture of Enfield in 1938. It depicted a large hill with most of its trees cut down, a tractor pushing aside some debris and a lone man standing with his back to a large colonial building. The large colonial was the only one still standing. And it had a little tower. We couldn’t tell whether or not it had a clock— the old microfiche view screens didn’t exactly have great resolution— but based on its proximity to the hill, it was easy to see how the loose soil could have enveloped it (or another building very much like it) when the flood waters came pouring through, leaving just a spire peaking out above the earth.\n\nWe only found one more reference to Adolf Riefler: an obituary published by The Boston Globe in 1941 (I wish I could remember the date). It mentioned that he was wanted for questioning in regard to a ‘disappearance,’ but that was all. Riefler had died in Munich. The cause of death was omitted, but at 84, it was probably just old age. Riefler must have fled the country sometime in the mid-1930s, at a time when the Germany he returned to must have been very different from the Germany he had originally left.\n\nI don’t know why, but somehow knowing these historical details made the story of the Widower’s Clock so much more plausible. It was no longer a story of a man with an unfaithful wife, the characters defined by nothing more than their relationship to one another. It started to become the story of two people. Amy Lowell Putnam, restless and starved for marital attention, shackled to an old man incapable of giving her what she needed; and proud Adolf Riefler, obsessed with proving himself after his failure designing the clock for Customs House Tower, too busy and too old to see what his young wife was up to.\n\n\n\nSince her mom had the car that day, when we got hungry Kerry and I had to choose between waiting for my mom to pick us up or hoofing it down to the (hometown omitted) House of Pizza to grab a bite. Despite the cold, we opted for the latter.\n\nSettling into a booth, a hot slice in front of both of us, things between Kerry and me felt right again for the first time since our trip to Greenfield. We quickly fell into discussing the plans for our trip.\n\n“We should head out early,” she said. “The first time Rob heard the bells, it was just after sundown.”\n\n“Yeah, but the later it is, the less likely we are to bump into some park ranger.”\n\n“Mmm. You think there are gates or fences?”\n\n“The roads in and out might be gated, but fences? Nah. The Quabbin’s too big.”\n\nJust as the words left my mouth, Fletch plopped down right next to me, his friend Murph lingering behind him. “Hey, I didn’t see you guys come in,” He said. “How long you been here?”\n\nI don’t know what I felt exactly. Embarrassment? Shame? But even though there was nothing in Fletch’s face to indicate that he’d heard me, I got that feeling you get when your parents tell you, “We’re not mad, we’re just disappointed.” I’d been so wrapped up in the fun of going on a ghost hunt and clicking with Scary Kerry again, that I’d lost sight of the fact that Rob Kennan had killed himself. I’d forgotten that the only reason I knew about the Spire in the Woods was because of his suicide notes, and had actually been happy about the whole thing, while two guys who had lost a good friend, quite possibly because of the Spire, were sitting right behind me.\n\n“I dunno. A bit,” I mumbled.\n\n“You wanna ride home? I can take both of you.”\n\nI really didn’t.\n\n“Sure,” Kerry said.\n\nMurph had just found out that he’d been accepted, via early admission, to UMass Amherst, a topic Scary Kerry found intriguing. Like many unhappy high school students, Kerry hung a lot of her hope on the idea that her life would get better in college. She knew she didn’t have the grades to get into a top-tier school. Hell, she knew that UMass Amherst was a real reach, but she had hoped to get into UMass Lowell and transfer after a year or two.\n\nOf course, Murph hadn’t thought he’d be accepted either.\n\n“Definitely apply early,” he said. “Shows them you’re serious. And see if you can get a reference from someone who went there. They list where all the teachers went to in the yearbook each year. Like half of them went to UMass.”\n\nKerry was hanging off Murph’s every word, but I wasn’t paying much attention to what he was saying. I was too busy hoping against hope that after we dropped Kerry off, Fletch would announce he wanted to hang out with Murph some more and, as such, would have to drop me off next.\n\nThat didn’t happen and we were soon alone together in the car. The second the door closed behind Murph, Fletch dropped his mask, and I knew that he’d heard me.\n\n“You’re going to the Quabbin? After what I told you, you’re going to the Quabbin?”\n\n“Yeah.”\n\n“Are you fucking retarded?” Fletch was a pretty big guy. That, coupled with the hurt and anger in his voice, intimidated me into silence. We drove on, listening to nothing but the heater struggling in vain to dispel the cold.\n\nAfter a few miles, I found myself resenting Fletch. Who was he to speak to me like that? And why the fuck should I feel guilty for his sake? He’d lost a friend and he had my sympathy, but that didn’t entitle him to treat me like garbage.\n\n“What’d you tell me for?”\n\nFletch didn’t answer my question. He just kept driving.\n\n“Huh? Why’d you tell me about it if you don’t want me to look into it?”\n\nFletch tightened his grip on the steering wheel and ground his teeth together as if he were literally chewing over the question.\n\nWe were in our neighborhood before he finally answered. “Who else could I tell? Did you know the school’s been contacting the parents of everyone who goes to the special counselling sessions? They’re reporting any ‘early warning signs’ they see in the sessions. You think I want my parents making me see somebody or sticking me on meds? I can’t go in there with a fucking ghost story.”\n\nFletch’s anger had left him. By the time we pulled into my driveway he looked deflated. “I thought you’d believe me. Or could disprove it. Or, shit, I don’t know.”\n\nIt seemed like both Fletch and Alina were looking to me to absolve their sins. Alina wanted me to prove that Rob had found a spire sticking up from the ground in the middle of the woods, and it was the reason he’d taken his own life. Fletch wanted me to tell him it was just a ghost story. I honestly couldn’t say what I believed, but I had to know.\n\n“I haven’t even told Murph,” he said. “I just couldn’t handle it if he blamed me for letting Rob go on his own.”\n\n“What would you have done if you’d been with him?”\n\n“I don’t know.” Fletch wouldn’t look me in the eyes. “But at least he wouldn’t have been alone.”  \n\n“Well, you don’t have to worry about us. We just wanna try to hear the bells. It’s not like we’re gonna swim out there or anything.”\n\n“Yeah, I know. I’m not gonna let ya.”\n\nI had no idea how Fletch intended to stop us. It’s not like we needed his permission to visit a public park and I told him his as much.\n\nFletch looked at me like I was an idiot.\n\n“If you’re going, so am I,” he said.\n\nI didn’t argue. If he felt guilty for letting Rob go looking for the Spire in the Woods alone, maybe being there with Kerry and me would help him get over it.\n\nAs Fletch backed out of the driveway, I realized there was another reason I didn’t protest. Scary Kerry. Yes, things that day had felt normal again between us, but I was still gun-shy about spending that much time alone with her. Especially on the shore of a moonlit lake. And as an added bonus, now we didn’t have to worry about getting Ecto-1 for the night.\n\n\n\nAlina kept her distance at school, especially after I attempted to steal a kiss from her the Wednesday before winter break. I had left class to use the bathroom and bumped into her on my way back. There were these moments, a few minutes here and there, where she seemed like nothing was wrong, where her smile and her laughter would come easily, and walking her back to class that day was one of those moments.\n\nThe corridor was nearly deserted. Just before we reached the door to her classroom, I stopped her. I slid one hand around her slender waist, and slipped the other through her hair towards her neck. I leaned in to kiss her and she withdrew from me, from my touch, as if I was on fire.\n\nAnd just like that, the old Alina was gone and the broken one was left in her place. We stood there apologizing to each other— her reassuring me that I had nothing to apologize for, me doing the same— before she finally backed into her classroom and shut the door.\n\nI was thankful Thursday was our last day. Winter break couldn’t arrive soon enough.\n\n\n\nI saw Alina twice over the break. Once before Kerry, Fletch, and I went to the Quabbin, and once after. Alina’s parents had a cabin at the foot of Shawnee Peak in Maine where they usually spent New Year’s Eve, but that year they decided to go up on the 27th and come back down on the 30th so Alina wouldn’t miss her weekly therapy session.\n\nThe day after Christmas, she came over to our house for dinner. My parents were wonderful. I had warned them about how nervous and anxious she was likely to be. I didn’t say a word about the suicide notes or the Spire in the Woods, but I had told them that Rob had had a crush on her and that Alina wasn’t coping well with his death. They couldn’t have been more understanding.\n\nOrdinarily my dad would have delighted in teasing anyone I brought home for the first time, but he refrained. Instead, whenever there was a lull in the conversation, he teased my younger brother, who had gotten for Christmas that year, among other things, a Furby, and insisted on bringing it to the dinner table.\n\n“Don’t let me catch you feeding that thing after midnight.”\n\nMy brother was too young to catch the reference and looked up, confused. “It’s only 6:30.”\n\n“Well, it’s always after midnight somewhere.”\n\nMy mom, for her part, also resisted her natural instincts. Usually, whenever someone came over to my house for the first time she’d practically interrogate them, stopping just shy of shining a spotlight in their face. This habit of hers had been particularly rough on Scary Kerry, whom my mom was briefly convinced was on drugs.\n\nAfter dinner, my dad suggested that I show Alina the TV that I had gotten for Christmas the day before. The TV that was in my room. He really was a great dad.\n\n“I really like your family,” Alina said once the door shut behind us.\n\nI scoffed. “Believe me, they were on their best behavior.”  \n\nDrew DeLuca was a firm advocate of the idea that a romantic movie was not the best movie to watch with a girl you wanted to get romantic with. For starters, most of them were, in his view, very crappy movies and the good ones ran the danger of actually holding a girl’s interest. What you wanted was a movie that was pleasant and charming, but light enough that you could miss a good chunk of it without feeling lost and needing to rewind. The sort of movie you’d stumble across while watching TV on a Sunday afternoon, and finish even though it was already mid-way through.\n\nI threw in Maverick.\n\nAlina sat on the floor and I followed suit, but not before grabbing a couple of pillows off my bed. Her movements were stiff as she settled down on the pillow. I tried not to appear too eager as I got down behind her and draped my arm over her waist.\n\nAs the movie started, I kept thinking about those fantasies I’d had the night after our first kiss, about how pleasant it’d be just to lie next to Alina watching TV. Just being near her and nothing more. I was right. But actually being beside her, my hand resting lightly against her flat stomach, I found other ideas even more enticing.\n\nI pulled myself closer to her, savoring the fragrance that her vanilla-scented shampoo left in her wild hair. My fingers crept slowly, almost imperceptibly, up her toned body.\n\nAlina stopped my hand. “Do your parents ever come up here?” she whispered.\n\n“No. We’re alone.”\n\n“Actually, would you mind if we just watched this? I haven’t seen it before.”\n\n“Oh, no, that’s...that’s cool,” I said, mentally cursing the day DeLuca had been born.\n\nI spent the next hour knowing the agony of a man without any fresh water, stuck on a life raft adrift at sea.\n\nAfter the movie, my luck didn’t improve much. The credits began to roll and I had it in my head that Alina might feel more comfortable expressing her affection for me if she felt like she was in control. I kissed her neck where it met her jaw and pulled her lithe little body on top of mine.\n\nThe pressure of her weight pressing down on me was an excruciating pleasure. My eyes rolled back in my head. Conscious thought melted away.\n\nMy fingers found their way to the bare skin of her lower back. I could feel the slight bumps of her vertebrae raising up her skin. It was oddly intoxicating. When had I become attracted to spines?\n\nI brushed my cheek against hers, and angled my face so our mouths aligned. Her lips parted tentatively. I listened for the subtle changes in her breathing that would tell me when it’d be safe to make the next move.\n\nHer breathing deepened. I slid my hands up, up, up her back, all the way to her satiny bra strap. I had never touched a bra before in my life and had only a vague idea of how to guide the hooks from the eyes.\n\nI nibbled her ear as my fingers fumbling beneath Alina’s shirt. And that’s when I felt that she was crying.\n\n“Hey. Hey. It’s OK. Look,” I whispered while pulling my hands out of her shirt. “See?”\n\nShe sniffled and turned her head away from me. I was so scared. I knew I couldn’t be too eager with her. I knew I couldn’t press her too hard. She was in a fragile state and there I was, thinking with anything but my head.\n\nMy only defense was that I’d just wanted to make her feel good. I’d thought, since she liked me, she’d like my touch as much as I craved hers.\n\nBut I’d thought wrong. On many levels.\n\nI gently pushed her chin up to look her in the eyes. “I didn’t mean to push you too fast. You OK?”\n\nShe nodded and I held her until she pushed herself up off of me.\n\nAlina paced around my room doing a breathing exercise her therapist had taught her. I went downstairs to grab us a couple glasses of water. It was less than the least I could do. While I was in the kitchen, my dad gave me a questioning look and a thumbs up behind my mother’s back. I shook my head no and felt like a failure.\n\nOnce she was calm enough to sit down, we sat on my bed, far apart from one another, sipping the water and talking.\n\n“It’s not you,” she said.\n\n“Yeah. Yeah. Don’t worry about it. I know you like me.”\n\nAlina gave a little nod as she stared down at her water.\n\n“This will pass,” I said. “People at school will move on to something else and leave you alone. And you can get back to normal.”\n\nAlina got up and started pacing again. “My parents don’t even think I can skip a session for New Year’s. How’s that for normal? I hate that we’re not going to be up at Shawnee for New Year’s.” She put the glass down on my desk, her hands as fidgety as her legs. “Every year we go skiing in the morning, then drive into North Conway to have dinner and watch the fireworks until my mom gets too cold and wants to head back. That’s all I want. And I can’t even handle that.”\n\n“What if I found something down at the Quabbin?” Alina stopped, practically mid-step, and stared at me. I hadn’t noticed until just then, but she had bags under her eyes. “Would that help?”\n\n“When are you going?”\n\n“Tomorrow.”\n\nAlina stared at me. The energy in the room had changed. I could practically smell her desperation as easily as her vanilla-scented shampoo. She needed me to find the Spire in the Woods and prove that it was the Widower’s Clock. Prove that Rob hadn’t killed himself because she broke his heart, but because he’d been haunted by the ghost of Amy Lowell Putnam.\n\nAnd if Alina Aminev needed it, so did I. To hell with Fletch. To hell with just hearing the bells. I was going to find the Spire.\n\n\nContinued in",
        "url": "http://www.reddit.com/r/nosleep/comments/1o99js/series_the_spire_in_the_woods_part_4/",
        "title": "[Series] The Spire in the Woods part 4"
    },
    {
        "body": "“What’s with the bag?” Fletch asked as I tossed my duffel bag onto the back seat and got inside his car. If memory serves, it’d been 25 or so that day, and felt even colder in the little Civic.\n\n“Supplies. Incense. My mom’s Bible. Couple flashlights. Some miscellaneous crap I borrowed from Kerry.”\n\nFletch acknowledged he’d heard me with a soft grunt and we were on our way to pick up Scary Kerry.\n\nTruth be told, while the bag did have my mother’s Bible and the flashlights, the ‘miscellaneous crap I borrowed from Kerry’ was actually a bicycle pump and a pool raft shaped like a small boat that I’d borrowed from Kristy McDowell earlier that day. I didn’t see the sense in telling Fletch yet that I wanted to do more than just hear the bells. At least not while we were still in my driveway and he could back out. Better to wait until we were down there and the worst he could do was leave us without a ride home.\n\nWe grabbed Kerry and were properly on our way shortly after eight o’clock. For the first hour or so, the drive was surprisingly pleasant. Kerry asked Fletch questions about where he was hoping to go to college, which schools were his safeties, and how he was going to pay for it.\n\nFletch answered all of her questions and was even joking around a bit, but as we got deeper into Massachusetts his nerves started to creep in. He fell silent around the time we cleared Worcester. It didn’t take a mind reader to know he was thinking about Rob. It was impossible not to.\n\nWe were retracing the steps of a boy who had killed himself. Whatever he’d found down there, whether it was supernatural or not, whether it was something or nothing, Rob had blamed it for driving him to madness and death.  \n\nI had never been scared on any of my other ghost-hunting trips. Not really. Usually I was filled with a sense of anticipation. A giddy feeling that I could soon make a discovery that would forever change the way I saw the whole world, accompanied by a touch of anxiety that I might get caught trespassing somewhere I didn’t belong.\n\nBut as we pulled into the trailer park, my heart was pounding in my chest and my palms were covered in a cold sweat.\n\n“Ten thirteen,” Fletch said, cutting the engine. “If we hustle we might be able to hear the bells toll eleven.”\n\nKerry and I nodded dumbly. I could tell she was feeling it too. This was different than the Blood Cemetery or the Eunice Williams Covered Bridge. We were walking into the ghost story of Robert Edward Kennan. And the only thing we knew for certain was that he was dead.\n\n“Pass me my bag,” I said to Kerry as we stepped out of the car.\n\nFletch wordlessly led the way. The crunch of the dead leaves beneath our feet echoed out into the forest. Even though the moon cast more than enough light for us to see, I fished the flashlights out of my bag just to have something to do.\n\nIt hadn’t snowed yet that year, at least not at the Quabbin, but it was cold. The temperature had dropped into the high teens and the wind ripping through the bare trees wasn’t helping matters any.  \n\nIt was no surprise we didn’t see anyone as we crossed into the park. We were in the middle of nowhere. Hell, if it weren’t for the metal pole that served as a gate stretched across Old Ware-Enfield road, we probably could have driven in without anyone noticing.\n\nThe smell of woodsmoke hung faintly on the wind. Somewhere, miles away, people were sitting around their fireplace, probably commenting on what a good night it was for a fire. I bet they felt cozy.\n\nFletch rubbed his nose and sniffled. It could have just been the cold making his nose run a little, or maybe he smelled the smoke too. Either way, it reminded me of something I’d read once. Firemen say that when a person burns to death, their flesh smells like pork.\n\nI pitied Fletch. Thank God I hadn’t been there to smell Rob burn.\n\nBy the time we reached the fork where the access road splits off from Old Ware-Enfield, my legs felt like blocks of ice. We hadn’t been stupid. We had warm hats and jackets, but a two, two and a half mile walk at night in late December is too much for just a pair of jeans.\n\nI stomped my feet to warm up. “What I wouldn’t give for some ski pants.”\n\n“At least you brought gloves.” Kerry said. She had one hand buried deep in her coat pocket, the other holding the flashlight I’d given her with her sleeve pulled down over her fingers.\n\nFletch cast a baleful eye in our direction. Even though we hadn’t been particularly loud or said anything disrespectful, he looked at us as if he’d caught us dancing on Rob’s grave. As far as Fletch was concerned, we were on hallowed ground.\n\nWe pressed on in silence until, from just ahead of us, we heard “cuh...cuh...cuh...” whispering gently through the trees. It sounded vaguely like the Friday the 13th soundtrack was being carried on the wind across a great distance.\n\n“What the hell’s that?” Kerry hissed.\n\n“Ice.” I said.\n\n“Ice makes noise?”\n\n“Yup.”\n\nPeople think of ice as an object— solid and inert— but ice expands and contracts a great deal. Slight variations in temperature, small eddies and imperceptible currents prevent the water from freezing uniformly. Little fissures turn into big cracks as the ice strains against itself until it buckles and splinters into plates. What we were hearing was like Continental drift in miniature, big ice plates pressing against each other until something snapped with the resulting sound echoing over the reservoir's frozen surface.\n\nWe cleared the treeline and, sure enough, the Quabbin was frozen. I was surprised. bodies of water as big as the Quabbin don’t usually freeze until mid-January or so.\n\n“Guess we won’t be needing the raft,” I thought.\n\nThat’s when the bells chimed eleven.\n\n\n\nBliss. My body shuddered. I felt like I was beneath Alina, her weight pressing down on the parts of me that strained to meet her. My flesh tingled. It was as if the smooth skin of her back that my fingertips had danced lightly across now surrounded every inch of me.\n\nIn that lingering moment, I was sated. The bells had nourished me like a feast nourishes the starving. I wanted nothing but to be exactly where I was, hearing exactly what I was hearing, feeling exactly what I was feeling.\n\nThen all was silence. I was, once more, out in the cold.\n\n“I heard them,” Kerry breathed. I turned to her and saw that she had a wistful gleam in her. It was the first and last time I ever saw her truly happy.\n\nFletch fell to his knees, tears rolling down his cheeks.\n\n“Oh my God,” he said. “Oh my God.” He was laboring to breathe. “That was... that was beautiful.”\n\nI sat down beside him. The dirt beneath us was hard as rock. The echo coming off the ice sounded like a gentle tide lapping on the shore. I looked up at the sky. So far away from the light pollution of Nashua or Boston or Lowell, I could see a myriad of stars I’d never noticed before. It’s the sort of thing that makes some feel small, but not me. I’d just peeked behind reality’s veil and discovered...\n\nWell, I didn’t know exactly what, just that there was more! Not up there around distant stars, suspended on the far side of an unfathomably great abyss, but right here, with nothing between us and this undiscovered country but a few hundred yards of ice and an hour’s time, when the bells would toll twelve.\n\nWe should have left. We said we only wanted to hear the bells. The only reason Fletch was even there was to make sure we’d turn back. I had witnessed what I’d been searching for throughout all of my ghost hunts: I had evidence of the supernatural.Wasn’t that all I’d ever wanted? One experience to bolster my faith? Just one that I could point to, cling to, whenever I found myself besieged by doubts?\n\nI had certainly thought so, until I heard those goddamn bells.\n\nI’m not sure which one of us was the first to tentatively step onto the ice, but I recall clearly none of us voiced an objection. Not even Fletch.\n\nThe ice was slick, and we fell hard more than once, but we were all of us New Englanders and no strangers to shuffling across an expanse of ice. The trick was to keep your weight centered above your feet.\n\nWe talked in clipped bursts about what the bells had felt like to us, speaking in broken analogies, unable to fully share what the bells had awoken inside of us, but straining to convey it as best we could.\n\n“I only ever flew in a plane once. My parents, even though they couldn’t really afford it, took me to Disney. They were already fighting then. It was bad. But on the plane, going to Disney, when it started to take off...” Kerry trialed off.\n\n“Cuh...cuh...cuh...” The echo was louder than we’d heard it from the shore.\n\n“In my head, when I was seven, only rich people flew anywhere. And my parents weren’t fighting. I felt lucky, you know?”\n\nFletch grunted his acknowledgement. “What time is it?”\n\nI checked me watch. “About a quarter past.”\n\n“CUH.” We must have been right on top of where the ice was grinding against itself.\n\nWe froze. Each of us strained our eyes and ears, trying to determine if the ice was safe. We knew if the ice wasn’t safe it’d be dangerous to press on. We knew it, but we didn’t care.\n\n“Maybe you should go first,” Fletch said to me. “You’re the lightest.”\n\n“Yeah,” I said and shuffled ahead. Being closer to the bells felt worth the risk. Any risk.\n\nKerry and Fletch followed in my wake, neither following directly behind me so as to spread our weight across a broader area.\n\nWe pressed on. The conversation died. The wind blew hard across the reservoir and tore through our clothes like a knife.\n\nWe didn’t care.\n\n“Cuh...cuh...cuh...” The sound was growing fainter. We had crossed nearly three quarters of the distance to the island that housed the Spire.\n\nI never heard the ice crack, just the sharp inhalation of breath for a scream that never escaped her lips. Kerry plunged through the ice. I turned just in time to see her head go under.\n\nKerry came up thrashing, but as she hit the sides of the hole she’d made more and more of the ice broke away, expanding the hole to the size of a kiddie pool.\n\nI shuffled my feet as fast as I could towards the edge.\n\nFletch screamed for me to stop. “No, no! It’s not stable!”\n\nCold water sucks the heat from your body thirty-two times faster than air. Every second Kerry stayed in that water increased the likelihood her arms and legs would go numb and she wouldn’t be able to pull herself out of the water even if the ice stopped breaking.\n\nLaying on my stomach to spread as much of my weight across the surface as I could, I dragged myself out to the water’s edge.\n\n“Grab on!” I held onto the shoulder strap and tossed my duffel bag into the water as close to Kerry as I could.\n\nHer hands fumbled, already rendered useless from the heat loss, but she managed to wrap her arms tight around the bulk of the bag.\n\nI pulled her up to the edge. She got most of her body out of the water before the ice cracked, and she fell back in, almost taking me with her.\n\nStrong hands grabbed my ankles and pulled me away from the hole.\n\n“Fuck, fuck, fuck,” Fletch grunted as he struggled for traction on the ice.\n\nI don’t know how he did it, but Fletch managed to get enough of a purchase that we were able to drag Kerry out of the water.\n\nScary Kerry was white as a bone and panting for breath through chattering teeth. She struggled to get to her hands and knees.\n\n“We’ve got to get her out of here,” Fletch said.\n\nThe pull of the bells had been broken. What the fuck had we been thinking?\n\n“Bring the car around. We’ll meet you.” The car was easily two miles away.\n\nFletch nodded and was off, shuffling his feet across the ice as quickly as he could.\n\nI was afraid to stand too close to Kerry out on the ice, but what choice did I have? She was still struggling just to crawl.\n\nI grabbed her by her ankles and dragged her across until we were far enough away from the hole that I felt comfortable enough to pull her to her feet.\n\nAnd still the ice went “cuh...cuh...cuh...” as I watched Fletch slip out of sight behind the trees. It didn’t sound gentle anymore.\n\nI put her arm over my shoulder. We shuffled along best we could. Each time one of us slipped, I thought the ice had given out again. My heart would race and I’d think, “This is it. This is how I’m gonna die,” but instead we would just be slammed down against the rock-hard surface.\n\nKerry followed my instructions. She didn’t seem confused, but she wasn’t talking either. By the time we’d reached the access road, her lips had turned pale blue and the water in her hair had frozen.\n\nAt the fork on Old Ware-Enfield road, I insisted that we trade jackets and I gave her my hat and gloves, one of which was wet from pulling her out of the water, but I figured it was better than nothing.\n\nKerry fumbled and struggled to get out of her jacket. We had to stop walking so I could help her with the zipper. She fought me as I tried to get my hat over her enormous head and with slurred speech complained that she was hot.\n\nI knew what that meant. Kerry was in trouble. If I had had a cell phone back then I’d have bitten the bullet and called her an ambulance, but I didn’t get my first cell phone until 2001.\n\nI made Kerry run the rest of the way, even though she moved like a drunk in an old cartoon.\n\nFletch saw us approaching the gate and, leaving the engine running, ran out to meet us.  \n\n“How is she?” he asked, putting her arm over his shoulder.\n\n“We need to get her to a hospital.” Fletch and I were moving as quick as we could while dragging Kerry along between us.\n\n“Do you know any around here?”\n\n“You don’t know where the hospital is?” I screamed as we got into the car.\n\n“Why the fuck would I know where the nearest hospital in Western Massachusetts is?”\n\nFletch put the car in drive and started heading towards Amherst, figuring they’d have a hospital there and we’d see signs for it on Route 9. Had we gone the other way, back towards Nashua, we’d have been at a hospital in eleven minutes. Unfortunately, the way we chose, the nearest hospital was in North Hampton, over an hour away.\n\nEven with the heat on full blast the car was freezing, and practically as soon as the doors closed Kerry started stripping out of her clothes.\n\n“You gotta get back there with her,” Fletch said.\n\nHe was right. Before our week-long winter hike, our instructor-chaperones taught us what to do in the event that someone displayed any signs of hypothermia. You get them out of their wet clothes, you strip down and you get into a sleeping bag with them. It’s called passive rewarming, and Kerry clearly needed it.\n\nI crawled over the emergency brake into the back seat with the half-naked Scary Kerry. She didn’t fight me or complain about being warm, but it was difficult to get close to her. She had wedged herself down on the floor, mostly behind the passenger’s seat, a space I would have never imagined could accommodate me, let alone both of us.\n\n“You got a blanket back here or anything?” I said, looking around in the mess and clutter that Kerry sat on top of.\n\n“No, but hang on.” Fletch wrestled himself out of his jacket while he drove. It occurred to me that I could use the uninflated raft as a blanket, but when I looked for my duffel bag I realized I must have dropped it somewhere between the reservoir and the car. Fletch threw his jacket back to me. It’d have to do.\n\nI stripped down to my underwear. Scary Kerry was completely unresponsive. I did my best to move her into a position where could I lay next to her and draped Fletch’s jacket over my shoulders and mine over our legs before spreading myself across her corpulent belly.\n\nI’d like to say I spent the next hour concerned only for the well-being of my friend, but that’s not true. A million thoughts ran through my head.\n\nYes, I did think about Kerry. I thought she already looked dead and hoped that at least some of her pale complexion was just the moonlight. I noticed how slow her breathing was. I could barely feel her cold gut moving at all.\n\nBut I also thought about Rob and the rumor I’d repeated when I was in the sixth grade. The one about how he’d been found naked in the woods with a mentally handicapped girl. I thought about how everyone said he’d tricked her into sleeping with him. And even as my friend lay beneath me, for all I knew dying, there was a small part of me that was thankful we were so far away from home and nobody would hear about this.\n\nShortly before one-thirty in the morning we pulled up in front of the emergency room at Cooley Dickinson Hospital. Fletch got out of the car and ran for help.\n\nKerry was unconscious when a pair of nurses or orderlies or whatever they were pulled her out of the car and put her on a stretcher. When they asked me, I couldn’t remember the last time I’d checked to see if she was still breathing. It had been a few minutes. At least.\n\nThey couldn’t find a pulse.\n\n\n\nFletch and I were forced to stay in the waiting room. We couldn’t do anything else for her. Kerry was in their hands now. In a way that was worse. At least for us. When we were in the car we had a goal, something to focus on. We had to get Kerry to a hospital. Once we’d arrived, the adrenaline that had been coursing through our veins returned to whence it came and left us with nothing but doubts.\n\nCould we have done more? Had we been fast enough?\n\n“She’ll be fine. She’ll be fine.” Fletch rocked back and forth in his chair, repeating his little mantra as if he could will it to be so. “She’ll be fine. She’ll be fine.”\n\nIt was over an hour before we were able to get an update. Kerry had survived, but only just. When they initially checked her vitals, Kerry’s core temperature had fallen to 64 degrees Fahrenheit and her heart rate had slowed to 29 beats per minute. For a girl Kerry’s age and size, you’d expect her resting heart rate to be in the neighborhood of 74 beats per minute.  \n\nThe emergency room doctor felt Kerry’s hypothermia was too severe for external warming techniques and elected to irrigate Kerry’s stomach and colon with warm saline solution. Every fifteen minutes, the saline, by then cold, had to be pumped out and replaced with more warm saline.\n\nWe had hoped we’d be able to see her, but at that point, they’d only managed to raise her body temperature about 4 degrees and Kerry was still unconscious. She also had third- or fourth-degree frostbite on several of her fingers and toes and one of her ankles, but they wouldn’t have to worry about that tonight. There’s a saying about frostbite: Frozen in January, amputated in July.\n\nThe nurse, a young, homely woman, looked at us like we were criminals. I guess she blamed us for the state Kerry was in. Even now, I’m not sure she was wrong. “Is there someone your friend would want us to contact?”\n\nHer mom.\n\n“Yeah,” I said. “I’ll do it. Payphone?”\n\n“Follow me.”\n\nThe nurse turned and led me back to the admittance desk. It’s funny, as scared as I was that my friend’s life was still in serious jeopardy, somehow I was also scared to be in trouble with her mom, and by extension mine. What can I say? I lacked perspective and the enormity of the situation hadn’t fully sunk in. The nurse let me use one of the hospital’s phones.\n\n“What! What do you want? Why are you calling my house at three fucking o’clock in the morning?” Mrs. Peterson screamed into the phone.\n\n“Kerry’s been in an accident.”\n\n“What are you talking about? Kerry’s asleep. She’s…hold on, Kerry! Kerry!”\n\nI could hear Mrs. Peterson lumbering through her house and bellowing for her daughter. She certainly had her faults, but lacking affection for daughter wasn’t one of them. I’d often suspected that Mrs. Peterson had been one of those sad sacks who had known their marriage wasn’t going to last and insisted on having a kid anyway, not to save the marriage but just to have one person in the world that loved them unconditionally.\n\n“What happened? Where is she?”\n\nAll I told her was that her daughter had fallen through some ice. Nothing else. And emphasized at every turn that she was alive and being cared for, which was true. But I also promised that she’d be fine. It was a promise I had no business making. I just couldn’t stomach hearing the hurt in her voice. I would have said anything to make Mrs. Peterson feel better.\n\nI handed the phone back to the homely nurse so that she could give Mrs. Peterson directions to the hospital.\n\nTwo and a half hours later, Ecto-1’s tires screeched to stop in the parking lot.\n\n“My daughter! Where is she?” I could hear her even before she was through the doors.\n\nIf the kids at school thought Kerry was frightening to behold, it was only because they’d never seen her mother upset. Mrs. Peterson ran up to the admittance desk wearing her jacket over her bathrobe, the sweatpants she slept in peeking out over her snow boots. Her face was red and puffy from crying and her hair looked not just uncombed but as if someone had tied it in knots and then dipped it in grease. By comparison, the homely nurse looked like Helen of Troy.\n\n“She’s my daughter! You have to let me see her!” Mrs. Peterson said, pounding the desk in front of her. Being a mother was the reason Mrs. Peterson got out of bed in the morning. It was the reason she worked a thankless, poorly paying job. And it was the reason she wasn’t about to let anyone keep her from being there for her daughter.\n\nFletch and I jogged the short distance down the hall from the waiting room. The hospital staff was looking nervously at Mrs. Peterson’s red face and bulging veins. A pair of nurses moved in close behind the homely nurse to support her.\n\n“You can’t see her until she’s been stabilized,” the nurse said, her voice quivering.\n\nMrs. Peterson let out an inarticulate scream that shook her whole body. It was a desperate noise that sounded like a wounded animal.\n\nThe homely nurse flinched, Fletch took an involuntary step back, and one of the other nurses peeled off from the pack and ran down the hall, probably to get security. She needn’t have bothered. After her scream, Mrs. Peterson collapsed to the floor in tears.  \n\nI laid my hand on her shoulder and gave her a gentle shake. Mrs. Peterson looked up and saw that it was me. I thought for a moment I’d receive the same treatment as the nurses. Instead, she pulled me down on top of her and hugged me, clinging to me like I was life itself.\n\nMrs. Peterson buried her face in my shoulder and cried. I wished she had yelled at me, and not just because my face was pressed into her hair, which smelled of sweat, deli meats, and feta cheese. I’d nearly gotten her daughter killed. I didn’t deserve to be embraced like a member of the family. And something about the way Mrs. Peterson so desperately held me reminded me of the trip her daughter and I had taken to Greenfield.\n\nI had been reckless with Kerry in so many ways.\n\nFletch helped the two of us to our feet and we led Mrs. Peterson back to the waiting room.\n\n\n\nWe stopped at a McDonald’s on the way home, but neither of us could bring ourselves to eat anything. Fletch and I had stayed at the hospital until nearly 10am; by that time Kerry’s temperature had returned to normal but at no point had she regained consciousness.\n\nWe would have stayed longer, but we’d been awake for nearly 24 hours at that point and our bodies were beginning to shut down. I left Mrs. Peterson my parents’ number and told her to call me if she needed anything. She took it and thanked me for “watching over” her little girl.\n\nSitting beneath the fluorescent lights, waiting for Fletch to finish his coffee, I felt like Judas minus the silver. I should have stayed at the hospital. But I copped out. I couldn’t stand Mrs. Peterson being nice to me.\n\n“I never should have brought you.” It was the first thing Fletch had said in hours.\n\n“We’d have gone anyway,” I said, smearing ketchup around my tray with my hashbrown so I wouldn’t have to look him in the eyes. “We’d have gone, she’d have fallen, and you wouldn’t have been there to pull her out. I could have driven or I could have tried to warm her, but I couldn’t have done both.”\n\nFletch didn’t respond. I guess he still felt like it was his fault.\n\n“She’d be dead right now, Fletch. Me too, probably.”\n\nI hazarded a glance up and wished I hadn’t. He was giving me the same look I had given Mrs. Peterson an hour earlier when she thanked me for watching over Kerry. Neither of us were ready to be forgiven yet.\n\n“Well,” he said, “we should have left after we heard those fucking bells.”\n\nI couldn’t argue with him there.\n\nFletch finished his coffee in silence. After he was done, neither of us moved to get up. It was probably around 10:30 or so at that point, and neither of us had called our parents. We knew we should have found the nearest payphone. We knew we couldn’t hide what had happened. We couldn’t lie. At least not about Kerry. But even if it was only for a couple of hours, we wanted to push that eventuality off for as long as possible. Our parents would know soon enough.\n\nWe got back in the car and rolled down the windows, hoping the cold air would help keep Fletch awake long enough for the coffee to kick in. Fletch stopped for the light at the intersection of Amherst Road and the Daniel Shays Highway. We needed to go left which would take us North towards New Hampshire, but Fletch hadn’t hit his blinker yet.\n\n“Can I tell you something?” Fletch had struggled to get out each word.\n\n“Yeah.”\n\n“A part of me wants to go back. I want to hear them again.”\n\nSo did I. All we’d have to do is go right.\n\n“Do you...if we did, do you think we could get there by eleven?” I asked.\n\nThe light changed. We didn’t move until the car behind us started honking. Fletch hit the blinker. We went left. My cheeks burned with shame.\n\n“We probably wouldn’t have made it in time,” I said.\n\n“We can’t. We can’t. We can’t go back there. Not ever.”\n\n“No. Never.” But even as I said it, I knew I would. The bells felt like home.\n\n\nContinued in",
        "url": "http://www.reddit.com/r/nosleep/comments/1ocx7o/series_the_spire_in_the_woods_part_5/",
        "title": "[Series] The Spire in the Woods Part 5"
    },
    {
        "body": "My parents woke up on the morning of December 28th, 1999 to a quiet house. Nothing unusual about that, they were typically the first ones up. My mother made coffee and my father turned on CNN and got on the treadmill. My brother woke up next and my mother made him french toast. She made some for me as well, figuring I could reheat it whenever I came down.\n\nIt was a couple of hours before my absence was felt. No big deal. They figured it was vacation. They might as well let me sleep in.\n\nThen, around 11 o’clock they got a call from Mr. Fletcher. He was in a bad mood.\n\n“Did Nathan stay over at your house last night?”\n\n“I don’t think so.”\n\n“Well, if he did, wake his ass up and tell him he’s in trouble.”\n\nMy mom covered the receiver with her hand and hollered for my dad to go wake me up. That’s when they found out I was missing.\n\nWhen Fletch and I showed up in the driveway two hours later, I’d say my parents were more annoyed than angry. My parents weren’t strict disciplinarians. I’d slept over at Drew DeLuca’s without consulting them on more than one occasion, and while they were never exactly thrilled with me, they trusted my judgment and preferred letting me exercise that judgment to being woken up by a late-night phone call looking for their permission. When they found my bed empty, they had figured we’d stayed up late playing video games or, at worst, watching Skin-e-max movies, over at some friend's or another's, and were just too tired to drive home.\n\nFletch’s parents weren’t so understanding. They’d called everyone Fletch was friends with, then called my parents looking for the names of my friends.\n\n“Nathan, you better get your butt home,” my dad said. Then he held his thumb and forefinger up about an inch apart and added, “Your dad sounds like he's about this close to going through the phone book in alphabetical order looking for you.”\n\nHe was trying to be funny, but Fletch and I weren’t in much of a mood to laugh. We exchanged one last tired look, both knowing things were going to get worse before they got any better, and parted ways.\n\nI stood on the front steps of my house with my father watching Fletch drive off down the road.\n\n“Boy, am I glad I’m not him right now,” my dad said.\n\nHe didn’t know the half of it.\n\n“Dad, we, uh...I have to tell you something.”\n\n\n\nThey didn’t yell and they didn’t scream, but the days of my parents trusting my judgment were over. I had stayed out all night without permission, driven deep into another state, and gone out onto unfamiliar, recently frozen ice, in the middle of the night.\n\n“That was stupid. That was so stupid.” My father got up from the table and headed for the phone. He’d never been good at sitting still when he was agitated.\n\n“Why were you even in Amherst?” my mother asked.\n\n“We wanted to visit Sam,” I mumbled. I’d never been a particularly good liar, but Fletch and I had agreed to leave Rob’s suicide notes and the Spire in the Woods out of our story. Fletch was convinced that if his dad caught even the faintest whiff that his son believed in ghost stories, he’d be stuck on meds as fast as the nearest psychiatrist could write the proscription.\n\nMy mom stared straight at me. I couldn’t hold her gaze and pretended to be interested in the french toast she’d reheated for me.\n\n“That could have been you. Do you understand? That could have been you that fell through that ice. And with no one around...” My mom was too choked up to finish her thought. I wanted to comfort her but I didn’t want her to look at me.\n\n“Yes, you have a patient there named Kerry...” My dad stuck the phone under his chin and asked, “What’s Kerry’s last name?”\n\nWhile my dad was concerned for Kerry he was also motivated by self-interest. I could hear it in his voice. He had spent the first ten years of his career working in litigation at the law firm of Ropes & Gray and believed in the importance of CYA. Covering Your Ass. It didn’t matter how slim the chances were that Mrs. Peterson would attempt to hold our family (or the Fletchers) accountable for what happened to her daughter— that risk was unacceptable.\n\n“If you need any help,” he said, once he’d gotten Mrs. Peterson on the phone, “you know, around the house, driving Kerry to school...” He was feeling her out. Trying to get a sense of whether or not Mrs. Peterson blamed us for what had happened to her daughter. “Maybe dealing with the insurance company, or hell, I don’t know, if you need a little help with the medical bills. Whatever you need. Just say the word.”\n\nHe also wanted to dangle that carrot. He knew Mrs. Peterson wouldn’t be able to cover Kerry’s emergency medical care out of pocket, and he doubted slicing meat at the deli counter in Market Basket conferred with it amazing health insurance. Mrs. Peterson would need help, but it would come with strings attached.\n\nLooking back at my father’s actions, they seem cold, and maybe they were; but isn’t protecting their kids what good fathers do? Don’t they protect their children even when their children don’t particularly want to be protected? Had Mrs. Peterson a vengeful bone in her body, I’d have deserved the brunt of everything she could muster.\n\n\n\nDespite my exhaustion, I had trouble falling asleep. I kept thinking about Kerry. She was in the hospital and it was my fault. I hadn’t talked her into anything, but I had involved her. I’d brought her along and now she was the one lying in a hospital bed with her mother crying over her.\n\nAs a Catholic, you’re taught that God created us as rational beings. You’re taught that He gave us the dignity to initiate and control our own actions. That He imbued us with the ability to hold our own counsel so that we may choose our own paths***, and that we alone are responsible for the fruit that our choices bear.\n\nI didn’t believe that everything was part of a plan, and the people that did, the people who saw God’s hand in every mundane, earthly event, from athletes who credit Jesus for their ability to hit a curveball, to teenagers invoking the name of the Lord to secure a date on a Saturday night, drove me crazy. I had never accepted predestination. How could we have free will if, like clockwork, everything was preordained to happen?\n\nI believed these things. I did. But lying there, thinking of the Petersons, I couldn’t stop myself from wondering if God was teaching me a lesson. I’d been taught that God doesn’t cause car accidents or tornadoes, but in that moment, I felt that God had broken the ice beneath Kerry’s feet to punish me for both doubting His existence and having stolen a glimpse of the secret knowledge no one but God was meant to have.\n\nI cried and whispered Hail Marys and Our Fathers to myself until I was finally overtaken by exhaustion.\n\n\n\nDim light filtered in through my blinds. The windows in my room faced south and in my semiconscious state, I wasn’t sure if the sun was rising or setting. My stomach growled, but I couldn’t bring myself to get out of bed and face my parents.  \n\nThe bells tolled.\n\nI sat bolt upright in my bed. The room was still and silent and yet I could hear the bells as they continued to call out the hour. Two...three...they were beautiful, but I didn’t lose myself in them as I had on the shore of the Quabbin. Four... They sounded like a song stuck in your head.\n\nFive... They stopped. I was still lying in bed. Either I had never sat up or had lain back down without realizing it.\n\nHad I heard them, or had I remembered them?  At the reservoir, we’d heard them toll eleven. Had it just been a dream? I sat up for what may have been the second time, and looked at my clock. It was five.\n\nIn the past two days I’d only slept for three hours, but I couldn’t handle being alone in the dark. I went downstairs and spent the rest of the night studiously avoiding eye contact with my family.\n\nThankfully, I didn’t hear the bells again that night.\n\n\n\nThe next morning, bright and early, my father drove me over to Kerry’s house. My parents had put together a care package for Mrs. Peterson, a large basket filled with food so she wouldn’t have to cook, gift cards from our local gas station to offset the back-and-forth to the hospital each day, and a few books to read in the waiting room.\n\nWhen she opened the door, Mrs. Peterson was so grateful that she cried. Once she’d regained her composure, the two of us got into Ecto-1 and headed out on the two-and-a-half hour drive to Cooley Dickinson Hospital. My dad had volunteered me to go and keep Mrs. Peterson company. He may have had an ulterior motive, but this was something I wanted to do. Something I had to do.\n\nThe drive was awkward. Under the best of circumstances, as a teenager, spending time alone with one of your friends’ parents was always a little uncomfortable and these were far from the best of circumstances. As I learned on the drive, Kerry was in a coma.\n\nAlthough Mrs. Peterson got virtually none of the medical terms correct— her only real exposure to medicine came from have watched a lot of ER— I managed to get the gist of what she was saying. As Kerry’s heart rate slowed, so had her breathing. Her blood had failed to supply her brain with the oxygen it needed to run. And it was this lack of oxygen that probably contributed more to Kerry’s blue coloration than her body temperature.\n\nThe doctors had given Mrs. Peterson only one tiny piece of good news. Because hypothermia lowers a body’s metabolism, it reduced the likelihood that the oxygen deprivation had damaged Kerry’s brain. That was it. That was what we were pinning all our hopes on. That the cold which nearly killed her had also slowed her brain down enough that it hadn’t noticed it was suffocating.\n\nWhen we arrived at the hospital, Kerry’s mom led me to her new room. I could tell from the looks the staff was giving her along the way that Mrs. Peterson was not their favorite person. Maybe she’d been a pain in the ass the day before, but I didn’t feel like that was it, not exactly. The nurses were giving Mrs. Peterson the same looks the kids at school gave her daughter.\n\nIn movies and television, people frequently comment on how peaceful coma patients appear. They say, “it’s like they’re asleep,” “they look like an angel,” or “it reminds me of when they were a baby, and I used to hold them.” I don’t know if that was Mrs. Peterson’s impression, but it certainly wasn’t mine.\n\nOrdinarily, Kerry wore a lot of concealer to cover up her acne. At some point between plunging beneath the ice and having saline pumped in and out of her stomach, most of it had disappeared. She had a tube running into her nose, though I’m not sure why; a heart rate monitor on her finger; and an IV in her arm. And that was to say nothing of the frostbite.\n\nAlong with the big toe on her right foot and most of her left foot below the ankle, which we couldn’t see beneath the blanket, ice crystals had formed in two fingers on her left hand and the thumb on her right. The blood trapped in her fingers swelled them almost to the same thickness as her wrists. They were red and raw. It was difficult not to stare at them.\n\nMrs. Peterson believed that even in a coma, Kerry could hear us and proceeded to relive seemingly every moment of her daughter’s life. Mrs. Peterson was not a gifted storyteller. In her mind, nothing was too trivial, from the time she ‘caught’ Kerry washing the dishes with cold water, which is apparently something you shouldn’t do, to the time they went to Applebee’s for her birthday and both forgot to tell the server, then wondered why they didn’t get any cake.\n\nBut what her stories lacked in content, Mrs. Peterson made up for in sentiment. She couldn’t touch Kerry’s hands, so she held her daughter’s upper arm as she spoke.\n\n“I’m sorry I’m not home more. I’d like to be. I would. I know how hard school’s been for ya, maybe it’d have been easier if I was home more. I dunno. But you’ve done so good, baby. And college is right there.”\n\nIf Kerry was able to hear her mother, it wasn’t outwardly apparent. Her face didn’t twitch, her eyelids didn’t flutter, even her pulse on the heart rate monitor held steady.\n\n“Remember in middle school? You...you never thought...” As Mrs. Peterson began to break down, she grabbed my wrist and pulled me to her daughter’s bedside. Forcing my hands to replace hers on Kerry’s arm. “You never thought you’d get a boy to like you, but look who’s here.”\n\nMy cheeks burned. I didn’t know if Kerry had told her mother we were dating or if Mrs. Peterson had just gotten the wrong idea about us, but either way I couldn’t correct her. Not there. I had had enough trouble rejecting Kerry when we were alone in Greenfield. The thought of rejecting her again, this time in front of her mother, and stealing from Mrs. Peterson whatever sense of pride she derived from her daughter having a romantic life, was more than I could bear. There’s a special place in hell for people who humiliate children in front of their parents.\n\nI was very aware of my hands resting on her arms. She was so much warmer than the last time I had touched her. I’ve never been quick on my feet. I had no idea what to say, especially with Mrs. Peterson thinking I was Kerry’s, what? Boyfriend?\n\nI took a page out of Mrs. Peterson’s playbook, and stood over  my unconscious friend and recounted meeting her on the hike and a few anecdotes from class. I tried to muster up something more sentimental, but it wasn’t until I pretended it was Alina laying there in front of me that any words came. “I can’t stop thinking about you. I wish we could talk. I’d do anything to make you better.”\n\nLost in the little scene I had created for myself, I leaned down and kissed Kerry’s waxy forehead.  \n\nMrs. Peterson put her arms around me and squeezed. I looked at the tears in her eyes and wondered if I’d done her a kindness by playing along. The lie seemed harmless enough. Kerry probably just wanted to save face with her mom. Maybe make her proud. Let her think her child was happy, for a change. But eventually the truth would come out. I wasn’t attracted to Kerry. It’d be nice if I was, but I wasn’t.\n\nI also resented being blindsided. If Kerry had asked my permission, had said, ‘look, this is embarrassing, especially after Greenfield, but I need your help making my mom happy. Is it OK if I tell her you’re my boyfriend?’ I might have said yes. But she hadn’t.\n\nThe whole charade made me feel gross.\n\n\n\nAlina’s family returned from Shawnee the following morning. I would have liked to have been outside their house waiting for her when they arrived, but I was still a month away from getting my driver’s license and my parents weren’t exactly in the mood to help advance my social life.\n\nI left a message on the Aminev’s machine in the morning around ten. I called again at noon and one, but hung up both times before the machine began recording. It was the strange poker game you play when you’re in love for the first time. You feel like you’ll die if you don’t speak to the object of your affection as soon as possible, but you know how crazy you’d seem if you filled up their answering machine with increasingly redundant messages.\n\nThat afternoon felt like an eternity.\n\nShe called me back shortly after five, and even though I was sitting directly next to the phone, I let it ring twice so she wouldn’t know I’d been sitting directly next to the phone.\n\n“I missed you,” I said.\n\n“Oh...thanks.” She sounded tired. Maybe she hadn’t gotten that much sleep before driving home, or maybe she was drained from therapy. Either way, it wasn’t exactly the reaction I was hoping for.\n\nI wasn’t sure what I wanted to tell her about my trip to the Quabbin, or, rather, I wasn’t sure how to tell her. The whole idea of going was to alleviate her guilt. Having heard the bells, I knew that the story was at least partially true. There was more to the Spire in the Woods than the side effects of an anti-depressant. But I also knew that Alina wouldn’t take the news of Kerry very well. For that matter, I wasn’t taking it all that great either.\n\n“How was Maine?”\n\n“Too short. I’m trying to convince my parents to drive us back up, if not tonight then tomorrow, but my dad’s sick of driving.”\n\n“Mmh.” I wanted to tell her everything, but it had to be face to face. If she took it hard I couldn’t comfort her from halfway across town. Not properly.\n\nThere was a long silence as I weighed my options. When she broke the silence, her voice sounded small and young and distant.\n\n“Did you...did you find the Widower’s Clock?”\n\n“I...uh...do you think you could come over tonight? After my parents go to sleep?”\n\nThere was another silence, though not as long as the last one.\n\n“Why?”\n\n“It’s, well, it’s not really the sort of thing you tell someone over the phone.”\n\n\n\nI stood by my window looking out at the front lawn, its yellow grass illuminated by a couple of our tackier Christmas decorations. The wind shook the dead branches of the tree that grew next to our driveway. Something about the scene reminded me of the Quabbin and the sound the ice makes when it’s quiet. Cuh...cuh...cuh...\n\nIt was nearly midnight, and I wondered if Kerry would dream of the bells. Being in a coma might not be so bad if they sounded as lovely in sleep as they did in real life. There have been times in my past when I’ve been lonely, and considered the virtue of trading the world for a lifetime of dreams.\n\nToday, I’d make that trade in a heartbeat if it meant never hearing the bells again.\n\nHeadlights flashed into my window, interrupting my thoughts, as Alina pulled her little Beetle into my driveway. I crept downstairs to meet her. Despite everything that had happened in the last couple of days, I couldn’t help but feel excited.\n\nShe was shivering when I opened the door and didn’t appear to have showered that day, but she looked so beautiful, framed as she was by the Christmas lights surrounding our door, and with the porch light behind her head casting a glow around her. It was like she was separated from everything dark and dead outside.  \n\nI hugged her. She hadn’t worn a jacket, just the sweats she probably slept in during the winter. She stood stiffly as I rubbed her back and arms in an effort to warm her up. I figured she was nervous about what I’d tell her but was still disappointed she hadn’t greeted me more enthusiastically.\n\nI led her into the kitchen and set about making us a couple of mugs of instant hot chocolate. Alina leaned against the island behind me, but that didn’t last for very long. Before I’d even gotten the mugs into the microwave, she was pacing and chewing nervously at her lower lip.\n\n“So what happened?” she asked.\n\nI handed her a mug.\n\n“Do you wanna sit?”\n\n“No, no, I sat enough today.”\n\nI brought her into the den, which was further away from my parents’ bedroom. The embers in my father’s woodstove still glowed brightly and I added a couple of small pieces of kindling.\n\n“Please. Please tell me what you found?”\n\nI told her. I told her everything. How cold it was. What Kerry and Fletch had been like. What the smell of the smoke reminded me of. I told her about the sound the ice made...and I told her about the bells.\n\n“They were heavenly. But...it...it wasn’t just the sound. They fed something inside me. You know that part of you, that voice in your head that kinda experiences what’s happening and sees through your eyes?” She was looking at me as I spoke, and I could almost see the part of her I was talking about behind her eyes.  \n\n“Like the soul or whatever,” I continued. “It was like the bells enveloped it and gave it everything it ever wanted. Everything that it was missing. For me, it was you.”\n\nIt was a bit embarrassing, describing to her how the bells had reminded me what it felt like to lie beneath her, but how else could I have conveyed the contentment in their presence and the need in their absence? The bliss and the longing.\n\nIt was romantic too, I thought. What could be more flattering for Alina to hear than my admission that my purest desire was to lie close to her, to feel her body against mine? That it quieted my soul. But she didn’t react as though she were flattered.\n\nAlina stared straight into the stove at the flames consuming the wood and said nothing. It took me a moment to realize what she was probably thinking. She was also what Rob heard in the bells, what quieted his soul. She was his bliss and longing.\n\nEven if she never wanted to be.\n\nWe sat in silence for a long time and watched the wood burn. Then I told her about how we had pressed on. And about what happened to Kerry.\n\nEven though it wasn’t her fault, I knew Alina would blame herself for Kerry falling through the ice, just like she had blamed herself for Rob’s suicide. It was the sort of negative feedback loop a person gets into when they’re depressed. Everything's their fault. What I hadn’t considered was how much I’d blamed myself.\n\nBeyond answering a few of my parents’ questions about how Mrs. Peterson was doing, I hadn’t told anyone about my return trip to the hospital. For that matter, I hadn’t really told anyone how I felt seeing Kerry turning blue, or struggling to warm her up on the floor of Fletch’s car. Telling Alina about it opened up the floodgates inside me.\n\nAlina let me speak until I couldn’t get any more words out. Then she slid along the couch to my side, wrapped me in her arms and held me like a child. For a moment I felt ashamed. I had never judged other guys for crying, I had sat beside Fletch when he was overcome by grief, but this was different. Kerry hadn’t died. And I was with Alina, who I wanted more than anything to think of me as a man.\n\nI felt so small.\n\nShe ran her hand up and down my back. Little by little, I became more aware of her and her closeness to me than I was of my emotions. My face was cradled against her neck. My cheek brushed hers as I moved to look up at her. Her eyes looked as though she had been crying too.\n\nI kissed her and it was like the first time, with her lips slow to respond. Slowly, we inched our way back onto the couch until I was lying on top of her. It felt like the bells.\n\nMy hand traced its way down her arms and over her shirt. My pulse beat faster than it ever had before. I was acutely aware of my body, how it felt, where it was in relation to Alina’s, but had lost all conscious thought, aware of nothing but touch and pulse.\n\nI slid my hands beneath her clothes. She didn’t stop me. Her sweatpants came down easily. She trembled. She was nervous. So was I.\n\nMy hands shook as I took my own pants down. I’d never exposed myself to anyone. Her face was inscrutable.\n\nI don’t feel right describing the details of her body. We were kids then. I’m an adult now. I didn’t know what I was doing then. I know now.\n\nIt was my first time. I don’t know if it was hers. We don’t exactly talk these days.\n\nIt was short and fumbling and awkward.\n\nBut I thought, at the time, that it was divine.\n\nAfterwards, I didn’t want her to leave, but she got dressed anyway. She was shaking as she pulled up her pants and crying by the time she reached the door. I thought maybe she was scared because we hadn’t used a condom, or that it was her survivors’ guilt. I was wrong.\n\n“Hey. Hey, you.” She was reluctant to let me hug her. “It’s OK,” I said. “We didn’t do anything wrong.”\n\nShe said yeah and ran her hand back through her wild hair, not to get it out of her face, but like you would if you didn’t know the answer on a test.\n\nAfter she left, I stood at the window for a long time staring out into the night at the place where her taillights had disappeared.\n\nI didn’t sleep easily that night. I felt like I should have been more excited than I was. A lifetime of coming-of-age movies and pop culture had led me to believe I’d feel somehow different about myself and the world, but I didn’t. The view from my bed looked exactly as it had the night before. Kerry was still in the hospital, and far from restoring Alina to her former self, consummating our relationship had left her as unhappy as ever.\n\nI tried to imagine a future with Alina, one where I made her as happy as she made me, but I only wound up thinking about the bells. Maybe she needed to hear them.\n\nI fell asleep shortly before three in the morning, which, unbeknownst to me, was almost exactly when Kerry woke up screaming.\n\n\n\nI’d love to tell you what Kerry’s first words were. Unfortunately, I can’t. When her heart had slowed down, an area of her brain located beneath her left temple hadn’t received enough oxygen. Essentially, she’d had a stroke which left her with a condition called ‘expressive aphasia.’ She could make sounds, that was no problem, and with effort she could say words, but she couldn’t form sentences.\n\nOf course Mrs. Peterson and I didn’t know that when she picked me up the morning of New Year’s Eve. All we knew was that Kerry was awake.\n\nMrs. Peterson shook with laughter as we drove down 495. She was going so fast I thought Ecto-1 was going to disintegrate, like one of those experimental jet planes you see in old stock footage.\n\nKerry’s mom, beaming with pride, clapped her hand down on my knee and said, “Boy, I will tell you, you got yourself one tough girl.”\n\nI smiled back at her, I honestly did. Thinking Kerry was essentially out of the woods, I was thrilled, but I didn’t know what else to say. Or maybe I was too busy worrying that now that she was awake, Kerry might not be quick enough on the uptake to figure out what was going on and her Mom would realize our ‘relationship’ was a lie.\n\nI wouldn’t have worried had I realized how sever Kerry's aphasia was.\n\nMrs. Peterson was humming arhythmically as we pulled into the parking lot. She walked into the hospital with a spring in her step. She looked at the nurses like they were old friends or comrades-in-arms, as if to say, “we’ve been through some rough times together, but now that’s all behind us and I couldn’t have made it without you!” but she couldn’t be bothered to stop and speak to any of them. The look in Mrs. Peterson’s eyes and the spring in her step lasted until we reached Kerry’s door.\n\n“Mom...boy...dad...arm...wrist...bad...wrist...wrist...mom...medicine...” Her speech was labored. I could see her struggling with each syllable.\n\nMrs. Peterson told me to “Go get a doctor.” In that simple sentence, I could literally hear the happiness drain from inside her. The woman who had practically skipped down the hospital’s corridors deflated as she took her place by her daughter’s side.\n\nI think what I feel the worst about, at least in regards to Kerry, I saw coming in that moment. In most regards, Mrs. Peterson wasn’t much of a person. She wasn’t smart and she didn’t have much of a sense of humor. She’d never been a great conversationalist or within a stone’s throw of attractive. She was dirt-poor and her personal hygiene left a lot to be desired. In most ways, she was society’s definition of a failure.\n\nBut there was an air of grace in the resigned way she stepped to her daughter’s bedside. Yes, what little light she had in her life seemed dimmer. All the hopes she’d had for her daughter had been snuffed out, but she wasn’t going anywhere. She was going to shoulder the load and give her daughter everything she could.\n\nI tell myself that, accident or no, Kerry and I would have drifted apart anyway during college. After all, even if her aphasia had fully dissipated, there’s no way we would have gone to the same school. But the truth is that, after that morning, I never could stand to be in the same room as Kerry. Every time she stammered, or shifted her weight on her crutches, it filled me with self-loathing. And I couldn’t take it.\n\nI went to the nurses’ station. They told me they’d have to call in a doctor with a background in neurology. About a half-hour or so later, Dr. Walsh stepped into Kerry’s room. I don’t remember much about him other than that he had silver hair and his bedside manner could be charitably described as ‘detached.’\n\n“Hospital...man...doctor...arm...bad...nurse...”\n\n“She wants another pain killer.” He said. “She’s probably going to lose that hand.”\n\nMrs. Peterson asked Dr. Walsh why her daughter couldn’t speak properly and he explained to us what they expected to find once they gave Kerry a CT scan. See, people always talk about how we don’t use more than two, or ten, or twelve percent of our brain, but that’s load of crap. We use all of it and because every part of the brain has certain tasks and functions associated with it, even a small injury can cause very serious and pronounced effects, like Kerry’s expressive aphasia. It didn’t effect any other aspect of her cognition. She probably even knew what she wanted to say, but she couldn’t get the words out.\n\n“Now, luckily,” Dr. Walsh said, “the brain is fairly elastic. So, given time, some of the undamaged area surrounding the affected region could compensate and she could regain her normal speech. Aphasia isn’t uncommon in stroke victims, and we often see a full recovery within a year.”\n\nThroughout our conversation with Dr. Walsh, Kerry would attempt to interject. If it seemed like she needed something or was asking a question, we would try to figure out what she was saying. Otherwise, Mrs. Peterson would just stroke her daughter’s hair until she settled back down. Mostly Kerry seemed concerned with pain from her frostbite, but just as Dr. Walsh was excusing himself, she said something, or shouted really, that made my hair stand on end.\n\n“Hear... hear...sounds...ring...ring...Ring! Ring! Ring! Ring! Ring! Ring! Ring! Ring!” Then she fell silent.\n\nMrs. Peterson looked up at Dr. Walsh. “What does she want?”\n\nDr. Walsh took out a small flashlight and shined it into Kerry’s eyes. Her pupils were unresponsive. “She may also have damaged her auditory cortex. We’ll know more once we can get her scanned.”\n\nI glanced down at my watch. It had just turned ten.\n\nContinued in",
        "url": "http://www.reddit.com/r/nosleep/comments/1oh7sz/series_the_spire_in_the_woods_part_6/",
        "title": "[series] The Spire in the Woods part 6"
    },
    {
        "body": "Most people have largely forgotten about all the hysteria surrounding the Y2K bug, and rightly so. It was a fundamentally silly concern. I’m not saying it was outside the realm of possibility that a few systems would crash or that there wouldn’t be a couple of automated billing issues, but an embarrassingly high percentage of the population believed, like my father, that it could cause a nuclear holocaust.\n\nWe’d been fighting about it since Thanksgiving.\n\n“That’s not how missiles work, dad.”\n\n“Oh, so you’re a nuclear technician now? All the control systems that launch our ICBMs are computerized. And they’re old computers. They’re not compliant. You don’t know what will happen.”\n\n“I know missiles don’t launch unless they’re told to. It’s not like they’re sitting around in their silos going, ‘Can I launch yet? Can I launch yet? Huh? Huh? How about now?’ and the computers are sitting there going, “No. No. No. Wait, what year is it? 1900? Crap, I haven’t been invented yet. Release the dogs of war!”\n\nI’d been fighting with my parents for weeks to let me go to Drew DeLuca’s New Year’s Eve party, but in addition to the imminent threat of thermonuclear war, they thought 15 was too young to stay out all night at a coed party. Originally, they had wanted to pick me up by ten. After I brought Alina home, my dad suddenly reversed his position. I could stay over at Drew’s.\n\nIn the past, I had always been at home when the ball dropped. Usually, my brother would fall asleep around 11 and my parents had long since outgrown the compulsion to make New Year’s Eve special. This usually left me alone with Dick Clark and my daydreams of having someone to kiss at midnight.\n\nOf course, that was all immaterial. There was no way Alina would turn up at DeLuca’s. And after finding out what had happened to Kerry, and having to tell my parents about it, well, I didn’t exactly feel like celebrating either.\n\nMy dad actually stayed up with me that year. He was convinced the power would go out at midnight. A part of me hoped he was right. Sure, it might have meant the end of the world, but at least it would have taken my mind off of how crappy I felt.\n\nAt midnight, the ball dropped. So many things had happened to me that year, so many things that I’d thought would make me feel happy or maybe just fulfilled, but the girl I loved was still miserable, one of my best friends had brain damage and there was nothing I could do for either one of them. The world was the same miserable place it’d been that morning. No more, no less.\n\nI tried calling Alina before I went to sleep but hung up when her dad answered. The next day we spoke only briefly. She seemed more distant than ever but assured me it was only because her parents were in the next room.\n\nAt my parents’ insistence, Mrs. Peterson joined us for a late dinner on her way back from the hospital. The dark wood surface of our dining room table was polished to a mirrored finish and Mrs. Peterson looked out of place sitting at it, her old T-shirt and stained khaki work pants reflected back up at her. My little brother was visibly uncomfortable to be sitting across from her. He had the same expression on his face as he had the first time we’d gone to a Sox game by ourselves and, heading back to Alewife, a homeless person had sat near us on the T.\n\nNone of us spoke much, but before leaving Mrs. Peterson did accept the name of a speech therapist my dad had tracked down from one of the partners at his firm earlier that day, and had agreed to let us help her pay for it.\n\nI knew he had ulterior motives, but I got the impression from the look in my dad’s eyes that he did really want to help. My dad’s a bit of a shark and I think that may have been the first time I’d ever seen him look at someone with pity.\n\n\n\nMonday morning I saw Fletch for the first time since Kerry had fallen through the ice. It had only been a week, but it felt like a lifetime. Fletch looked tired in a way you don’t often see in teenagers. He looked like my grandfather right before he decided he couldn’t take any more chemo. He looked beaten.\n\nIf he didn’t know already, I didn’t think he could handle an update on Kerry’s condition. We rode in silence.\n\nSchool was a torture. Everyone was laughing and smiling. They complained of being back from break but were eagerly catching up with friends, swapping stories about New Year's and Christmas, and commiserating about the lack of fresh powder anywhere on the East Coast that year. They had no idea Scary Kerry was lying in a hospital bed, practically unable to speak.\n\nAt least when Rob had killed himself, his death had been so public we all went through it together. With Kerry, aside from Kim Murray and Dan Burgen, Fletch and I were the only ones who even seemed to notice she was missing.\n\nIt’s lonely being miserable in a crowd of happy people.\n\nDrew teased me about having missed his party, but quickly realized I wasn’t in the mood.\n\n“You all right, dude?”\n\n“Not even close.”\n\n“You wanna talk about it?”\n\nShaking my head was all I could do without crying. Drew squeezed my shoulders in a half hug and then gave me some space by turning back to our group of friends. I disappeared wordlessly into the crowded hallway in search of the only person that could make me feel better.\n\nI found Alina right before the bell rang for first period. She was sitting against the lockers with Sara Cohen. I couldn’t hear what they were saying, but based on how quickly they stopped talking I got the impression it had been about me.\n\nAll I wanted to do was put my arms around Alina, to melt against her and bury my face in her shoulder. To lose myself, even if just for a second, in the sensation of holding her, but the bell rang before I could even get a word out and Sara dragged her off to class with scarcely a backwards glance.\n\nThe rest of the day crawled by in a meaningless cacophony of lecturing teachers and jabbering students. With each passing minute I felt like it was harder and harder to breathe. I spent the last period staring at the second hand of the clock, willing it to move faster until it struck three.\n\nThat’s when I heard them. The bells.\n\nOne...I was in my den, I was inside Alina...two...writhing against her, I felt as though I’d melt and explode all at the same time...three...I never wanted the chimes to end...\n\nBut they did. I was sitting in my desk, breathing hard. Everyone else around me was packing up their things. I took a moment to collect myself and followed suit.\n\nThey’d sounded as loud as they had from the shore of the Quabbin. As loud and as beautiful.\n\n\n\nThat Wednesday, Fletch and I were in a car accident. It was on the way to school. We were running a little late for some reason, although I don’t recall why. Fletch had slowed down the car to make the turn onto Cold Spring Road and then froze, letting the car drift into the trees on the side of the road.\n\nFor my part I was yelling, but he didn’t seem to notice for a full eight seconds. He just sat there, his foot lightly pressing the gas, his car pressed up against a grove of small pine trees, its wheels spinning up dirt and fallen needles.\n\nI didn’t need to ask what had happened. It was eight o’clock. He’d heard the bells.\n\nWhen he snapped out of it, Fletch was visibly shaken.\n\n“Oh, God! I’m sorry, I’m sorry! Are you all right?”\n\nI was fine. The only real damage was a crack in the front bumper and a bent sapling. We’d been lucky: if we’d been a few seconds earlier or later, it would have struck eight while Fletch was going thirty or forty down our winding streets, and the trees would have been a lot less forgiving.\n\n“Have you heard them? Since we were out there?” he asked.\n\n“Yeah. Twice. Kerry’s heard them too.”\n\n“I’ve heard them eight times. They keep getting louder.” Fletch shuddered. “Do you think this is what happened to Rob? The bells just kept ringing, kept getting louder and louder until he couldn’t take it anymore?”\n\nI didn’t. The bells were too beautiful, or so I thought at the time. I was actually a little jealous Fletch had heard them more times than I had.\n\nWe arrived after first period had already started, too late for me to have had any chance of seeing Alina that day. I hadn’t seen her all week and every time I called her house, it seemed like her father answered and I’d just missed her. Awfully social for someone who still ate all her lunches with the guidance counselors.\n\nAlthough in fairness to Alina, I got it. I found the general din of the classroom intolerable and the cafeteria even worse. Everyone else seemed so happy. So carefree.\n\n\n\nI’m not sure when exactly I began checking the time compulsively. It may have been the day Fletch went off the road. It may have been later in the week. Regardless, the time seemed to be the only thing I could focus on at school. Suddenly I was holding my breath whenever a new hour approached, each time hoping that I would hear the bells again.\n\nI remember thinking that it was funny: back before I knew for sure there was something lying beyond the realm of our senses, I’d always turned to prayer. And now, after years of seeking out the supernatural as a way of bolstering my faith, after having found the evidence that I was searching for, I found myself unable to complete so much as a simple Hail Mary without my thoughts straying to the sublime beauty of the bells.\n\nI guess it was foolish of me to think that finding the Widower’s Clock would reaffirm my Catholic faith. I still didn’t know if there was a God. All I knew for sure was that there were the bells and the bells were housed in a spire in the woods on an island in a reservoir just a car ride away. And I’d be getting my driver’s license in a little over a week.\n\nI tried to dispel thoughts of returning to the Quabbin, but the unhappier I was at school, the more I longed to return.\n\n\n\nThere was no question Alina was avoiding me. I kept trying to call her and kept getting her parents. I didn’t want them to think I was a pest, so I tried to keep my calls down to one a day, but it was so hard. I took to calling and hanging up if she didn’t answer.\n\nPathetic. I know. But I couldn’t help myself. We were taught in Sunday School that hell’s worst torture is how exquisitely your soul feels the absence of God; if that’s true, surely a teenager’s worst torture is how exquisitely they feel the absence of their first love. Especially when it’s a rejection.\n\nThe dirty looks started on Tuesday the 11th, just over a week after we’d come back from break. I’d gone looking for Alina in the juniors’ hallway, same as I had every morning, and there was Sara Cohen, looking at me like I was filth incarnate. It stopped me dead in my tracks.\n\nI didn’t know Sara very well, but she’d always seemed so friendly. Seeing that disgust directed at me...it was shocking. I wasn’t real popular, but I had never elicited that sort of reaction. Mostly, at school, away from my handful of friends, I was invisible.\n\nThe next day at lunch I noticed it wasn’t just Sara. When I went up to get my food, I noticed that the whole table of sporty girls that Alina used to sit with before Rob’s suicide were staring at me. It was the sort of reaction I’d seen people have to Scary Kerry, like they simply didn’t want me to be there.\n\nWhile I didn’t know any of these girls especially well, I had met one or two of them through Kristy and thought we were on good terms. I tried giving them a smile and tilting my head back in that, “hey” gesture. Some turned away quickly; a few of the others pursed their lips in an expression I couldn’t read. After that I noticed they kept looking over at me throughout the rest of the lunch period. I picked at my tray for a while, then left without eating.\n\nI missed feeling invisible.\n\nI tried calling Alina again that night. I knew I wouldn’t like hearing whatever it was she had to say, but I had to hear it. Her answering machine picked up. I thought about leaving a message, but didn’t see the point.\n\nHow could she treat me like this? All I ever wanted to do was help her and make her feel good. I felt like someone had scooped out my insides and left me a languid husk. I couldn’t imagine a worse feeling.\n\nI couldn’t sleep. I stared up at the ceiling and tried to convince myself that she really did care about me. That her happiness that we were together and had made love had brought her survivor guilt rushing back. Christ, I was practically praying the girl I loved was suffering from psychological problems.\n\nI don’t remember if it was three or four when I heard them. Those fucking bells. They sounded so sweet and so clear. I felt like I had after the first time I’d kissed Alina. I saw the version of us from my daydreams, walking the halls, holding hands, smiling and laughing as we argued about whose friends to sit with that day. I felt full again.\n\nThe next thing I knew, I was waking up.\n\nThursday, the 13th, was a snow day. As desperately as I wanted to see Alina again, even just to bump into her, it was a relief not to be in school. I stayed in bed until nearly noon, and then had breakfast with my brother. It was so calm, so peaceful. Nothing to do but play videogames and watch the snow fall. Maybe I’m romanticizing it now, but January 13th, 2000 was the last normal day of my life.\n\n\n\nFriday was my birthday. Sixteen years old. It should have been one of the happiest days of my life, but all I really felt was resolve. I decided I had to know what was going on. Enough was enough. If I couldn’t catch Alina at school or get her on the phone, then I’d just have to make Alina’s house my first stop as a licensed driver.\n\nFletch and I got to school early. Ever since the bells made him drift off the road, he insisted we leave early enough to be sure we were parked before 8 o’clock.\n\nI skipped my locker and went straight for the juniors’ hallway. Halfway there, Drew DeLuca intercepted me, pulling me into an empty classroom.\n\nDrew was co-captain of our swim team and the years spent swimming laps had left him absolutely ripped. He moved me about as easily as he would have a small child and when the door shut behind us, he didn’t loosen his grip.\n\n“Dude, what’s going on with you and Alina?”\n\nThere was something very accusatory in his voice. I tried to step back but he yanked me forward, maintaining his uncomfortably close distance.\n\n“That’s what I want to know,” I mumbled. Drew stared unblinkingly into my eyes, like he was trying to see right through me, as I told him about how Alina had come to me at his birthday party asking me about a reference in Rob’s suicide note. About how we’d kissed at her house, about how Kerry had fallen through the ice, and about how Alina and I eventually made love.\n\nI left out the part about the bells.\n\n“Jesus Christ. Jesus fucking Christ.” Drew dropped his hand from my arm and turned to walk away. The angry edge was gone from his voice but he didn’t sound relieved. “Dude, Sara Cohen told the whole swim team this morning that you, er, that you’re like stalking Alina. Saying you’re like Rob Kennan. Well, actually, she implied you were a hell of a lot worse.”\n\nI sat down hard. I felt like the room was spinning, like the wind had been knocked out of me.\n\n“You’ve got to back off, dude,” he continued. “She’s got a boyfriend.”\n\n“She has a...who?”\n\n“That guy she dated last summer. What’s-his-name. From Bishop Guertin.” What’s-his-name was Ryan Dorset. They’d met at a track meet two years earlier. Ryan Dorset was rich. Ryan Dorset was tall. Ryan Dorset was handsome, and, although I may not be the most objective source on this, Ryan Dorset was a douchebag. The first time I’d ever spoken to him, I was wearing a Radiohead shirt and he quizzed me about their album titles, as if I was some bandwagon follower who had to justify my fandom to him.\n\nHow could Alina do this to me? Take my virginity and then backslide with an old boyfriend? How could she be so shallow? Ryan Dorset. Happy birthday to me.\n\nI would have liked to have stayed hidden in that empty classroom, but the bell rang. Emerging into the crowded hallway, I could feel people staring at me. Whispered conversations halted at my approach. John Landry, who was on the track team with Alina, shouldered me as I came out of the stairwell near the gym’s locker rooms.\n\nIt’s weird how quickly gossip can change your whole world. I wouldn’t exactly call John Landry a friend of mine, but we had sat next to each other in Bio the year before and had always gotten along well enough. Robert Kennan had learned, through no fault of his own, what a rumor could do to your life.\n\nAnd so had Alina. Which made her doing it to me somehow extra-painful. She knew how much the whispers and sidelong glances could hurt, and she was subjecting me to it anyway.\n\nOf course, in fairness to her, what she said about me wasn’t a lie. Not exactly. If only she had talked to me. I wouldn’t have had to go to her house that day.\n\n\n\nMy mom picked me up from school a little early and took me to the DMV. I passed the written exam and the driving test with flying colors. She offered to let me drive home, but I declined. It would turn four while we were still on the road and I didn’t want to risk an accident. If my mom thought it was weird she didn’t say anything.\n\nAfter we got home, I lied and said I wanted my first car ride to be a visit to Scary Kerry, who had been released from the hospital the week before. My parents thought that was sweet, even complimented me on what a good person I was. I thanked them and forced a smile even though I felt dead inside.  \n\nI headed out for Alina’s around a quarter to five. Her parents wouldn’t be home for another hour or two. I swear to God, all I wanted was to talk to her. I never meant for anything else to happen.\n\nPlease believe me when I say that. Please.\n\n\n\nWhen I arrived, there was a car parked behind Alina’s blue beetle that I didn’t recognize. I went up to the door but something stopped me from ringing the bell. It was a queasy feeling. The sort of feeling you get when you know your life’s never going to be the way you want it to. I took a closer look at the car. It had a Bishop Guertin parking pass.\n\nThe son of a bitch was there.\n\nI walked through the yard around to the back of the house. A part of me wanted to catch them red-handed— though it’s not clear to me there was anything to catch. If they were together, I couldn’t exactly call it cheating because if Alina wouldn’t even talk to me, clearly we weren’t going out.\n\nI guess I just had to see it with my own eyes.\n\nI crouched down beside one of the basement windows and peered in. There she was, on the couch where we’d had our first kiss, lying on top of Ryan Dorset. His hands were inside her shirt and hers were working aggressively to undo his belt.\n\nI wanted to leave. I wanted to run away. To scrunch my eyes closed and pretend that I had never seen anything. But I couldn’t. I was held in place by a morbid fascination. It was almost like in a dream when you’re not in control and just watching yourself from the outside. My mind was screaming to go but my feet stayed planted and my eyes drank in every detail. To this day, I remember what I saw from that window even better than I remember our first kiss, or the way Alina always smelled like vanilla, or how it felt when I gave her my virginity.\n\nWhat I saw was Alina unfastening Dorset’s pants and sliding her hand into his fly. It was tough to see her face, but I could tell she wasn’t crying. I could tell she didn’t feel conflicted about what she was doing.\n\nI realized, some months later, that I’d never seen her look that way at me. I’d always been the aggressor. I guess I hadn’t noticed because, at 16 years old, I had internalized the idea that that was what guys were supposed to do, and that good girls were supposed to be, well, not reluctant exactly, I wasn’t so far gone as to think girls didn’t also want sex, but I believed they’d be more demure, less eager.\n\nBut at the time, standing there outside her basement window, I wasn't think of Alina’s perspective. I didn’t consider how she felt about Ryan Dorset, or what she must have thought of me. I could only stare as they wriggled out of their clothes and watch as Alina guided Dorset inside her.\n\nI felt like Adolf Riefler.\n\nThat’s when it turned five and I lost myself completely to the bells. One...I felt warm, but not like before. This was different. It wasn’t like a blanket, it was like a fire. Two...my heart pounded in my chest like thunder in a storm. Three...I was acutely aware of my body, my arms and legs pumping like pistons, the wind blowing past my face. Four...I could feel the weight of something solid in my hand.  Five...once, when I was eleven, I had gotten into a fight at school and it took two teachers to pry me off the other boy. I had given him a black eye and knocked out the last of his baby teeth.\n\nAnger can also feel good. Bloodlust can also feel like home.\n\nWhen the last of the bells tolled, they were replaced by the sound of a car alarm. Alina, only half dressed, was screaming and crying and sobbing, all at the same time. I looked up just in time to see Ryan Dorset, wearing nothing but boxers and a pair of sneakers, punch me in the face. I fell down hard onto the pavement of Alina’s driveway, which was covered in broken glass. Apparently I’d been smashing in his car windows with a large rock.\n\nDorset grabbed me by jacket and pulled me up into a seated position so he could get a good grip on my throat.\n\n“Stop it! Stop it!” Alina shrieked. I’m sure somewhere one of her neighbors was already calling the cops.\n\n“What the fuck’s the matter with you, huh? Why can’t you leave her alone?” Dorset asked. He maneuvered his body weight on top of me, pinning me down as his fingers dug into my neck. It’s an awful feeling, having someone you don’t want to be there on top of you, pressing down.  \n\nThe rock was still in my hand and I swung it with everything I was worth. It hit the side of his face with a sickening crunch. I’d broken Ryan Dorset’s jaw and sent him rolling into the Aminevs’ snow-covered front lawn. He must have been in shock because it took him a second to realize how hard he’d been hit and for the pain to set in. I could see the realization, the fear, in his face. It made me feel good. It made me feel big.\n\nDorset slowly began to crawl away on his hands and knees. I got to my feet and held the rock up, high above my head.\n\n“Please...please...” Alina whispered. All the color had drained from her face. Every bit of her was trembling. Tears rolled unchecked down each of her cheeks. She was looking at me and what she saw scared her. “I’m...I’m so sorry....”\n\nI looked back at her. Her eyes were red from crying. Her lip quivered. She looked a lot older than 17. Suddenly the rock felt heavy and I didn’t feel so big. I let the rock fall from my hand. It landed in the snow with a soft plop.\n\nRyan began to blubber in pain. His words were unintelligible, or maybe I just don’t want to remember what he said. Blood was gushing from his mouth. It stained the snow beneath him as he crawled.\n\nI had not intended for things to turn out the way they did. Alina was terrified of me and that was the last thing I ever wanted her to feel. Especially about me.\n\nI opened my mouth and found no words. I reached out towards her, desperate to comfort her and she recoiled from me with a gasp. Her eyes squeezed shut, bracing for an impact I could hardly blame her for fearing.\n\nI didn’t know what else to do, so I just left. It was the last time I ever saw Alina Aminev.\n\n\n\nI found myself on the highway with the music blaring. I was driving fast down 495. It had to have been at least half an hour since I’d left Alina’s. I had no memory of the intervening time.\n\nI couldn’t go home. I couldn’t. I’d be arrested. This wasn’t like a shoving match. Ryan Dorset would need medical attention. He was the second person in less than a month that I’d put in the hospital.\n\nThen again, where was I gonna go? What was I gonna do?  Make a run for Canada? Even if police wouldn’t soon be looking for my mom’s car, I probably had seven or eight dollars on me and access to another $250 or so in my Bay Bank savings account. Hardly enough to get too far.\n\nI felt dead inside.\n\nThere was only one thing that could make me feel better. I wanted to hear them again. One last time. For real.\n\nI was going to the Quabbin.\n\n\n\nThe sun sets early in the winter. Hell, it had already started going down even before I’d arrived at Alina’s. By the time I’d hit the Quabbin it was a little after 8:30 and dark. I parked the car near the trailer park, as Fletch had done the night Kerry fell through the ice. I remember wondering how close I was to where he’d parked the night Rob found the Spire.\n\nThe walk to the lake took a little longer than last time. There was about four or five inches of snow on the ground and the ploughs had turned the sides of the road into little snowbanks a foot or so high. It made walking on the side of the road slow going. Luckily, I only saw one car drive by and they didn’t pay any attention to me.\n\nIt was bitter cold. I hadn’t noticed at first, but with each step the wind was cutting further and further through that dead feeling. I just kept walking. It was like being back on the hike with Scary Kerry. You’re hyper-aware of your body and all of its aches and pains, but if you just keep walking your brain goes blank.\n\nIt felt good not to think.\n\nI was only about halfway between the entrance to the Quabbin and the reservoir when I heard them. So sweet. So lovely. So warm.\n\nSuddenly it wasn’t so cold anymore. I didn’t feel the wind. Or at least not a winter wind. I felt a warm breeze on my cheek. It smelled dewy and sweet. The full moon shone down on the lush green forest surrounding either side of the dirt road. Hadn’t it been paved only a moment ago?\n\nI could hear crickets. A tiny light flitted past the corner of my eye. Then another. And another. Fireflies, dancing through the air. It was so warm. I took off my jacket and stood watching the fireflies try to find one another in the hopes of mating.\n\nAnd then the bells finished their call and I was standing in the snow, holding my jacket and staring at nothing. I quickly struggled back into my jacket.\n\nI looked back the way I came. The moonlight bouncing off the snow bathed everything in a weak blue light. It was beautiful, but sterile. A much harsher environment than the one in the vision I’d just had.\n\nI had returned to hear the bells one last time, but looking back in the direction of the trailer park, well, there was nothing for me back there, nothing good at any rate, so I turned back towards the reservoir and started walking. One foot in front of the other. Just me and one last mile.\n\nWhen I finally reached the shore, it was nearly nine-thirty. The wind had blown the snow into little drifts leaving some patches of ice bare. In the moonlight, it looked almost like the Quabbin was made of white and blue marble. It was scenic but I barely noticed. I was looking off at the larger of the two islands; its trees, frosted by snow, left it almost invisible against the horizon.\n\nI wondered dimly if the bag with Kristy’s raft and my mother’s Bible was laying somewhere out on that ice. It’d been cold the last couple of weeks and the ice was silent. Either it’d grown thicker or the snow was dampening the sound of its cuh...cuh...cuh’s.\n\nI stepped out on to the Quabbin's frozen surface. It was easiest to walk where the snow was thickest. With each step, I drew closer to the place where Kerry had fallen through the ice, sinking deeper into my self-loathing as did. I almost wanted the ice to give out beneath me. The thought of plunging into the dark depths of the freezing waters below, of having what little warmth I possessed sucked from my body and leaving me numb, physically unable to feel anything, was enticing.\n\nI didn’t want to feel. I didn’t want to think and I didn’t want to feel. Not like this.\n\nI had barely caught a glimpse of Kerry’s face as she fell through the ice. Standing there, trying to picture it, all I could see was Alina, and the horror I’d filled her with.\n\nI considered, for a long moment, stomping my feet in an effort to open up a fissure in the surface of the reservoir. But there was something else I wanted more than the anesthetizing relief the cold offered. I wanted the bells.\n\nBeing close to their source strengthened the memory of how they made me feel when I heard them. It was as if I was being pulled towards them by an invisible string. Actually, it was more like I was underwater, holding my breath, being sucked along by a gentle current. It felt like if I ever wanted to breathe again, I had to go where the waters wanted to take me. I had to find the Spire.\n\nWind pushes snow around capriciously. If the snow can catch somewhere, more snow will pile up on top of it, forming little drifts, like sand dunes in a desert. If there’s enough wind, eight inches of snow might result in some spots where the ground is barely covered and others where the snow runs two, three feet deep.\n\nI didn’t see anything that extreme that night on the frozen surface of the Quabbin, except for one oddly blocky little snow drift. As I drew nearer, I could see, in the moonlight a cloth strap peeking out of the snow. It was my duffel bag. The one I’d dropped after pulling Kerry out of the water.\n\nThe bag had been soaked and left outside for weeks. It felt like a solid block of ice, and probably weighed close to 30 pounds. I doubted there was much in there that could be salvaged. Maybe the raft, but my mom’s bible was almost certainly done for and the incense and various things Kerry and I had accumulated were probably ruined. But I took it up anyway. Leaving it there, so close to the source of the bells, seemed as disrespectful to me as leaving trash behind in the pews at Church.\n\nThe ice in its frozen straps cracked as I slung the bag over my shoulder and pressed on.\n\nIt must have been 9:58 or 9:59 by the time I stepped off the ice and onto the shore of the large island, because I’d scarcely reached the woodline when the bells tolled ten.\n\nI found the ankle-deep snow replaced by a broad dirt road and the snow-capped trees with colonial homes, but these colonials weren’t like the McMansions that dominated my neighborhood. No, even in the near darkness I could see that these were much more solidly built, and each looked different enough from the others that they couldn’t possibly have all been made from the same plan.  \n\nThe bells rang out like thunder. I fell, shaking, to my knees, letting their raw power wash over me. I could feel the sound waves reverberating through my bones. I was vibrating to the frequency of the universe. It felt like staring into the true face of God. My whole body tingled. My whole being crackled with energy.\n\nI wept because it was so beautiful.\n\nI wept because I was unworthy.\n\nI wept because I could do nothing else.\n\nThe call of the bells washed over me like a wave at the beach and sucked me into their undertow. I thought I was leaving this world. I thought my next breath would be at their source. I felt like a weary traveler finally able to rest and a dreamer waking from sleep, all at once.\n\nThen the tenth bell sounded and I was lying in the snow.  It was silent, except for the wind, and I wept for a different reason. I was alone in the darkness, alone in the cold, in a world where I’d lost my place.\n\nThere was no way but forward. There was nothing for me but the bells.\n\n\nForgot to add the continue, so sorry about that.",
        "url": "http://www.reddit.com/r/nosleep/comments/1ojxu6/series_the_spire_in_the_woods_part_7/",
        "title": "[Series] The Spire in the Woods part 7"
    },
    {
        "body": "I had no thoughts of Rob. Out there, on that island, I never considered for a moment that the bells had played a role, a large role, a huge, monstrous role in his suicide. He’d heard them. He’d found them. In the end, he’d put a homemade shotgun in his mouth and pulled the trigger.\n\nI’d like to think that if I had, I might not have pressed on. But when I’m being honest with myself, I know I would have. What’s death compared to knowing? What was so great about my life that it’d be better than hearing the bells at their source?\n\nWhen I stood up, I realized I wasn’t at the shore of the island. I couldn’t even see the shore. I looked around, trying to figure out how I’d gotten so deep into the woods and noticed there weren’t any footsteps behind me. But there was a deep track. It looked like when I fell to my knees, my body had been dragged through the snow.\n\nI should have stopped, but I didn’t stop. I pressed on.\n\nThe colonial houses, the broad, dirt road I’d seen when the bells rang— I felt like I could still perceive where they’d been. Some of the trees, the ones nearest me, were wrong. They were too young. They didn’t belong here. The road was real, even if I couldn’t see it. The houses loomed on all sides, even if I couldn’t see them, even if decades earlier they’d all been moved or destroyed. It was like the present had been superimposed on the past. Everything I saw felt less substantial than what I knew had been there before.\n\nI'd seen the island's true face. I was on a road and the road would lead me to the Spire, the Spire housed the bells, and no new-growth forest could hide that from me.\n\nIt was slow going. My feet were numb. Each time I tripped in the dark, I had to pull my hands from my warm pockets to catch myself before I hit the frozen ground. Some snow had made it into my shoes and was melting. But like the hike where I befriended Kerry, I kept going. Even if I’d wanted to complain, who would I complain to?\n\nI trudged my way deeper and deeper into the woods. I might have been the first person to walk there since Rob had made his way to the Spire back in late August. It’s a weird feeling to be that alone. It’s not privacy. It’s isolation.\n\nWhen I stumbled into the clearing, I almost didn’t see it.\n\nThe Spire.\n\nEverything else around me was frosted in snow, but not the Spire. It was pristine. It stood twice my height, its whitewashed facade nearly invisible against the snow. The Spire had a clean design: four large, flat faces tapering up to a sharp point, the sort of wooden spire you’d expect to see topped with a cross on a Protestant Church. I don’t think I’d have seen it all if it weren’t surrounded by a half-circle of withered, long-dead trees that looked as though they’d been rotting for ages.\n\nAll my hair stood on end. This was the source. The Spire in the Woods housed the bells. I approached it with reverence, like I used to approach the tabernacle after receiving communion. There was an energy in the air, an electricity. I could sense it. The Spire was invisibly warping the space around it. It was like when you were a kid, and your teacher had you sprinkle iron filings around a magnet.\n\nTonight there’d be no deer crossing signs, no air conditioners, no dates that didn’t line up on a family’s tombstones. But soon there would be the bells. Right here. Right in front of me.\n\nMy hand trembled as I reached out towards it. My cold fingers traced their way across the Spire’s wooden surface as lovingly as they had Alina’s skin. And it was even more luxurious.\n\nI circled around the Spire, trailing my hand along its seamless joints, across its flawless paint. I found the window with its panes kicked out and wished I had the skill to fix it. Then a better thought occurred to me. I could go in. I could be in the room with the bells when they sounded.\n\nI pushed my duffel bag through the window. Then, cautiously, gently, I poked my head in. I didn’t meet any resistance, not exactly, but the energy the Spire radiated built in intensity. My scalp tingled, my face felt flush, and my brain sang with excitement, as if all my neurons were firing all at once. Eagerly, I pressed my shoulders through the gap in the window. It was a tight fit, but I wriggled and squeezed my way into the darkness until I managed to get my hips through.\n\nI waited a moment for my eyes to adjust, but it was no use. Outside, I could see by the moonlight; the trees and their shadows stood out starkly against the white snow. But inside, there was nothing. I struggled to open my duffel bag. Ice had formed between the teeth of the zipper, and my fingers, still numb from the cold, had trouble gripping the slider, but eventually it opened enough for me to get my fingers in and force it the rest of the way.\n\nThe flashlights were, of course, gone. The incense was completely destroyed and my mother’s Bible only fared a little better. Half of its pages had gotten wet when I’d used the bag to pull Kerry out of the water and were now frozen together in a block. I found my grandfather’s lighter beneath the raft I’d borrowed from Kristy.\n\nLighter fluid’s freezing point is absurdly low, something like -240 degrees Fahrenheit, so despite having been left outdoors on a frozen lake covered in snow for a month, it actually lit on the third try. The meager orange flame seemed so bright.\n\nI was on a small landing at the top of a flight of stairs. The landing was no bigger than a coffee table, and made of plain, unfinished wood that, unlike the beautiful exterior, had been badly warped by years of trapped moisture freezing and thawing inside of it. There was a hand railing in a similar condition; I was hesitant to lean against it as I held the lighter out over the abyss and peered down. The stairs wrapped around the outer wall of the Spire and disappeared into the darkness. In the flickering light, I could just barely make out a heavy beam stretched across the gap between the winding stairs, two floors below me. That had to be where the bells hung.\n\nIt never entered into my mind that I’d find anything down there but the bells. It never occurred to me to wonder how Amy Lowell Putnam would feel about me descending into her home; into the room where her husband had threaded metal rods into her flesh while she was still very much alive. Into the bowels of the clockwork that hourly displayed her to the townspeople, so her friends and neighbors could be entertained as her corpse zipped along on its track.\n\nI wish I had, but my every thought was occupied by the goddamn bells.\n\nMy first few steps down the weathered stairs were slow and cautious. I’d test each step with my foot before fully shifting my weight, ready to pull myself back at the first sign of danger. They were slick, their surface covered in a fine layer of frost, and they bowed and creaked beneath me. But they held, and with each step I grew bolder, my pace quickening.\n\nBy the time I’d reached the next landing, I was coming down the stairs like a kid on Christmas morning. I felt like one, too, eager to unwrap the presents waiting for me below. I started taking the stairs two at a time. The lighter's orange flame sputtered as I gained speed, threatening to blow out.\n\nA laugh, a mirthful, childish giggle bubbled up from deep within me. I could just make out, faintly, the shape of the bells. They were right there! From the next landing they’d be so close, I’d be able to reach out and touch the nearer of the two!\n\nI leapt down the last three steps. The lighter went out and the landing collapsed beneath me.\n\n\n\nI fell through two pitch-black stories. My body flailed, desperate to find purchase on anything it could, but the only thing I managed to connect with was the floor. My feet hit first and I had the queasy feeling of the wood shattering beneath me. This time, though, only one or two floorboards gave out and I came to a stop with a sickening crack as my chest slammed into the ground.\n\nThe wood floor, though bowed and weathered, didn’t afford my hands any purchase, and I could feel the weight of my legs and stomach dragging the rest of me towards another fall through God only knows how much more inky blackness.\n\nI kicked with all my strength, but couldn’t get my legs up high enough to climb out of the hole I’d created. In that moment, I can’t even truly say that I felt panic. I was a cornered rat, all claws and gnashing teeth. A primal thing incapable of thought or feeling, governed by adrenaline and that basest of instincts, survival. I curled my fingers into hooks and thrashed with everything I was worth, clawing my way to safety.\n\nThe pain of it all crept into my mind slowly as the adrenaline wore away. The fall had knocked the wind out of me, and, as I’d later find out, broken two of my ribs. I can’t say how long I lay there on my back, struggling to pull air back into my lungs, but I can say that every breath I took felt like it was going to rip me open from the inside.\n\nI gritted my teeth and attempted to sit up. My chest felt like it was on fire. I put my hands back behind me, to push myself into a seated position, and felt the sharpest pain of my life. I’d lost three fingernails, those of my left index and middle fingers and my right ring finger, while pulling myself out of the hole in the floor, but what really hurt, what felt even worse than my ribs, was the four-inch splinter that had stabbed beneath the nail of my right index finger and slid out the other side just above the first joint.\n\nI collapsed back to the ground. My hand trembled as I brought my finger to my mouth. I hesitated for a moment, trying to think if there was any way to avoid what I was about to do, but there wasn’t. I was four, maybe five stories below ground, in the woods, on an island, in the middle of a frozen reservoir, surrounded by more woods, miles away from the nearest soul. No one was coming to help me.\n\nI bit down on the splinter and pulled it back out the way it’d come in. My mind screamed the profanities my lungs couldn’t bear to push out. And it was just four slender inches. Nothing compared to what Amy Lowell Putnam had endured.\n\nThough they were raw and bloody, my fingers probed the floor around where I lay, searching for the lighter. The only thing I found was one of my fingernails embedded between two floorboards. I thought about prying it out, but couldn’t imagine what good it’d do me. It’s not as though I could slide it back into place.\n\nOnce I was sure the lighter wasn’t within arm’s reach, I found myself wondering if I even wanted to find it. A part of me knew I’d eventually have to if I didn’t want to starve or freeze to death beneath the Spire, but it hurt so much to move, and hadn’t I come here to surrender myself to the bells one more time? Wasn’t that what I really wanted?\n\nIt was.\n\nSo I sat alone in the cold and the dark waiting for the Widower’s Clock to strike eleven.\n\n\n\nThe clapper of the bells struck their surface with the force of a cannon ball. In that instant, suddenly there was light.\n\nIt was a soft light, but after the total darkness at the bottom of the clock tower, I found the way it glinted off the innumerable gears and tracks and coils filling the room blinding, like glare of the winter sun bouncing off the snow.\n\nA man spoke, his voice small and distant. “So, you’ve heard my bells?”\n\nAdolf Reifler stood, a bent old man, before his workbench. His face was wrinkled and he leaned heavily on a cane, but his eyes burned with an intensity that belied his frail voice.\n\nWhen he spoke again, I noticed his lips didn’t move, “You’re missing what you’ve come so far to see.”\n\nI stood almost automatically and was surprised to find that although I could still feel my injured ribs and see the blood trickling from my mangled fingers, I could move with relative ease.\n\nAdolf turned back to his bench. “The stairs behind you will lead you out.”\n\nI marched across the wood floor where the hole I’d just created should have been. I was dimly aware of the same dreamy feeling I’d had outside of Alina’s house when I had felt compelled to watch her screw Ryan Dorset. I’m not sure if I listened to Adolf because I wanted to— although, make no mistake, I did want desperately to see the Widower’s Clock— or because I had no choice. It felt almost as though I was watching myself as I headed toward the stairs.\n\n“Be sure to try the marmorkuchen,” Adolf said. “It’s really quite good.”\n\nThe stairs dumped me out into the middle of a well appointed room. An oriental rug ran down the center. Ornately framed paintings hung on the walls between each of the windows. It looked like quite a grand foyer, the perfect entrance to any courthouse or place of business out to impress the public.\n\nThe carpet led to a huge pair of double doors and I went to them without a second thought. They opened with ease, despite their size, onto a summer night and what appeared to be a party.\n\nThere were maybe two dozen or so men and a half-dozen women, all sporting old-fashioned suits and dresses, the sort of things they likely only wore to weddings and special occasions. They all stared up over my head, expressions of awe plastered dumbly over their frozen faces. I thought for a moment, just a moment, that they were staring at me, but quickly realized they were watching what I’d come to see, the dance of Reifler’s automatons, and unbeknownst to them, his wife and her lover.\n\nI made my way through the crowd. The bells chimed for only the second time. Time seemed to have become loose, more elastic. My feet were moving at the proper speed but each tick of the great clock dragged out for several seconds. Tiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiick. It was nauseating. Toooooooooooooooock.\n\nI took a spot beside a table full of refreshments. A man in a smart-looking uniform stood behind it, but, like all the other’s, he had eyes only for the clock.\n\nHelping myself to a plate of marble cake and a heavy silver fork, I turned to finally get my first glimpse of the Widower’s Clock in all its glory. The clock tower was illuminated by electric lights, which surprised me as I wouldn’t have thought Enfield had been electrified in the early 1930s. It was easily five, maybe six stories in height. Its base was almost as broad as the width of the Reiflers’ house, and it tapered slowly until it reached the Spire. Its white wood paneling gleamed in the electric light; as grand and audacious as the Tower of Babel, it blasphemously penetrated the starlit sky.\n\nThe second floor was dominated by the tracks where the automatons hourly performed. Adolf Reifler, for all his faults, was truly a masterful engineer. His creations zipped along with such grace and fluidity, it was almost impossible to believe they weren’t alive. Except for two: a sluggish Southern belle and a stiff-limbed Confederate soldier, ironically the two most wooden figures on stage were the only two made of actual flesh and blood.\n\nBehind Amy Lowell and her lover a backdrop, which must have been nearly a story in height, of a grand plantation house on fire rotated slowly into view. The Union automatons, each equipped with small electric lights designed to look like torches, charged towards the plantation house. They touched their torches to cutouts painted up like cotton fields as they went, and everywhere the torches touched, a red light turned on beneath the cutouts, illuminating the cotton flowers, revealing they were made of glass and sparkling as though they were actually on fire.\n\nAs the troops reached the plantation house, another group of automatons rose to greet them. Slaves. I cringed when I saw the slave automatons, they were such racist caricatures. The slaves set about beating their former owners, much to the delight of the New England audience who hooted and cheered as the Rebs received their comeuppance.\n\nThe Southern belle and Confederate automatons crumpled beneath the attack, their bodies folding in on themselves in a way that was only possible if their spines had been broken in multiple locations. The slaves grabbed Amy Lowell’s corpse and dragged it offstage. Two of the slave automatons turned as they departed, flashing toothy grins at the spectators.\n\nAdolf Reifler was not a subtle man.\n\nThe bells rang once more, just as the Union soldiers shot the prone Confederate automaton. The onlookers burst into applause, well, most of it did. I noticed a man just off to my right side hadn’t celebrated. He looked bored, as though he’d seen this all before. Something else was off about him, too. He wasn’t dressed like the others. He was wearing a T-shirt and jeans.\n\nI wasn’t the only one who’d heard the bells. I wasn’t the only one who’d found the tower. And I wasn’t the only one watching the automatons’ endless dance. My eyes scanned the crowd. There was an emaciated man in a park ranger’s uniform, the bones of his face plainly visible beneath his skin, leaning against the end of the refreshments table. There was a boy in a tie-dyed shirt who looked to be about thirteen, his slashed wrists covered his corduroys in blood, but he gave his injuries no notice.\n\nWere they dead? Was I? Had the fall killed me?\n\nThen I noticed another figure sitting alone near the woodline. A young man with a slender build, about my height. His skin, burnt to a crisp, was the color of charcoal and most of his jaw was missing.\n\nRobert Edward Kennan.\n\nWhat was left of his skin flaked off his neck as he turned his head and fixed me with his gaze. Beneath his blackened eyelids, his watery eyes were as blue as a clear sky. Rob patted the ground next to him.\n\nThe bells chimed once more and Rob and I shuddered in bliss.\n\nI took a seat next to him. He tried to speak but his injuries made it impossible to understand him. I think he was trying to apologize for killing himself, or maybe he was just sorry to see I’d followed him to the bells. I don’t know.\n\nWe sat together in silence, watching as another glass backdrop rotated into view: a glasswork of Atlanta. The lights made it flicker as though it was on fire. Time seemed to return to full speed, and the bells finished calling out the hour.\n\n\n\nMy body shivered and my ribs screamed. It was pitch black once more and I was sitting with my back against something, a wall maybe, and my ribs let me know in no uncertain terms that they did not appreciate this position. Slowly, I slid down until I was lying on my back.\n\nI couldn’t fully process what I had seen. In his note to Fletch, Rob had said, “I will soon join them. Staring at her face as she runs the endless race.” Had he known he’d be stuck there when he died? Stuck watching the Widower’s Clock, stuck watching Amy Lowell Putnam endlessly running round and round in the automaton her husband had concealed her in? Was I going to be stuck too? All I could say for sure was that the spell was broken. I never wanted to hear the bells again.\n\nThe cold had numbed my fingers to the point where I could feel little more from my missing nails than a dull ache, and while I was thankful for that small blessing, it also meant that hypothermia and frostbite couldn’t be far behind. I needed to find the lighter. I needed to find a way out of there or my questions about the afterlife would be answered all too soon.\n\nI tried pulling myself along the ground with my arms, but the stress on my ribs was too great. I had to push myself across the ground using my legs. It was painful, but bearable.\n\nThe darkness was so absolute, I had no idea which way I was facing or where the hole was in the floor. I moved slowly, dancing my fingers over the wood, like an insect’s antennae, hoping to find that little metal lighter that could mean the difference between life and death.\n\nI was beginning to panic. I’d searched an area maybe twice the length of my body and found nothing. Not even the far wall. The room had to be huge. I could barely move. What if the lighter had fallen through the hole I’d made when I hit the floor? I was never going to find it...\n\nI began mumbling prayers to myself, just to keep my growing sense of despair at bay.\n\n“Hail Mary, full of grace, our Lord is with thee. Blessed art thou amongst women and blessed is the fruit of thy womb, Jesus. Holy Mary, mother of God, pray for us sinners, now and at the hour of our death. Amen.”\n\nThe Virgin Mary. The most exalted woman in all of Christianity. What could be more comforting than praying to her, the mother of God? Wasn’t I a child in despair? Don’t all despairing children cry out for their mothers?\n\nSo why did it feel so empty to pray to her now?\n\nI didn’t know, but elected to continue my work in the oppressive silence.\n\n\n\nMy fingers were so cold and numb, the lighter didn’t even register when they sent it sliding deeper into the darkness. I only knew I'd found it because of the sound it made sliding over across the warped planks.\n\nI flicked the flint once, and nothing. Twice and it sparked. Three times and it lit.\n\nTo suddenly see the flame was like staring at the sun. It took my eyes several seconds to adjust. That’s when I noticed I wasn’t alone.\n\nFigures stood all around me, casting long shadows along the floor that disappeared into the edges of black beyond the lighter’s reach.\n\nI panicked. I couldn’t run, I couldn’t fight, but I scrunched up my face and braced for an impact that never came. Slowly, I reopened my eyes, and, much to my relief, realized that the figures were automatons.\n\nAfter 60-some-odd years of neglect they were all in a state of disrepair. Their plaster faces were spiderwebbed with cracks; pieces, sometimes full limbs, laid in heaps around their bases.\n\nI was surprised I hadn’t encountered any of the tracks which lay everywhere on the floor, but I suppose I hadn’t covered very much area lying around on my back, nor would I be able to leave by doing so. I gritted my teeth and, despite the pain, forced myself up onto my feet.\n\nThe plaster bodies of the automatons seemed small, scarcely five feet in height, as I picked my way slowly between them. It made Amy Lowell and her lover having been hidden inside one of these things seem all the more grotesque. There was no way Adolf could have done it without chopping off their hands and feet.\n\nOne by one I climbed the stairs, taking frequent breaks when the pain in my ribs grew too intense for me. Eventually I drew even with the bells, which appeared to be rusted fast to the thick iron rings from which they hung. I don’t know why this surprised me so much; I guess somewhere in the back of my mind I thought they’d be made of polished silver and sparkle like starlight.\n\nIn time I reached the collapsed landing. Or rather, reached where it should have been. Now there was nothing but a gap, five feet across, with the staircase continuing its upward climb on the far side. It would have been easy enough to jump if my ribs weren’t broken and I trusted the wood on the other side to hold my weight. But they were broken and I was terrified of taking another fall.\n\nI sat down on the steps and cried, utterly convinced that I would die there and join Rob and Adolf and Amy Lowell, in front of the Widower’s Clock every hour, on the hour, for all eternity.\n\nIt wasn’t fair. Yes, I had chosen to investigate the Spire in the Woods, but I didn’t choose to crave the bells. I didn’t choose for them to warm me when I was cold, or comfort me when I was scared. I didn’t choose to black out at the sight of Alina melting around Ryan Dorset’s member. And I certainly wouldn't claim to have been in my right mind when, just an hour earlier, I chose hearing the bells one more time over searching for a way out.\n\nThe lighter closed with a snap that echoed in the darkness. I had been a Catholic my whole life, but as I sat there on the edge of the broken stairs, straining to see even the faintest sliver of moonlight from the window that laid beyond my reach, I knew that my faith was gone.\n\nI had set out to find evidence that there was more to creation than could be explained by science, and though I’d certainly found that, I felt more alone in the universe than ever. What kind of a God would create a world so cruel that it contained the bells? How could I pretend there was a design and a moral underpinning governing the universe when something as innocuous as a beautiful sound could rob you of your free will, and, by all indications, damn you for it?\n\nEventually I got tired of staring at nothing. It was too cold to keep sitting there. I lit the Zippo and headed back down the stairs. I needed to find a way to warm up.\n\nMy duffel bag was sitting a few feet from the hole I had created in the fall. I pulled out the raft and briefly considered inflating it. It would have been nice not to have to lie directly on the cold, hard floor, but ultimately I decided it’d be best to use it as a blanket.\n\nIt occurred to me that there might be something useful in the floor below. I crept as close to the edge of the hole as I dared, held the lighter over the chasm and peered down. It looked like most of the room below had been claimed by groundwater that had frozen solid. If the planks that broke my ribs hadn’t held, I doubt I would have survived slamming into that ice.\n\nLying back down hurt like hell. The raft didn’t seem like it was going to do much for me, but any insulation was better than none. Reluctantly, I closed the lighter. It didn’t have an unlimited supply of fuel. I’d have to be careful with it.\n\nWaiting for midnight, shivering in the dark, my mind’s eye kept conjuring images of Rob Kennan’s burnt face, his one good eye watering. I really didn’t want to join him, but at the same time, I couldn’t wait to be warm again.\n\n\n\nWith a deafening clang, the bells tolled. It was midnight, and I once again found myself lying on the floor of Adolf Reifler’s workroom.\n\n“You’re back?” He never looked at me, just continued to scan the rows of wrenches that hung from the wall. “People don’t usually come back quite so soon.”\n\n“I can’t get out. The stairs broke.”\n\n“I’m sorry to hear that.” His voice was filled with pity but his unmoving lips retained their scowl.\n\nHe took a wrench from the wall and began picking his way back through the tangled mess of gears that seemed to only exist when the bells were ringing. I followed him to a hidden corner of the room where the Southern belle and Confederate soldier automatons stood. Adolf’s deft fingers pushed the dress down over the Southern belle’s shoulder exposing a bolt on her back. He slipped the wrench over it and set to work.\n\nFrom beneath the lacquered wood Amy Lowell’s bones splintered and popped. My stomach revolted at the sound and I looked for a place to retch. Adolf continued to smile as he gave the bolt another half turn.\n\n“You mustn't judge me too harshly,” came his sad little voice. “You can’t fathom the regret...the burden...I carried with me for the rest of my life.”\n\nHe pulled her dress down further, pausing only briefly to admire his handiwork as he exposed the majority the automaton's body, before continuing on to the next bolt.\n\n“I loved my wife. Despite her faults— her vanity, her frivolity— I loved her. She was mine.” His hands slid up her body, pulling her dress back into place. “But there was no pleasing her.”\n\nHe lifted her arm up by the wrist and let go. Her hand herked and jerked as it fell back into place.\n\n“Scheisse! Scheisse! Scheisse!” He yelled, his lips moving with each curse.\n\nHe grabbed the automaton by her head and twisted it violently in a way no neck could bend. It sounded like cracking knuckles.\n\nThe automaton’s blank eyes seemed to stare right at me. They were such a lovely shade of brown. I was lost in those eyes and thoughts of Alina until Adolf’s wrench returned to work and the sounds of bones crunching shook me from my revelry.\n\n“You mustn’t doubt my love for her,” Adolf whispered through his closed lips. “What you’re seeing...I was simply angry then. It was a malady of spirit, and I admit that I have a temper, but, like squalls on the open sea, my foul moods disappear almost as quickly as they come. Taken against the rest of our marriage, not to mention the courtship, this was a moment. A fleeting moment.\n\n“And it wasn’t as though she was blameless,” he continued. “You can’t possible know...can’t possibly understand the humiliation of seeing another man take what is rightfully yours.”\n\nI felt compelled to speak. I’ve always hated it when someone challenged my experiences, it makes me feel so small, but it was more than that. My mouth moved, and it was like I was outside of my body, listening to myself tell Adolf all about Alina. And what I’d done to Ryan Dorset.\n\n“So you do understand.” He sounded relieved, as if I’d just given him absolution for his sins.\n\nThe bells tolled.\n\nAdolf gave the bolt on the automaton’s elbow a full turn, splintering Amy Lowell’s bones. It was loud, like a branch snapping off a tree in a storm. He again lifted her arm and let it fall. He must have been pleased with the results because he set down his wrench and headed towards the stairs.\n\nI followed him without thinking.",
        "url": "http://www.reddit.com/r/nosleep/comments/1omibh/the_spire_in_the_woods_part_8_series/",
        "title": "The Spire in the Woods Part 8 [Series]"
    },
    {
        "body": "Adolf Reifler slid through the crowd exchanging pleasantries with farmers and businessmen, neighbors and travelers alike. No one seemed to notice me following in his wake. They never looked at me, or reacted to anything Adolf and I said to one another. They also didn’t seem to notice any of the others that were, like me, stuck.\n\nMost of the conversations Adolf had with his guests were brief. They’d offer him the sort of enthusiastic pleasantries I imagine you’d hear anytime a work of art is unveiled, and he’d respond graciously enough, until the man he addressed as Edwin inquired about Amy Lowell’s whereabouts. Something in Edwin’s tone made me think he was interested in more than paying his respects.\n\n“I haven’t seen her all night,” Edwin said.\n\n“Are you sure? I could have sworn she was out here around eleven.” Adolf’s voice dripped with condescension.\n\nThe couplet Rob left in his suicide note to Alina floated to the fore of my mind.\n\n‘And every hour, I see her face, as she runs the endless race.’\n\nWhen I’d first heard the story of the Widower’s Clock I had thought it was cruel that one could be damned just for laying eyes on Amy Lowell’s corpse; after all, we hadn’t killed her, we hadn’t put her on display. What I realized watching Edwin calling it a night was that the partygoers weren’t stuck watching the endless race. If they had been, they wouldn’t have been able to leave. No, only those of us who had heard the bells and followed them to the Spire were stuck.\n\nBut why? They’d heard the bells. They’d heard the real bells. Why weren’t they stuck with us?\n\nMidnight marked the end of the automatons’ reenactment with Lee’s surrender to Grant at Appomattox. Once Lee had signed the articles of surrender, the tent backdrop zipped out of view and dozens upon dozens of automatons took their curtain call, dancing behind the generals like something out of a Busby Berkeley musical.\n\nThe freed slaves came out in a chorus line, doing the cancan as if they were the Rockettes. The partygoers howled with laughter. I wanted to be disgusted, it was every bit as racist as a minstrel show, but no matter how much of Adolf Reifler's cruel indifference was reflected in his work, the Widower's Clock was still too fine a thing to look away from it.\n\nWhen the Southern belle automaton returned, I couldn’t help but notice how sinuously its arms moved.\n\nHer arms.\n\nThe bells tolled once more and I was alone again, freezing in the dark.\n\n\n\nIt was so cold the blood from my fingers froze before it could clot. The raft wasn't much of a blanket. I needed to make a fire or I was going to wind up with frostbite. Half of my mother's Bible was a chunk of ice, but the top half was dry. I began ripping the undamaged portions out. The delicate work was slow going with my fingers.\n\nI twisted up the torn pages and set them in a small pile near the hole in the floor. I wasn't worried that the floorboards would catch; they'd absorbed far too much moisture over the years. Besides, paper burns fast and at a fairly low temperature, especially when each page is as thin as the Bible's.\n\nAfter a few minutes, my hands weren't quite as numb, but it was clear my meager kindling wouldn’t hold out until morning. I needed more fuel if I wanted to survive. My ribs weren't thrilled to be moving again. It would have been so much easier if the bells were ringing.\n\nI didn’t want to love their sound but they were like an ex you just can’t get over. As bad as they are for me, even today, I still crave them.\n\nThe automatons hung lifeless on their posts. Their clothes had largely disintegrated. Moisture had penetrated much of their lacquered finish, spotting them with mold. Even though the years hadn’t been kind, looking at them in the flickering glow of the lighter, they were still marvelous. I ran my hand down the arm of a rebel soldier, almost as lovingly as Adolf had done with the automaton that encased his wife’s remains.\n\nIf I wanted to survive, I’d have to burn it.\n\n\n\nThe area that had once been Adolf Reifler’s workspace was littered with rusty tools and ancient gears. I took up one of the wrenches from where it had fallen, my fingers ached just holding it, and set about dismembering the nearest automaton. The bolts were rusted; it was tough to get any of them to budge. Straining against the wrench made my ribs feel like they’d been replaced with broken glass and fishhooks, but eventually the bolts turned and the arm fell to the ground.\n\nThe wood portion of the arm was no more than a quarter of an inch thick, just enough to cover the clockworks inside and hold the paint and finish. It wouldn’t burn for much longer than the paper. I had to burn them all. The only upside was that I wouldn’t have to unscrew another bolt. The wood was brittle enough that I could smash it to pieces with the wrench, and if I used my off hand, well, it still hurt like hell, but there wasn’t anything I could do about that.\n\nI smashed the Confederate and Union soldiers. I smashed Lee and Grant and Lincoln. I smashed women and children and slaves and then gathered up the pieces. I had already ripped apart and burnt the pages of my mother’s Bible, but somehow smashing the automatons felt worse. I felt like a small child watching the tide wash away a beautiful sandcastle.\n\nThere would never be another clock like this.\n\nThe rack that had once held Adolf’s wrenches on the wall made a decent grate and soon I had a sputtering fire. It wasn’t great, but it was warm enough that I’d live. I draped the raft over my shoulders and slowly laid myself back down. I was out of immediate danger and could feel my body shutting down.\n\n\n\nI woke when the bells tolled one. The fire was gone, Adolf’s workshop was warm, but before I could so much as sit up, their call ended and I was back where I’d begun. I threw more splinters of wood on the fire and laid back down.\n\nSleep didn’t come easy. The automatons’ nude clockwork, exposed for the first time in decades, cast intricate shadows that seemed to dance in the firelight. I couldn’t put my finger on it, but something was bothering me about them.  \n\n\n\nI woke again at two o’clock. It was dark inside the workroom, but when the doors opened for the slave automatons to zip out, the electric lights illuminating the clock poured in. The Southern belle hung limp on her post. Her eyes stared blankly in my direction.\n\nA large backdrop swung out through the door blocking the light. I was alone in the dark with Amy Lowell’s corpse.\n\nOnce the backdrop rotated out of the light, I saw the Southern belle slide out after it. For just a split second, I thought I saw the Southern belle’s head swivel on her neck, as if she were tracking me with her eyes, but it had to have been the clockwork getting her in position to perform. Right?\n\nThen I realized what had been bothering me about the automatons. Fletch had told me Rob put his fingers inside the eye socket of a human skull, but all the automatons, before I’d smashed them up for fire wood, had their lacquered faces intact.\n\nAmy Lowell’s corpse returned to its starting position. Its limbs swung forward like a rag doll’s when it came to an abrupt stop. She was looking at me again.\n\nCould a sculpture have ubiquitous gaze, or was that only paintings?\n\nMy heart was racing as I waited for the bells to ring a second time.\n\nWhy had Adolf painted her face with such a creepy little grin?\n\nIt wouldn’t stop staring. I rose to my feet and turned her head away from me. I did it quick because I couldn’t stand to touch her.\n\nThe bells tolled once more. Was Amy Lowell’s body going to be waiting for me in the dark?\n\n\n\nAmid the kindling, there were only a couple of pieces of wood large enough to use as a torch. It took a painfully long minute, my eyes straining to detect anything out of place in the darkness, to get one of them to catch.\n\nI held the torch aloft in my left hand, and even though I doubted in my present condition that I could ever swing it, I held one of the larger wrenches in my right. The weight of it felt good. It reminded me of the rock I had used to attack Ryan Dorset.\n\nThe floorboards groaned beneath my feet as I moved from automaton to automaton, examining each in turn. The faces weren’t designed to move: beneath the wood each of them had a little metal knob that could never be mistaken for a skull.\n\nThere was a stairwell in the far corner going down to the room below. I had twice used it while the bells were ringing, but now there was nothing down there but ice. Had Rob gone that deep? I doubted the groundwater would’ve been lower in the summertime but I couldn’t say for sure. Cautiously, I went down, one creaking step at a time.\n\nDirt and other particulates made it impossible to see much of anything in the ice, although I thought I could make out some of the furniture I’d seen on my way out to view the clock. I was reluctant to venture too far into the room, lest I slip on the ice and break another bone, but I was sure there was nothing of interest to be found.\n\nMy heartbeat slowed. I was relieved not to have found Amy Lowell’s automaton. Rob could have touched anything in the dark. Maybe he was touching her automaton while the bells rang and then found himself alone in the dark after their last toll, or maybe Fletch got part of the story wrong. Who could say?\n\nI can.\n\nI crept back to my fire, wrapped the raft around me, and let my exhaustion overtake me.\n\n\n\nMy fire had burnt out while I was asleep and I awoke shivering violently. There was plenty of wood, but I was almost out of Bible pages. As I carefully arranged twists of paper beneath some of the thinner splinters, I heard a dreadful sound.\n\nIt was quiet, but impossible to miss; like fingernails on a chalkboard.\n\nI froze. The fire could wait.\n\nThe noise stopped.\n\nI held my breath and strained my ears to listen for even the faintest sound.\n\nNothing.\n\nMaybe an animal had gotten in here with me and scratched its claws across a metal surface. A raccoon or a rat could live down here. Maybe an owl nested in the old gears. I wouldn’t exactly call myself an animal lover, but I found the idea of another living thing being nearby very comforting.\n\nI returned to the work at hand. When you’re building a fire, airflow is key. If the wood presses down on the paper too much, you’ll smother the flame before the wood can catch. My hands were shaking from the cold and it was tough getting the wood to sit right, but I managed it after several tries.\n\nJust as I flicked the lighter to light the paper, the noise came again.\n\nIt was a long, dry screech, the sort of sound a metal gate makes when its hinges need oil. There was no way an animal was making that noise.\n\nDesperately I groped along the ground for the wrench, ignoring the cries of pain from my raw, still-bleeding nailbeds.\n\nThe sound grew closer in fits and starts.\n\nI couldn’t find the wrench in the dark. I could use the lighter, but…\n\nIt was coming from the direction of the automatons. It couldn’t have been very far away. Ten feet, maybe fifteen.\n\nI didn’t want to look. I didn’t want to see what could be making that noise. I gave up on the wrench and crawled backwards, trying to get away.\n\nIt drew closer.\n\nMy hand found nothing but air and I was momentarily filled with that sickening feeling of falling until my back slammed hard into the wood at the edge of the hole. With my shoulders stretched over the ledge, the strain on my ribs was unbearable. I had to bite my tongue to keep from crying out in pain.  \n\nThe lighter was my only chance to get around the pit.\n\nI didn’t want to look.\n\nI was shaking so badly I nearly dropped the lighter.\n\nAnd then the noise stopped.\n\nI sat in pitch black and total silence, my heart still racing, unsure of what to do. Light my way around the hole? Search in the dark for the wrench?\n\nWhatever it was didn’t give me long to ponder. The small thud of something heavy hitting the wood echoed through the room, followed by a dragging sound.\n\nI flicked the lighter once, and nothing.\n\nThe sound grew closer.\n\nTwice, and it lit.\n\nStanding over me was the Southern belle automaton. The polished wood veneer was badly burnt in places. The left half of its face was broken away, revealing the hollow eye socket of Amy Lowell Putnam’s skull.\n\nI screamed until my broken ribs forced me to stop, but what remained of Amy Lowell’s wooden face just stared back at me, as blank as ever. Her head was still twisted around like I had left it at two o’clock.\n\nShe stepped unsteadily towards me. Her limbs were stiff, her movements spastic and unnatural. It was almost as if she wasn’t in complete control of her own body. The pole, which had once pulled her along the clock’s tracks, making her dance, hung down from between her legs and dragged on the floor behind her.\n\nMy eyes darted down, looking for the wrench. She was standing right over it.\n\nFor a moment, as slow as she moved, I thought I’d be able to outrun her, but as I stood, and turned to skirt the hole, she showed me I was mistaken. Her arms sprang forward with such force they almost knocked me to the floor. Her wooden fingers dug into my shoulders, pinching my flesh against the bone. Her face, all the while, remained as impassive as a porcelain doll’s.\n\nI couldn’t bear her looking at me, so I dropped the lighter.\n\nWe struggled there in the dark, on the edge of the hole. Crying and sniveling I begged for my miserable life as she forced me down to my knees. I felt the heavy, metal pole that impaled her corpse brush against my leg as she continued to maneuver my body against my will.\n\nShe turned me around, forcing me first to my hands and knees before finally shoving me down onto my stomach. Her hands pinned my shoulders to the ground. I could feel her torso folding itself; the remains of her spine must have been bent at a right angle. The metal pole rose and fell, rose and fell, each time smacking the floorboards with a dull thunk. Her chest kept twisting, like a wasp moving its abdomen into position to sting. I didn’t fully process what was happening until the pole came down hard on my inner thigh. Amy Lowell Putnam intended to treat me to some of what she’d endured at her husband’s hands.\n\nI stopped thinking. I stopped feeling. I was too terrified for that. I flailed my limbs. I scratched at the wood floor with my remaining fingernails.  When my hand came down in the hole, I didn’t even consider the consequences. It was the only way I might possibly avoid being sodomized by the automaton and I took it.\n\nI pulled with every last ounce of strength I could muster. My ribs screamed in agony, blood started gushing from my fingers once again, but I kept pulling, dragging myself and Amy Lowell right to the very edge.\n\nThe pole came down on my leg again; it felt like being hit by a hammer. When she raised the pole once more, I pulled my upper body over the edge and rolled my shoulders down. Amy Lowell’s weight must have been off-balance because she went spilling over the edge, landing on the ice below with a sickening crash.\n\nI was back where I’d started. Lying in the pitch black, struggling for breath.\n\nFrom the hole came a small sound. Almost a scratching noise. Then a thud. Followed by more scratching.\n\nAmy Lowell was still moving.\n\nI fumbled about on my hands and knees until I found the lighter. It lit on the third try.\n\nI held it over the hole in the floor. Amy Lowell’s head had been twisted nearly 180 degrees in the fall. A chunk of her skull, from just over her eye socket, had been knocked out, along with more of the Southern belle veneer, but hadn’t slowed her spastic movements. Her wooden hands and feet struggled to gain purchase on the ice.\n\nMy feet started moving. I had no clue where to go. Where could I? There was no way out. I just had to get as far away from Amy Lowell Putnam as I could. I grabbed the wrench as I passed and took to the stairs.\n\nThe flame sputtered as I climbed. I had no idea how much lighter fluid I had left and found myself wishing I had grabbed another piece of wood I could have used as a torch. It held out, though, all the way to the topmost stair I could reach.\n\nI sat down and quietly closed the lighter. My mistake became obvious the moment I heard her pole rise and fall on the first step of the staircase.\n\nThump.\n\nI had nowhere to go.\n\nThump.\n\nI was more trapped than I would have been in the wide-open room below.\n\nThump.\n\nI had to get out of there, out of the Spire.\n\nThump.\n\nI lit the zippo once more and held it aloft.\n\nThump.\n\nCould I make that jump? How stable were the beams holding up the stairs?\n\nThump.\n\nBeneath the gap in the stairs, Amy Lowell’s corpse continued its climb.\n\nThump.\n\nIt was only five feet, give or take, separating me from the surface. Nothing.\n\nThump.\n\nOf course, the stairs were higher on the far side of the gap...\n\nThump.\n\n...and the wood probably couldn’t support me landing on it...\n\nThump.\n\n...and I was in no condition to jump.\n\nThump.\n\nThere was no way I could make it. I was stuck and she was coming for me.\n\nThump.\n\nI slumped down on the top step. All I could think was, “I don’t want to die. I don’t want to die. I don’t want to die.”\n\nThump.\n\nThen I thought that dying might be preferable to what she had planned for me. I could just lean back and fall: splattering my brains all over the floor below.\n\nThump.\n\nBut what if I didn’t die? What if I only broke an arm or my legs? She’d turn around…\n\nThump.\n\n...and come get me.\n\nThump.\n\nThere was no running. If I was going to survive, I’d have to fight. I had the wrench. I had the high ground. Maybe I could get lucky and toss her over the edge, or, worse-case, scenario take her with me.\n\nThump.\n\nThump.\n\nThump.\n\n\n\nThere were eighteen steps between each landing. The pole hanging down from between her legs prevented her from standing. She had to crawl on all fours. Her hands and feet sounded like hard-soled shoes against the wood steps. Each time she reached a landing, the pole would drag across the ground.\n\nWhen she reached the landing below me, I sparked the lighter and set it against the wall, hoping that’d be enough to keep it from getting knocked over in the fight to come.\n\nAmy Lowell didn’t react; she just kept climbing.\n\nI stood and raised the wrench over my head. My breathing was rapid and shallow.\n\nHer head was still twisted around on her neck, staring off into the darkness.\n\nShe stopped just outside my reach. Still as a stone, she appeared every bit as inanimate as all the other automatons.\n\nWas she trying to lure me in, or draw me away from the edge? Why was she just sitting there?\n\nMy arm was beginning to shake. I couldn’t hold the wrench up for much longer. It was now or never.\n\nBefore my foot could hit the step below mine, her arms and legs uncoiled and she exploded forward. My wrench hit feebly on her back as her wooden hands latched onto my throat. Together, we began falling backwards towards the gap in the stairs.\n\nJust before we slipped over the edge, the bells tolled.\n\nMy back slammed against the stairs. The automaton was gone.\n\nMy brain was still panicking. I couldn’t think of anything but her. Where was she? Where was Amy Lowell Putnam’s body?\n\nShe was running the endless race, down at the bottom of the stairs.\n\nI scrambled to my feet, determined to put more distance between us.\n\nThe stairs were solid beneath me. It was a good feeling, one we take for granted most of the time.\n\nThe bells rang a second time just as I reached the slatted windows at the top of the Spire. A dizzying notion bubbled out of my subconsciousness. If I was standing here when the bells stopped ringing, what would happen? When the bells had finished tolling eleven, I had been shunted inside, but not back to where I had begun.\n\nCould I leave? Could it be that simple?\n\nI raised the wrench in my hand. It would make short work of thin wooden slats.\n\nBut I couldn’t do it.\n\nThis was the Spire. The real Spire and not it's decrepit remains. It housed the bells. The note they sang was beautiful beyond comprehension.\n\nI knew it was crazy, I knew it was my life on the line, but I couldn’t destroy any part of the Widower’s Clock, not while the bells were ringing.\n\nYou can’t understand unless you’ve heard them ring. The vibrations penetrate you. Infuse you. Permeate you. You would do anything to hear the bells, sacrifice anything, no matter how much you’d regret it later. No matter how much they scared you, or made you question your humanity.\n\nTo hear their call is to be owned by them.\n\nGently, I laid the wrench on the ground and began removing the slats one at time, careful not to chip the paint. I felt like a fool, I knew I should have just bashed my way outside. I knew it, but I couldn’t do it. Instead I was treating the removal of each slat as if I was an artist restoring the Mona Lisa.\n\nThe bells would ring again any second and that’d be it. Maybe I’d be up here on the landing, maybe I’d be back on the stairs where I’d started. Maybe Amy Lowell’s automaton would be with me, or maybe I’d be alone in the cold and the dark.\n\nFinally, I’d removed enough slats to squeeze through into the moonlight. Clinging to the Spire for dear life, I hazarded a downward glance. The party appeared to be over, but I could still make out those poor lost souls I’ll join one day, stuck watching the endless race for all eternity, and I could see some of the automatons illuminated by the harsh electric lights, two of them moving stiffly, zipping along their tracks.\n\nThe bells rang for the third and final time. I scrunched my eyes closed—if it hadn’t worked, I didn’t want to know—and stepped off the ledge.",
        "url": "http://www.reddit.com/r/nosleep/comments/1op0k9/the_spire_in_the_woods_part_9/",
        "title": "The Spire in the Woods part 9"
    }
]